[
    {
        "date":"2025-09-18 19:07:54",
        "rating":5,
        "review_text":"Instagram is all about the visuals. I love scrolling through and seeing beautiful photos and creative videos. It's my main source of inspiration, whether it's for travel, food, or just cool art. Stories and Reels are a fun way to share quick moments, and I find it’s a much more positive and curated space than other social media platforms.",
        "thumbs_up_count":139466,
        "title":null,
        "id":1,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-09-21 17:24:51",
        "rating":1,
        "review_text":"Instagram used to be such a fun app and now all I experience is frustration. After editing photos for a post for the last hour it just quit and I lost all the work and time. What a joke!! 0 stars and two thumbs down. STILL HAVING ISSUES!! Can't edit, freezes most of the time. New update is glitching, won't bring up tools, and tools aren't as easily accessible and less user-friendly. Can't edit pics.",
        "thumbs_up_count":40547,
        "title":null,
        "id":2,
        "theme":"App Crashing & Freezing",
        "sentiment":"Negative",
        "tag":"App Crash"
    },
    {
        "date":"2025-10-16 16:56:06",
        "rating":2,
        "review_text":"The friends requests which I recieve have now piled up to 70+ but I can can't check for more than 10 requests at a time, because further it keeps buffering... This is happening for months now This app might be a very good app for social connections, but the bugs are increasing slowly. Now, it keeps showing notifications of the accounts that have been deleted!! I don't know if I can have a substitute of instagram, but THIS should not continue.",
        "thumbs_up_count":5106,
        "title":null,
        "id":3,
        "theme":"Minor Feature Bugs",
        "sentiment":"Negative",
        "tag":"Loading Error"
    },
    {
        "date":"2025-11-03 14:33:09",
        "rating":1,
        "review_text":"experience so far is the worst of what I can say ... sometimes it shows a really weird glitch and it's annoying af bro. like u can see a message pop up in the notification but when I open the chats there's no msg from the other side... sometimes I have to uninstall and then install the app again more than 5 times a day and now I can't even install it back !!! I hope u sort this out",
        "thumbs_up_count":4403,
        "title":null,
        "id":4,
        "theme":"Minor Feature Bugs",
        "sentiment":"Negative",
        "tag":"App Stability"
    },
    {
        "date":"2025-09-21 18:34:46",
        "rating":2,
        "review_text":"Moderately Fun, if not Slightly Invasive. The app is an alright place to see posts made by friends, but it's basically an Ad focused marketplace. There's pretty much only social media marketing here and a few small businesses, and it's lost its original intention of being a photo sharing app. The customer service is also pretty much not there at all and there is no moderation of comments, so it's become a hot bed for the worst possible responses on social media to exist so much so its a joke.",
        "thumbs_up_count":4377,
        "title":null,
        "id":5,
        "theme":"Too Many Ads\/Reels",
        "sentiment":"Negative",
        "tag":"Ad Overload"
    },
    {
        "date":"2025-10-16 23:19:51",
        "rating":3,
        "review_text":"I've turned on notifications for several pages, but I never get notified (not even when I open the app). I've verified that notifications are on in my system settings. It's super annoying because a lot of college clubs only post events on Instagram, so if I don't check regularly I miss events. Fix the notifications!",
        "thumbs_up_count":3564,
        "title":null,
        "id":6,
        "theme":"Minor Feature Bugs",
        "sentiment":"Negative",
        "tag":"Notification Issues"
    },
    {
        "date":"2025-11-28 13:36:47",
        "rating":1,
        "review_text":"Got a new phone and cant log in to my account that I've had for YEARS with the password and email address that have literally NEVER changed. It just keeps saying that it's a suspicious log in attempt..... so you're telling me that you can only log in from one device ever? Even with the correct information? What a joke. Also, I've contacted support multiple times in the past few days with no response. Uninstalled.",
        "thumbs_up_count":3044,
        "title":null,
        "id":7,
        "theme":"Customer Service & Login",
        "sentiment":"Negative",
        "tag":"Login Issues"
    },
    {
        "date":"2025-11-05 19:52:09",
        "rating":3,
        "review_text":"Great app love it, keep it up! Even though sometimes videos take a while to upload but all's good! Still good! (update: the app has changed so much, I love all the filters that are available. videos sometimes still take long to upload but what do you expect. I dislike the whole meta integration though. it feels like other apps in that aspect now.)",
        "thumbs_up_count":2910,
        "title":null,
        "id":8,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-08 23:32:05",
        "rating":1,
        "review_text":"The reels overflow is unbearable and unhealthy - I understand you want people to use the app more, but at the same time it's almost unethical. The newest app layout where they made it possible to swipe from the homepage to the reels page is a doomscroller's horror and the messages are no longer a swipe away. You're easily repurposing your app. At least make the feature toggleable - consider that not everyone would like to watch brainrot and would rather text their friends and family instead.",
        "thumbs_up_count":2755,
        "title":null,
        "id":9,
        "theme":"Too Many Ads\/Reels",
        "sentiment":"Negative",
        "tag":"Reels Saturation"
    },
    {
        "date":"2025-11-07 13:59:52",
        "rating":3,
        "review_text":"Everybody knows Instagram is the best app. However, it has it's flaws like everything else. The feature of being able to see your followers likes, and they being able to see your either needs to go, or be optional. It's quite intrusive. Second the algorithm feeds way to many ads and sometimes I miss family and friends post.",
        "thumbs_up_count":2203,
        "title":null,
        "id":10,
        "theme":"Too Many Ads\/Reels",
        "sentiment":"Negative",
        "tag":"Ad Overload"
    },
    {
        "date":"2025-11-06 00:18:09",
        "rating":1,
        "review_text":"WHY does it always change my settings on me? I DO NOT WANT MY STORY\/STORIES BEING SAVED TO MY PHONE. Thank you! I keep turning it off, yet I go into my photos every couple of days, and my stories are there⁉️ helllooo",
        "thumbs_up_count":2101,
        "title":null,
        "id":11,
        "theme":"Minor Feature Bugs",
        "sentiment":"Negative",
        "tag":"Settings Reset"
    }
]