[
    {
        "date":"2025-11-25 13:46:45",
        "rating":4,
        "review_text":"In today’s digital era, PhonePe has been very helpful for me. I am satisfied with its services such as on-time payments, successful transactions even in low network conditions, instant transaction alerts, and especially the security alerts for unknown or potentially fraudulent payment parties. However, along with these useful features, I have also faced some issues. Even after long-term usage, I do not receive cashback or reward bonuses. Phone verification is often required again while accessis",
        "thumbs_up_count":2306,
        "title":null,
        "id":1,
        "theme":"Rewards and Fees",
        "sentiment":"Negative",
        "tag":"Missing Rewards"
    },
    {
        "date":"2025-11-28 12:20:17",
        "rating":5,
        "review_text":"Ireally appreciate this app, but I think it would be great if it had a separate savings feature. This would allow users, especially students, to set aside money for future use, keeping it separate from their spending money. Currently, it's easy to spend all our money on payments, leaving nothing for savings. A dedicated savings option would be a wonderful addition to the app.",
        "thumbs_up_count":841,
        "title":null,
        "id":2,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-23 10:15:23",
        "rating":5,
        "review_text":"\"PhonePe is a fantastic app for all my payment needs. The interface is simple, transactions are quick and seamless, and I love the [mention a specific feature like cashback, bill payments, etc.] it offers. Highly recommended for hassle-free digital payments!\"",
        "thumbs_up_count":424,
        "title":null,
        "id":3,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-12-01 14:56:57",
        "rating":5,
        "review_text":"I've been using this app for more than an year. Both receiving and payment takes place smoothly. It helps me to pay exact money to the shop keeper without buying chocolates for changes. It actually stopped me going to ATM. It also helps me in my businesses.",
        "thumbs_up_count":98,
        "title":null,
        "id":4,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-22 14:27:16",
        "rating":2,
        "review_text":"Reason why phonepe se not my default app- Cons: -Delay notification (Already reported several times but not fixed yet I don't want to receive payment notification after 24 hours after the actual time), Lack of cashback as compared to Amazon pay, Useless voucher, Need improvement in payment history Pros: -Clean UI as compared to other UPI apps, Customisation of UPI ID",
        "thumbs_up_count":80,
        "title":null,
        "id":5,
        "theme":"Rewards and Fees",
        "sentiment":"Negative",
        "tag":"Missing Rewards"
    },
    {
        "date":"2025-11-23 19:42:06",
        "rating":1,
        "review_text":"I have made a payment first then it shows the payment is pending then I again done a payment and then after the another payment succeed and after some time the previous one also succeed , and the receiver says he didn't receive the payment twice I lost my amount , that's why I am uninstalling this application . please go for paytm or gpay rather than this",
        "thumbs_up_count":54,
        "title":null,
        "id":6,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Failed Transaction"
    },
    {
        "date":"2025-11-30 17:07:41",
        "rating":5,
        "review_text":"After a long time, I was able to log in to my PhonePe account, and it is functioning smoothly at present. However, during transactions, it is taking a very long time to complete. Kindly look into this issue and rectify the problem. Apart from this, I have not noticed any other issues. Thank you very much to Phonepe for solved my login issue.",
        "thumbs_up_count":53,
        "title":null,
        "id":7,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"App Slowness"
    },
    {
        "date":"2025-11-27 04:40:40",
        "rating":1,
        "review_text":"My issue still exists even after multiple attempts to resolve it. It has been over a week and the bank account activation error is still not fixed. Customer care is unhelpful — no option to connect with an executive, only product promotions. Very disappointing experience.",
        "thumbs_up_count":30,
        "title":null,
        "id":8,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"No Human Contact"
    },
    {
        "date":"2025-11-27 19:22:51",
        "rating":1,
        "review_text":"📣Not easy as it was before,lots of things in one app making it complex to use. 📢Payment app should be payment app nothing else 1.Not user friendly at all🆘 2.Missing features, 💳Tap to Pay NFC support(very needed option) 📃 Transaction details are very complex,hard to identify what the transition made for. 3.Keep it minimalist guys Move all other promotional things and add ons to other app As u say, no.1 payment app should be for payments only right 😀",
        "thumbs_up_count":28,
        "title":null,
        "id":9,
        "theme":"Cluttered App Design",
        "sentiment":"Negative",
        "tag":"App Clutter"
    },
    {
        "date":"2025-11-23 07:10:42",
        "rating":2,
        "review_text":"I’m facing a serious issue with my PhonePe login\/reset process. Whenever I enter my password, the app says it’s incorrect. When I try to reset it, the reset works, but after creating a new password, the app again says the password is wrong. I’ve tried multiple times, but the same problem continues. Please help me understand why the password is not being accepted even after a successful reset. I need this resolved so I can access my account normally.",
        "thumbs_up_count":26,
        "title":null,
        "id":10,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Account Access Issue"
    },
    {
        "date":"2025-11-29 13:21:52",
        "rating":1,
        "review_text":"I reached out to the customer care helpline because I’ve been having a serious issue: my account balance dropped to zero without any transaction from my end. When I called, I ended up talking to an AI system that didn’t really understand the issue and couldn’t assist me properly. I also sent an email but haven’t received any response yet. Overall, I’m quite frustrated with the lack of support and I’m considering leaving a review on the app about this experience.",
        "thumbs_up_count":24,
        "title":null,
        "id":11,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Unresolved Issues"
    },
    {
        "date":"2025-11-28 17:35:43",
        "rating":5,
        "review_text":"It's a Great APP! way better than other Apps in same category (I don't want to name those other Apps-you anyways know them) Here in Phonepe, Interface is more smooth, sleek, more stylish yet more user-friendly! that's the KEY for us! 👍🏻👌🏻PLUS-Apart from anyways supporting English (which is obvious & mandatory) I feel Phonepe seems to support more Regional Languages & Functions as compared to other Apps...the name Phonepe (Main Abhi Phone-pe hoon) is also more INDIAN Hindi Sounding, Right!...",
        "thumbs_up_count":13,
        "title":null,
        "id":12,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 21:54:01",
        "rating":1,
        "review_text":"Useless offers, making customers fool. Made me to sign-up UPI mandate for giving ₹1 JioSaavn offer. Then, deducting ₹89\/month. Jio App reports error for canceling. Switching to CRED. PhonePe Coupons are not useful, expecting some cashback offers.",
        "thumbs_up_count":13,
        "title":null,
        "id":13,
        "theme":"Rewards and Fees",
        "sentiment":"Negative",
        "tag":"Unexpected Fees"
    },
    {
        "date":"2025-12-01 11:08:31",
        "rating":5,
        "review_text":"I recently received a quick resolution from the PhonePe support team, and I’m really happy with the experience. The app is smooth, reliable, and honestly one of the best UPI applications in India. Payments are fast, the interface is clean, and overall the service is very user-friendly. Thank you, PhonePe, for the excellent support and for providing such a trustworthy UPI platform!",
        "thumbs_up_count":11,
        "title":null,
        "id":14,
        "theme":"Poor Customer Support",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-26 12:24:03",
        "rating":1,
        "review_text":"This app has a super frustrating glitch. When I open it, it skips the MPIN screen and goes straight to the home page. A few seconds later it suddenly asks for the MPIN, and if I’ve already tapped something on the screen before it, the fingerprint and password buttons stop working. I get stuck on the fingerprint screen for eternity and have to restart my phone every time. It’s happened 7–8 times and it’s honestly ridiculous. Phone-pe more like Pain-pe.",
        "thumbs_up_count":9,
        "title":null,
        "id":15,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Security Glitch"
    },
    {
        "date":"2025-11-26 07:51:22",
        "rating":5,
        "review_text":"PhonePe has revolutionized the way I manage my finances, offering a seamless and secure digital payment ecosystem! The app's intuitive interface, robust feature set and lighting-fast transactions have made managing money a breeze. Kudos to the team for crafting such an indispensable tool that's put control back in my hands - a game-changer for India's digital payment landscape! 👏",
        "thumbs_up_count":8,
        "title":null,
        "id":16,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-26 02:12:34",
        "rating":5,
        "review_text":"It use to work really well, but now a days whenever i send a request from amazon or Flipkart or any other local store to phonepe upi id then i dont recieve any notification nor vai sms not even in app notification menu. Hence i had to use another upi app ... Plz fix it",
        "thumbs_up_count":7,
        "title":null,
        "id":17,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-23 09:13:28",
        "rating":4,
        "review_text":"I have been using it for many days and it is working very well. Yes, but it doesn't work if the data speed decreases even slightly. But overall it is good, besides this, I don't use any other UPI.",
        "thumbs_up_count":6,
        "title":null,
        "id":18,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-12-01 04:01:25",
        "rating":1,
        "review_text":"Review Title: ⚠️ BIG TRAP: Do NOT use PhonePe AutoPay! Worst Support Ever. Review: \"I am writing this to warn everyone: NEVER set up an AutoPay\/Loan Mandate on PhonePe. Once you set it up, there is NO option to delete or cancel it manually. I mistakenly set up an AutoPay for my IDFC Loan. I paid my EMI in advance directly to the bank and even switched my payment mode to NACH. IDFC Bank officially confirmed via email that they do not require the PhonePe AutoPay anymore and asked",
        "thumbs_up_count":5,
        "title":null,
        "id":19,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Product Feature Issue"
    },
    {
        "date":"2025-11-22 04:10:48",
        "rating":5,
        "review_text":"Useful. Got stuck a few times last year, when it asked for verification each time. Not an issue anymore. Hassle free.",
        "thumbs_up_count":4,
        "title":null,
        "id":20,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-23 13:14:49",
        "rating":5,
        "review_text":"Bring Money Manager that track credit and deposit through upi, sets up budget categories of spend , location of spend , like axio app within Phonepe it will be boost for this app. @phonepe",
        "thumbs_up_count":4,
        "title":null,
        "id":21,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 06:02:40",
        "rating":1,
        "review_text":"Phone pay smart speaker not charging...Despite complaining many times. No response.. very worst customer service.I think I can switch to Gpay... No action has been taken despite complaints for the past 2 months.very very worst customer service.. no response...",
        "thumbs_up_count":4,
        "title":null,
        "id":22,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Unresolved Issues"
    },
    {
        "date":"2025-11-24 03:32:59",
        "rating":5,
        "review_text":"awesome app! only one that will work after i rooted my phone. please keep this feature, we don't root the phone because we are trying to hack, we root to get rid of bloatware and Chinese spyware on Xiaomi phones",
        "thumbs_up_count":3,
        "title":null,
        "id":23,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 12:11:51",
        "rating":1,
        "review_text":"balance is not being updated ... please resolve this ASAP ... this issue has caused a lot of havoc ... it's my humble request to the phone pe back-end team to resolve this issue ASAP",
        "thumbs_up_count":3,
        "title":null,
        "id":24,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Balance Display Error"
    },
    {
        "date":"2025-11-23 07:50:22",
        "rating":1,
        "review_text":"No spend analysis option in phonepe which have in BHIM and Payzapp.. you have to add the option for Monthly spend analysis and catagory wise for better smooth function.",
        "thumbs_up_count":2,
        "title":null,
        "id":25,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-25 16:40:54",
        "rating":1,
        "review_text":"too worst experience of phonepe from life 7 years usage, Right now it tooks too much time for refreshing and payment through mobile number is not visible, delays king is now Phonepe. gpay is better option to do a transaction",
        "thumbs_up_count":2,
        "title":null,
        "id":26,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"App Slowness"
    },
    {
        "date":"2025-11-26 12:42:21",
        "rating":1,
        "review_text":"I have been unable to do any payments since the last update trying to reach out to phonepe support but no luck reaching them out only bot caller is there no option to speak with any support guy highly disappointed not sure how people can reach out to you guys in case of emergencies?",
        "thumbs_up_count":2,
        "title":null,
        "id":27,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"No Human Contact"
    },
    {
        "date":"2025-11-30 13:30:32",
        "rating":1,
        "review_text":"it is totally not secured, after closing the app, it opens without passkey. while other apps always asking for passkey everytime to open your UPI. And there is no any option to lock your app after back key press.",
        "thumbs_up_count":2,
        "title":null,
        "id":28,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Security Glitch"
    },
    {
        "date":"2025-11-22 09:24:25",
        "rating":1,
        "review_text":"wrost experience! idk why but every time I make payment and close the app next time it doesn't open it just freezes I have to uninstall it and then install it again . too much headache",
        "thumbs_up_count":1,
        "title":null,
        "id":29,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"App Crash \/ Freeze"
    },
    {
        "date":"2025-11-24 10:57:12",
        "rating":3,
        "review_text":"I don't need loans. how do I block loan notification and display on the screen? half of the UI is about loan offers hoping that I will accidentally click on the button someday.",
        "thumbs_up_count":1,
        "title":null,
        "id":30,
        "theme":"Cluttered App Design",
        "sentiment":"Negative",
        "tag":"App Clutter"
    },
    {
        "date":"2025-11-25 06:03:22",
        "rating":4,
        "review_text":"This is nice app but whenever I open it the display doesn't move and I'm unable to do any payment that's so frustrating I had uninstalled forced stop updated even restarted my phone but still the same problem occurring",
        "thumbs_up_count":1,
        "title":null,
        "id":31,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"App Crash \/ Freeze"
    },
    {
        "date":"2025-11-26 07:02:48",
        "rating":1,
        "review_text":"keep updating n it's not changing the amounts of money, sometimes i don't get notification when get transferred to my account n when refresh it, it shows the same amount of money even i add extra",
        "thumbs_up_count":1,
        "title":null,
        "id":32,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Balance Display Error"
    },
    {
        "date":"2025-11-26 13:24:26",
        "rating":1,
        "review_text":"Get the split expenses reminder for those who didn't settle their share after splitting expenses, So get an option in which payer can send them reminder to pay it. After that i can give you 4 stars as a review.",
        "thumbs_up_count":1,
        "title":null,
        "id":33,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 05:41:52",
        "rating":1,
        "review_text":"Shows \"Something went wrong\" since 4-5days while I try to add bank accounts so I don't know hot resolve or contact to phone pe team so plz escalate this issue and try to resolve ASAP thank you.",
        "thumbs_up_count":1,
        "title":null,
        "id":34,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Account Access Issue"
    },
    {
        "date":"2025-11-29 07:36:20",
        "rating":2,
        "review_text":"All features are super. But once a wallet close, there is no chance to reactivate option. Please change that.",
        "thumbs_up_count":1,
        "title":null,
        "id":35,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 17:25:20",
        "rating":2,
        "review_text":"same issue again, not receiving calls for service support timely. as a regular user needs to hear my words and do my refund soon",
        "thumbs_up_count":1,
        "title":null,
        "id":36,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Unresolved Issues"
    },
    {
        "date":"2025-11-30 19:12:27",
        "rating":1,
        "review_text":"Worst app. Terrible support from PhonePe. I really wish RBI cripples PhonePe and make BHIM app supreme. Would be happy to see PhonePe going out of business. Update: I had to add this to expose their trick. As a response to my review, they asked for more details. But I already had a month long ticket with them that they never bothered to resolve. Update 2025 Still the worst app. Credit card application form DOB field has a bug causing it to start a date counter back wards. Pathetic.",
        "thumbs_up_count":1,
        "title":null,
        "id":37,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Unresolved Issues"
    },
    {
        "date":"2025-12-01 01:20:59",
        "rating":4,
        "review_text":"Great easy to make different types of payment like electricity bills credit card bills and of course UPI transaction . I have to a feature request thought of its possible to categorize the transaction in categories like food shopping grocery expenses as most of payment are being the Great easy to make different types of payment like electricity bills credit card bills and of UPI👍👍👍👍👍👍👍👍👍👍👍👍👍👍😍😍😍😍😍😍😍😍.....",
        "thumbs_up_count":1,
        "title":null,
        "id":38,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-12-01 15:46:49",
        "rating":2,
        "review_text":"Can you people just freaking remove auto filling otp feature! if you're not removing then atleast add another option where we can fill otp via keyboard. I was trying to connect my mom's BOB account which is logged in with my mom's phone number and that feature ruined our mood. I can't tell how much we were raged!",
        "thumbs_up_count":1,
        "title":null,
        "id":39,
        "theme":"Cluttered App Design",
        "sentiment":"Negative",
        "tag":"Input Issue"
    },
    {
        "date":"2025-11-25 07:22:15",
        "rating":1,
        "review_text":"Dear sir I have clicked the auto mandate subscription of Jio Hotstar by mistake, then I request you to turn it off. You do not have any option to cancel the subscription so pls once again I request you to pls cancel the auto mandate subscription",
        "thumbs_up_count":0,
        "title":null,
        "id":40,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-26 19:59:30",
        "rating":1,
        "review_text":"I want to tell all the PhonePe customers that it is no longer free on the phone, they charge Rs.1000 per payment and do not return the money for several months, they clearly charge Rs.1000 in all the PhonePe charges.",
        "thumbs_up_count":0,
        "title":null,
        "id":41,
        "theme":"Rewards and Fees",
        "sentiment":"Negative",
        "tag":"Unexpected Fees"
    },
    {
        "date":"2025-11-28 04:53:15",
        "rating":4,
        "review_text":"Although PhonePe payments get delayed sometimes, it is still the best — far better and way more elegant than any other app.",
        "thumbs_up_count":0,
        "title":null,
        "id":42,
        "theme":"App Bugs and Slowness",
        "sentiment":"Positive",
        "tag":"App Slowness"
    },
    {
        "date":"2025-11-28 06:09:37",
        "rating":2,
        "review_text":"nowadays my app is not working... whenever I try to make any payment...it's stuck in initiating a transaction.. kindly resolve my issue... my app is updated as well.",
        "thumbs_up_count":0,
        "title":null,
        "id":43,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"App Slowness"
    },
    {
        "date":"2025-11-28 11:33:27",
        "rating":4,
        "review_text":"The cashback feature is very nice. I was fed up with Gpays small games to win cashback and hence Came to Phonepe. But I always felt that phonepe didn't give any cashbacks. But that too has been fulfilled now. Hoping to see such features always on phonepe.",
        "thumbs_up_count":0,
        "title":null,
        "id":44,
        "theme":"Rewards and Fees",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-28 16:33:36",
        "rating":1,
        "review_text":"don't purchase any insurance policy from phonepe.. they are intensionally entered wrong data.. after we finding wrong data they are not rectified. phone pe and insurance companies both are intensionally entered wrong data.. this is big scam. don't purchase from phone pe",
        "thumbs_up_count":0,
        "title":null,
        "id":45,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 17:58:24",
        "rating":1,
        "review_text":"I have made a payment in my app it's showing debited from my bank but it's not showing on the receivers bank account from my account it's debited but the receiver didn't get the money",
        "thumbs_up_count":0,
        "title":null,
        "id":46,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Failed Transaction"
    },
    {
        "date":"2025-11-29 04:37:11",
        "rating":1,
        "review_text":"Worst App, Biometric Lock Doesn't Working on iQOO Mobiles. App Directly Opens and Doesn't Ask Biometric Fingerprint. Every Time I Have to Stop the App and Clear the Cache and Restart the Mobile to Workout the Biometric Lock.",
        "thumbs_up_count":0,
        "title":null,
        "id":47,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Security Glitch"
    },
    {
        "date":"2025-11-29 11:49:07",
        "rating":2,
        "review_text":"im not happy because it is not allowing me to take screenshots.. because sometimes I forgot my balance so I used to take screenshots whenever I get remember, but this new update is not allowing to take screenshots",
        "thumbs_up_count":0,
        "title":null,
        "id":48,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 12:49:15",
        "rating":1,
        "review_text":"The New UI seems overly complicated. thanks for ruining a perfect upi app. Update: They added a new bug; App crashes when trying to scan upi.",
        "thumbs_up_count":0,
        "title":null,
        "id":49,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"App Crash \/ Freeze"
    },
    {
        "date":"2025-11-30 11:01:05",
        "rating":2,
        "review_text":"pretty annoying most of the time can't display account details and the ammount amd transaction update even though the payment has been done already",
        "thumbs_up_count":0,
        "title":null,
        "id":50,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Balance Display Error"
    },
    {
        "date":"2025-11-30 18:08:52",
        "rating":1,
        "review_text":"App is full of glitches. Payments fail, server down most of the time. Very disappointing.",
        "thumbs_up_count":0,
        "title":null,
        "id":51,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Failed Transaction"
    },
    {
        "date":"2025-12-01 03:39:19",
        "rating":1,
        "review_text":"worst app i had ever seen . i want to delete my some of my transaction history or hide from my app but i am not able and also not able to contact customer care",
        "thumbs_up_count":0,
        "title":null,
        "id":52,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Product Feature Issue"
    },
    {
        "date":"2025-12-01 14:22:43",
        "rating":1,
        "review_text":"has lost its charm nowadays. even after updating my balance,it shows previous balance in check balance window. moreover when you share reciept,it keep s advertising it's own message",
        "thumbs_up_count":0,
        "title":null,
        "id":53,
        "theme":"App Bugs and Slowness",
        "sentiment":"Negative",
        "tag":"Balance Display Error"
    }
]