[
    {
        "date":"2025-10-14 08:33:16",
        "rating":5,
        "review_text":"Amazing! I recently came back from NY and I had to open a bank account. It was such a bad experience, other banks would take forever especially Indus bank is trash, their customer service is negligible, the app doesn't even work. And yesterday I tried this bank, didn't even had to go anywhere one of the few banks whose website or app works no lags or bugs. Opened my bank account in like 30 mins remote and even the kyc was done by evening ( 8 hrs max)",
        "thumbs_up_count":1599,
        "title":null,
        "id":1,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-08 12:41:14",
        "rating":5,
        "review_text":"Kotak Mahindra Bank's 811 app. User friendly. But many features are not yet available in this app, so there are many difficulties, such as checking credit score, some facilities are not yet available in this app. So we have to log in to our old app sometimes, log out and log in to the new app, we are facing a lot of problems. So the Kota team is requested to add these facilities to the Kotak 811 new app very soon.",
        "thumbs_up_count":696,
        "title":null,
        "id":2,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-10-05 15:42:25",
        "rating":4,
        "review_text":"Feedback\/Suggestions 1).This new 811 app doesn't show loan offers. the offers are shown on main page but as soon as you click on it nothing show in loans corner, they send you messages and emails about loan offers but in the app it disappears in loan offers corner 2). There's no option to add or pay through rupay credit card also",
        "thumbs_up_count":693,
        "title":null,
        "id":3,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-10-12 14:46:06",
        "rating":1,
        "review_text":"It's my very bad and worst experience with Kotak. There is no customer support for any type of complaint. My account has been blocked for 2 weeks then I visited the kotak branch and they advised me for a talktime recharge to contact customer care. But still it's very disappointing. This is also not helpful. I'm visiting a branch and they are refusing to help with this and also the Kotak app is not helping. I don't know what to do now. I'm very frustrated. It's very disappointing for a customer.",
        "thumbs_up_count":410,
        "title":null,
        "id":4,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Poor Resolution"
    },
    {
        "date":"2025-11-15 15:55:26",
        "rating":5,
        "review_text":"The Kotak 811 app is very easy to use and perfect for fast digital banking. Opening an account, sending money, paying bills, and using UPI all work smoothly without lag. The interface is clean, and features like the virtual debit card and quick KYC make the experience even better. Overall, it’s a reliable and convenient app for everyday banking.",
        "thumbs_up_count":395,
        "title":null,
        "id":5,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-10-19 08:33:07",
        "rating":5,
        "review_text":"biometric login very smooth. after any i make updates receiving notification immediately. and the app has great UI and nice UX. this new version app user-friendly now and very convenient. now everything is available in one place. all features like fund transfer and Bill payment and debit and credit card management .cheque and passbook. ATM card request and statement download and add payee and UPI payment management are much faster now. I'm really impressed with the new KOTAK Bank app.",
        "thumbs_up_count":282,
        "title":null,
        "id":6,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-01 01:25:40",
        "rating":5,
        "review_text":"Kotak 811 mobile app offers a smooth and convenient digital banking experience. Account opening is quick, and the interface is clean and user-friendly. Features like instant fund transfer, bill payments, and virtual debit card make daily banking easy. However, occasional glitches and slow load times can interrupt usage. Overall, it’s a reliable app for managing finances digitally with room for performance improvements.",
        "thumbs_up_count":269,
        "title":null,
        "id":7,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Slow Performance"
    },
    {
        "date":"2025-10-09 07:15:03",
        "rating":5,
        "review_text":"Simply amazing. Account opening is easy and fast. I have account with kotak811 for few years now, and never faced any issues with transaction, even the few I did face was solved quickly by support. Kotak811 is simply best banking app, no extra clutter, simple interface, all necessary services are available. UPI. Credit card and debit card settings with single click. Easy FD, RFD booking and mutual funds investments. Loan and Insurence. Everything. App is clean, easy, fast and reliable.",
        "thumbs_up_count":234,
        "title":null,
        "id":8,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-10-24 14:26:47",
        "rating":5,
        "review_text":"very good app. This type of app I really wanted for a long time for banking services. It makes banking services very easy to use for person like who hates complex traditional banking in which we have to visit bank branch for every small work. Thanks Thanks alot. 😊😊😊😊",
        "thumbs_up_count":233,
        "title":null,
        "id":9,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-08 14:30:15",
        "rating":1,
        "review_text":"Everything was correct KYC and all but the money for welcome kit was debited from my account but that was not received nor was its refund received then I did not take any plan, nothing, the money for insurance policy would have been debited Resolve my issue, what the hell is this, as soon as a big amount comes in the account, money gets deducted for some reason or the other, worst experience.",
        "thumbs_up_count":219,
        "title":null,
        "id":10,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-10-20 08:41:49",
        "rating":4,
        "review_text":"Hi is it possible in your next update to add a budgeting and expenses tracking feature it would help improve overall experience and make it a on stop solution for my financial needs and add a goal setting feature as well please do consider it. it will help reduce the need for other applications. please use the wallet app as a reference the feature are good, and I hope kotak can implement them in the next update.",
        "thumbs_up_count":216,
        "title":null,
        "id":11,
        "theme":"Missing Features & Design",
        "sentiment":"Positive",
        "tag":"Missing Features"
    },
    {
        "date":"2025-11-30 07:15:05",
        "rating":5,
        "review_text":"the most fastest way of transfering money. for daily uses under 20k. 1. highly efficient 2. they give cashback for real, not scratch'n \"betterluck next time\".😄 3. Minimal interface, not much integration there. 4. such a basic version, ease to quick move around. Still a good working model of beta version with good interface. The only thing i want you to update is the forget password area, where you ask mothers maiden name- which was an autogenated from what we enter in your format.",
        "thumbs_up_count":203,
        "title":null,
        "id":12,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-10-10 15:40:28",
        "rating":5,
        "review_text":"I am using it today on 10th October 25th. So far I am liking it. I have installed the new app and opened a new account. The account was opened today itself within about three hours. So far it's going well, don't know what's next I am writing this review later, so I want to say that after using it for some time, I realized that more work needs to be done on the UI of the app. It seems that the process is slow, please fix it.",
        "thumbs_up_count":184,
        "title":null,
        "id":13,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Slow Performance"
    },
    {
        "date":"2025-11-02 08:43:30",
        "rating":5,
        "review_text":"I’ve criticized the old Kotak 811 app before but the new one is a massive upgrade! The design looks modern, sleek and minimal exactly how a digital banking app should be in 2025. Everything feels clean, fast and easy to use. Checking balance, transfers and payments work super smoothly now. Big thumbs up to Kotak for this refresh. Finally a smart and user-friendly banking app!",
        "thumbs_up_count":168,
        "title":null,
        "id":14,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-10-13 08:11:40",
        "rating":4,
        "review_text":"⭐⭐⭐⭐☆ Very convenient app — my account and KYC process were completed easily. The interface is modern and light. Only feedback: customer care and update speed could be a little faster. Otherwise, great experience overall for digital banking.",
        "thumbs_up_count":164,
        "title":null,
        "id":15,
        "theme":"Poor Customer Support",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-11 05:44:28",
        "rating":5,
        "review_text":"I’ve been using the Kotak 811 account for almost 2 years now, and my experience has been excellent. The app is super smooth, clean, and user-friendly. There are no annoying ads at all, and I often get cashback offers on time. Every feature works perfectly — UPI payments, recharges, bill payments, and transfers are quick and hassle-free. The app is also very secure with proper OTP verification and instant alerts. Overall, Kotak 811 is one of the best banking apps out there — reliable, fast, and",
        "thumbs_up_count":158,
        "title":null,
        "id":16,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-10-23 16:39:00",
        "rating":5,
        "review_text":"First of all, I do not review any app on Google Play Store. This is Kotak Bank 811 app, which I am reviewing for the first time. It is a very good app.Its user interface and UI is very good, whether it is checking transactions or making payments, everything is very good, thank you Kotak Bank team",
        "thumbs_up_count":158,
        "title":null,
        "id":17,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-10-20 00:29:40",
        "rating":5,
        "review_text":"The Kotak Bank app is truly impressive — smooth, fast, and packed with smart features. The UI is simple yet elegant, making every transaction quick and hassle-free. It’s one of the best banking apps when it comes to reliability and user experience. No doubt, Kotak is among the best in digital banking. But still, the IDFC FIRST Bank app remains my number one for its unmatched performance and ease of use! 👏✨",
        "thumbs_up_count":128,
        "title":null,
        "id":18,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-10-29 15:10:57",
        "rating":4,
        "review_text":"One of the best banking apps, but it has some issues. 1) You should remove suggestions for you from the home tab, as it already has its own separate tab called \"Offers.\" 2) Remove the scan QR tab from the bottom menu section, as the app landing page already has a big pay button. Rather, make the circle a scan square logo. Minimalism is the key guys, and you people have almost nailed it. cheers",
        "thumbs_up_count":121,
        "title":null,
        "id":19,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Poor UX\/Navigation"
    },
    {
        "date":"2025-10-27 07:17:49",
        "rating":1,
        "review_text":"Very bad service! I had a dream different credit card. I wanted to increase my credit limit, so I booked an FD. But after booking the FD, I was unable to increase my credit limit because Kotak said there were some technical issues in their system and asked me to wait for a week. Now, even after one month, the same issue has not been resolved. Shame on you, Kotak Mahindra Bank",
        "thumbs_up_count":120,
        "title":null,
        "id":20,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Poor Resolution"
    },
    {
        "date":"2025-10-19 22:22:11",
        "rating":1,
        "review_text":"Dear Friends I have purchased the kotak iocl credit card past two months back. I have had an worst ever service from them. They have promised that every 150 rupees fuel spent you will get 24 rewards points and 1% surcharge waiver. They never given the both parameters on statement Each and every time we have to call customer service that my rewards points not added properly and also for surcharge waiver. Previous month bills I have paid including surcharge cost. After a month only they revised",
        "thumbs_up_count":99,
        "title":null,
        "id":21,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Service Failure"
    },
    {
        "date":"2025-11-11 12:33:36",
        "rating":5,
        "review_text":"wow! kotak banking services are amazing. 811 super is just amazing! Their services and support are neat and clean. Customer support is extraordinary and friendly, just easy and superb... I'm happy to be one of their customer, Congratulations team👏",
        "thumbs_up_count":96,
        "title":null,
        "id":22,
        "theme":"Poor Customer Support",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-17 15:47:45",
        "rating":4,
        "review_text":"Have been using the app since around 5 months. The biometric option in the app disables by itself every other day. I have to enable it in the app again and again. It is is a bug then please fix it.",
        "thumbs_up_count":79,
        "title":null,
        "id":23,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-20 13:00:06",
        "rating":5,
        "review_text":"Pleasant UI with straight to the point features. Ever improves &\/ debugs with time & need. Acts quick straightening up all* the banking problems, on & off. *n.b : Still collapses, though less often unlike before, to the homepage in the midst of doing any feature\/ business compelling to repetitive unlock.",
        "thumbs_up_count":71,
        "title":null,
        "id":24,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"App Crash\/Freeze"
    },
    {
        "date":"2025-10-09 11:15:32",
        "rating":3,
        "review_text":"all good in the app but there is only one way to reach customer care and that is to call them which is also chargeable & also the query doesn't solved in a single call. so if anyone have any grievance they first have to spend money to call them again & again.this must be address to make the process more efficient.",
        "thumbs_up_count":66,
        "title":null,
        "id":25,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Chargeable Calls"
    },
    {
        "date":"2025-11-11 05:51:56",
        "rating":1,
        "review_text":"The credit card department is too bad, unable to reach them. they are taking too much advantage for chargeable calls. in fact I was taken loan,and perfectly paid all Emi dues. later I requested a noc, or no due letter but they didn't respond well and no proper guide lines.only GST++++ after my loan I am trying to swipe amount card wes expired, and I didn't request new card, they are sended directly to my address for that new bill raised, getting ph.calls this absolutely looting don't.",
        "thumbs_up_count":64,
        "title":null,
        "id":26,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Unreachable Support"
    },
    {
        "date":"2025-10-31 05:33:20",
        "rating":1,
        "review_text":"It is not user friendly so there are many mess\/clumsy in the app we need to search every time for an different option. The app should be different USer friendly so that any knowledge less person also should be able to use. previous version was good and easy navigation. This is not a website to make over clumsy specially this is a banking app it should be clear and concise. As myself educated I feel difficult to use and it is making more time to spend on it feels like close the account by seeing.",
        "thumbs_up_count":62,
        "title":null,
        "id":27,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Poor UX\/Navigation"
    },
    {
        "date":"2025-11-09 09:19:37",
        "rating":1,
        "review_text":"Very disappointed with Kotak Bank’s service.An insurance amount was deducted from my account without my consent or application. Also, AtalPension Yojana deductions are happening without any authorization.I’ve been trying to reach customer support for days via calls and emails, but the issue is still unresolved. Every time I contact them, they give a different number, and each one redirects me elsewhere.This is highly frustrating and unprofessional.Please resolve this and refund the deducted amt",
        "thumbs_up_count":61,
        "title":null,
        "id":28,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-11-10 13:58:54",
        "rating":2,
        "review_text":"good but suppose you don't have the enough money but you scanned the QR code and entered the amount and call somebody to send the money they sent and it was credited in your account but you cannot transfer you have to close it from the resent app and again have to start the app & then you will be able to do the transaction...",
        "thumbs_up_count":61,
        "title":null,
        "id":29,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Broken Feature"
    },
    {
        "date":"2025-11-04 17:52:02",
        "rating":3,
        "review_text":"exceptional app with very weird bill payment reward structure. it's a very smooth and almost bug free app with very convenient features which very few banks offer BUT in the bill payment section under credit cards you can find almost all issuers but not kotak itself and if you pay bill via the app's credit card section you won't be rewarded the cashback. so I would suggest that if you are rewarding for other credit card bill payments then please implement same for your own credit card.",
        "thumbs_up_count":60,
        "title":null,
        "id":30,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-09 11:27:27",
        "rating":5,
        "review_text":"I am happy that my complaint was heard and action was taken and my refund was also returned. Thank you Team Kotak. You have always heard and acted upon my requests. Thank you so much. ⭐⭐⭐⭐⭐ I am not saying this because of my refund, I have got solution to all my problems and I am not facing any problem till now.",
        "thumbs_up_count":53,
        "title":null,
        "id":31,
        "theme":"Poor Customer Support",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-09 14:01:28",
        "rating":1,
        "review_text":"god they lie when they want you to open an account, they told me i would get an amazon voucher worth 1250\/- if i made 25k transaction as first which i didn't get yet and they said with super account we get instant customer support i keep asking them for a call back app says failed, error, blah blah blah guy who came for kyc said it was mandatory to buy accidental insurance worth 1499 which really wasn't the case and now i didn't get a amazon voucher, customer support plus my 1499 got debited",
        "thumbs_up_count":52,
        "title":null,
        "id":32,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Misleading Policies\/Terms"
    },
    {
        "date":"2025-11-11 13:03:37",
        "rating":1,
        "review_text":"Request a call tab is not working in the Kotak 811 app. Message pops up as Call request failed, try after some time. Call waiting time on toll free number is too much. The app freezes suddenly while using. Overall not happy.",
        "thumbs_up_count":51,
        "title":null,
        "id":33,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"App Crash\/Freeze"
    },
    {
        "date":"2025-11-02 02:21:18",
        "rating":4,
        "review_text":"The app is much smoother compared to other banking applications. However, I still rely on PhonePe for about 80% of my small daily UPI Lite transactions. Once UPI Lite is introduced, I’ll be able to switch completely to your app for everyday payments. Other banking apps like Axis Bank and ICICI iMobile Pay have already integrated UPI Lite.",
        "thumbs_up_count":47,
        "title":null,
        "id":34,
        "theme":"Missing Features & Design",
        "sentiment":"Positive",
        "tag":"Missing Features"
    },
    {
        "date":"2025-11-07 14:33:13",
        "rating":3,
        "review_text":"I am not able to pay any bill from this app using credit card number. when I trying to pay bill it is only showing savings account number . But in old app I am able to use credit card to pay bill. I am not getting any error but I can't use credit card to pay bill, there is only savings bank account number option to pay any bill like electricity or gas or mobile recharge.",
        "thumbs_up_count":46,
        "title":null,
        "id":35,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-10-18 20:49:53",
        "rating":2,
        "review_text":"This New App is worst I have ever seen. When I transfer more than 5L it says it can only transfer upto 5L, no option of changing transaction type to RTGS or neither it does change automatically. Also I can't use this app with login in another phone, it asks for only sms and SIM to be present how pathetic. What about a person using mobile and tab how can he have 2 Sim with same number? We should be able to login with our credentials, this seems like account jailed.",
        "thumbs_up_count":45,
        "title":null,
        "id":36,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-31 17:59:15",
        "rating":1,
        "review_text":"when I am trying to upgrade to kotak 811 super it is telling that it will auto debit 399 as charges but in terms they said nil charges. Also recently I paid 2000 credit Card bill but didn't get cashback as per terms and conditions. No option to raise issue for the same. No live chat options. again I paid 2k bill no cashback for the same.",
        "thumbs_up_count":42,
        "title":null,
        "id":37,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-10-08 04:00:25",
        "rating":3,
        "review_text":"Overall this is good app but I'm disappointed with Kotak customer care service. Recently I activated my Kotak super account and deposited 10,000 rs. I'm unable to log into kotak811 app because there is written you are blocked from this app and contact our customer service. I have only my CRN no. and account no. I have no debit or credit card. How I talk to customer executive?🤔",
        "thumbs_up_count":37,
        "title":null,
        "id":38,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-17 14:23:11",
        "rating":1,
        "review_text":"Everyday the same issue is happening of request expired. I type mg MPIN for login but it does not open it . The assistance provided by them also not have proper solution to it. Please do the needful for the app. I am always getting as Request Expired. I am fedup of it literally. Kotak members if your seeing this comment, please check the status of app what is actually happening. The doesn't not open only. please take a careful and urgent look towards it. ASAP",
        "thumbs_up_count":37,
        "title":null,
        "id":39,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-10-16 06:12:07",
        "rating":5,
        "review_text":"One of the best banking app.... Everything in there is fantastic. fast, reliable, secure and smooth experience in daily use.",
        "thumbs_up_count":36,
        "title":null,
        "id":40,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-19 10:02:16",
        "rating":2,
        "review_text":"It was not a good experience. The agent didn't even tell me about the bank policy, that you need to show some kind of insurance policy cover in order to obtain a passbook. ₹999 were deducted from my account for no reason. Is it true that you must show a cover to get a passbook???",
        "thumbs_up_count":36,
        "title":null,
        "id":41,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-11-05 12:34:23",
        "rating":1,
        "review_text":"Kotak 811 is the most deceptive bank I have used. They will say zero balance but they will keep the money. They will not provide us with any help, and even if they do, there will be no proper response or approach. This is my experience. Please think carefully before opening an account with this bank.Don't worry about why you opened an account at this bank like I did.I am sharing my experience with you. Thank you very much, friends.",
        "thumbs_up_count":35,
        "title":null,
        "id":42,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Misleading Policies\/Terms"
    },
    {
        "date":"2025-11-25 01:24:29",
        "rating":4,
        "review_text":"Edit: Thanks for the promt reply on my previous issue here! (18-3-25) Now, I face a big issue. I can't conform the e-commerce changes under control card controls in the new kotak811 app. Namely, I need to activate domestic ecomm facility on my debit card. Need Immediate help. I had mailed u once. but did not get any response there..",
        "thumbs_up_count":35,
        "title":null,
        "id":43,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Missing Features"
    },
    {
        "date":"2025-11-04 12:17:49",
        "rating":1,
        "review_text":"It’s embarrassing when you try to pay someone and your app keeps showing “request timeout.” It’s happened to me multiple times — and it’s frustrating beyond words. In today’s digital era, a bank app should make life easier, not create stress.It’s not a one-time issue. This has been happening again and again. Imagine you’re standing at a shop, ready to pay, or you need to send money urgently to someone — and suddenly the app freezes or crashes. The screen just keeps loading endlessly.",
        "thumbs_up_count":34,
        "title":null,
        "id":44,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"App Crash\/Freeze"
    },
    {
        "date":"2025-11-08 18:50:08",
        "rating":1,
        "review_text":"%NOT RECOMMENDED% Such a bad bank service I have ever used. Kotak will any time block your account without giving prior notice. I have used 6+ zero balance account in other bank but never faced this kind of unethical blocking PROBLEM. And there is no customer email ID from bank to raise a written issue against the blocking.",
        "thumbs_up_count":33,
        "title":null,
        "id":45,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Account Blocked\/Frozen"
    },
    {
        "date":"2025-10-08 08:53:30",
        "rating":1,
        "review_text":"When I first applied several years ago for a Zero balance account, it was opened but slyly they changed it to a minimum balance account of 10K.. I stopped using it and they automatically changed it to zero balance savings account again.. Now I reactivated the account.. The KYC lady also said it's Zero balance account.. All of a sudden they changed it again.. GUYS BEWARE... IT'S A FRAUDULENT BANK WITH FRAUD ACTIVITIES LIKE THIS.",
        "thumbs_up_count":30,
        "title":null,
        "id":46,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Misleading Policies\/Terms"
    },
    {
        "date":"2025-11-27 12:38:26",
        "rating":1,
        "review_text":"I applied for an FD-backed credit card after a call from the Kotak team. My application shows “Received” in the Kotak 811 app, but customer care says they can’t see it in their system. For 3 days they promised callbacks but none came. This has been very disappointing. Kindly resolve my issue urgently, as this experience has changed my view of Kotak’s service.",
        "thumbs_up_count":28,
        "title":null,
        "id":47,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Poor Resolution"
    },
    {
        "date":"2025-10-14 11:55:24",
        "rating":1,
        "review_text":"i switched to new mobile now the app is not opening. it showing toast message as remote desktop app is detected. I don't know which app it's detected as remote app. need a proper toast message to identify that app and uninstall it. mobile device is realme gt 7 it's urgent plz fix issue",
        "thumbs_up_count":26,
        "title":null,
        "id":48,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-10-25 04:26:49",
        "rating":1,
        "review_text":"I invited my sister didn't get my refer and earn money, contact to support is almost impossible, only way is there site which is even more hard to login also app doesn't open half the time. Edit: they said drop a mail, but where? and fix your app not opening for 2 days saying request time out each time I put password. realme 6 mobile vi sim.",
        "thumbs_up_count":26,
        "title":null,
        "id":49,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-10-24 10:14:29",
        "rating":1,
        "review_text":"it's the worst bank app.Nobody should use it especially for transferring money. your hard earned money would get lost. Nobody in the bank would help at all despite so many mails. It's a FRAUDULENT app. after so many emails, no resolution was provided at all!!!!",
        "thumbs_up_count":25,
        "title":null,
        "id":50,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Service Failure"
    },
    {
        "date":"2025-11-29 03:30:07",
        "rating":1,
        "review_text":"1- No option available to set custom UPI 2- Its treating this kotak App UPi differently and the old UPI id differently and due to this we are not getting cashback. 3- UPI id name must be UPI Pay. or pay through UPI. or leave as only \"UPI\" 4- Kotak bank recently asked user to submit 2K and 10K payment to upgrade their account when I refer this bank to my friend due to this useless rule people avoiding to join this app. control your greed. due to this amount you are lossing permanent customer.",
        "thumbs_up_count":25,
        "title":null,
        "id":51,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-11-05 18:51:30",
        "rating":5,
        "review_text":"Good app and easy,user friendly interface also quick response from the customer support team.",
        "thumbs_up_count":24,
        "title":null,
        "id":52,
        "theme":"Poor Customer Support",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-11 14:44:56",
        "rating":1,
        "review_text":"Worst service. The old kotak811 app was better. when I'm requesting for a service it's not responding at all. it's showing \"we're drawing a blank\" while doing any service request. anything is not working in this app. so frustrating 😫",
        "thumbs_up_count":22,
        "title":null,
        "id":53,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Broken Feature"
    },
    {
        "date":"2025-11-13 14:51:15",
        "rating":3,
        "review_text":"In the app ,scanning system doesn't work,I cannot scan any QR code ,it shows a black screen whenever I try to make the payment,as I updated it and reinstall too but the problem remains the same ,plz provide me the solution for it.",
        "thumbs_up_count":21,
        "title":null,
        "id":54,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Broken Feature"
    },
    {
        "date":"2025-10-11 17:22:15",
        "rating":3,
        "review_text":"there is a problem I found, if developer found this comment useful try to solve. other wise we have may other options to switch. 1. there is no option to download Bank statement in excel or CVC format. 2. during UPI payment not able to insert naration of that particular transaction. 3. customize landing page of this app for better convenience and user friendly like different banking facilities. thank you 👍🏻👍🏻👍🏻 ♥️♥️♥️♥️♥️ Vande Bharat Janani🇮🇳🇮🇳🇮🇳",
        "thumbs_up_count":20,
        "title":null,
        "id":55,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Missing Features"
    },
    {
        "date":"2025-11-06 10:17:36",
        "rating":3,
        "review_text":"It's overall a good app to meet almost every requirement but i want to suggest that it needs a pay again or send money again feature to in transaction history so i can send money again to someone whom i had sent money yesterday or maybe a week before without requiring his bank, upi or phone number details. hopefully you will add the feature soon and reply to my rating",
        "thumbs_up_count":20,
        "title":null,
        "id":56,
        "theme":"Missing Features & Design",
        "sentiment":"Positive",
        "tag":"Missing Features"
    },
    {
        "date":"2025-11-03 05:10:14",
        "rating":1,
        "review_text":"The app cannot even confirm automatically that the sim number is the mobile number registered with the bank so it says open an account. Then when I provide all details like mobile number and email and pin code then it says you already have an account. I am getting mad since two days",
        "thumbs_up_count":19,
        "title":null,
        "id":57,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-10-17 18:42:52",
        "rating":1,
        "review_text":"always error happening... this is not a friendly application..if make a emergency transaction we can't do nothing...24\/7 whatsapp customer care sleeping...i tried to uninstall application after reinstall then login menu selections after some cartoon searching the camer we are blank... this is worst experience I am a new...",
        "thumbs_up_count":17,
        "title":null,
        "id":58,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"App Crash\/Freeze"
    },
    {
        "date":"2025-11-05 03:00:04",
        "rating":1,
        "review_text":"This app still needs to be refined well. it stucks and doesn't go back in some things like confirmations\/updations etc. once it confirms or cancels..a pop up comes as it is done and doesn't go back. many more issues like my assets and liabilities are not visible as easy as old kotak app.",
        "thumbs_up_count":17,
        "title":null,
        "id":59,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Broken Feature"
    },
    {
        "date":"2025-10-09 03:22:04",
        "rating":5,
        "review_text":"best online account opening app so far haven't faced any problem. app interface is good. after so much research finally I think I found the right app for the right bank.",
        "thumbs_up_count":15,
        "title":null,
        "id":60,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-30 02:11:46",
        "rating":1,
        "review_text":"Two things. Firstly, the product managers, ui-ux team and app developers, do you guys talk to each other? Secondly, coming from an AI Engineer, what is wrong with your chatbot? Unable to answer even the simplest of questions. Really unhelpful. Thought the new app is better than the previous, but it's the same.",
        "thumbs_up_count":15,
        "title":null,
        "id":61,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Digital\/App Issues"
    },
    {
        "date":"2025-11-04 08:22:06",
        "rating":5,
        "review_text":"It is very good and its speciality is zero balance charge, there is no charge. It can be started easily and is very helpful.",
        "thumbs_up_count":15,
        "title":null,
        "id":62,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-09 23:29:01",
        "rating":2,
        "review_text":"This app takes too much time to load many times while starting up. we need to force close the app and open the app again and again and then also it does not load. Rest is all good on the app. As they are showing as that \"Makhaan jaisa smooth banking\" that does not match.",
        "thumbs_up_count":15,
        "title":null,
        "id":63,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Slow Performance"
    },
    {
        "date":"2025-10-10 08:05:35",
        "rating":1,
        "review_text":"time to time your demand was increase. when first time I open a kotak acc there was not required any amount after some month the required 1000 rupees, currently I open the one customer photo account required only 1000 rupees and now I am opening account the required 2000 rupees, service is so worst but demand is so high ☹️",
        "thumbs_up_count":14,
        "title":null,
        "id":64,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Misleading Policies\/Terms"
    },
    {
        "date":"2025-11-03 16:44:34",
        "rating":1,
        "review_text":"The latest version of the Kotak 811 app is disappointing as the promised Credit Limit Increase and Card Upgrade options are missing! The update notes clearly mention these features, but they’re nowhere to be found in the app. Please fix this issue or clarify where to access them. Users expect transparency and functional updates, not broken promises.",
        "thumbs_up_count":14,
        "title":null,
        "id":65,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Missing Features"
    },
    {
        "date":"2025-10-30 16:14:10",
        "rating":1,
        "review_text":"third class bank I ever used in my life Money gets deducted for no reason right from the start when opening an account; the service is not good There is no guarantee for the money; once it's deducted, you have to chase the bank a lo It takes a long time to return the money and the service is bad.",
        "thumbs_up_count":13,
        "title":null,
        "id":66,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-11-05 00:10:05",
        "rating":3,
        "review_text":"i really like kotak 811 bank & it's App , but I ALSO HATE TWO REEAALLY ANNOYING LACKING FEATURES :- ¹ i can't change-keep my phone's time according to my personal needs for my mindset,, otherwise IF I DO, IT LOGS ME OUT OF APP ! 🙏🏻 PLEASE fix it ASAP 🙏🏻 ² kotak bank offers VERY LESS OFFERS in popular Ecom sites like (flipkart Amazon Myntra, Tata 1mg, swiggy, bookmyshow, etc) compared to even smaller banks like AU, BOB, IDFC , even Govt SBI gives card discount in every place, EVERY SALE !!",
        "thumbs_up_count":13,
        "title":null,
        "id":67,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Broken Feature"
    },
    {
        "date":"2025-11-11 04:59:40",
        "rating":1,
        "review_text":"worst app my account was working from last 2 months but suddenly I recieved a message from the bank that your account has been freezed. I visited the bank contacted customer care still no reply from either side. My money is stucked and there is no communication from the bank side no mail no call. please help",
        "thumbs_up_count":13,
        "title":null,
        "id":68,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Account Blocked\/Frozen"
    },
    {
        "date":"2025-11-16 15:16:16",
        "rating":4,
        "review_text":"Request the developers to please improve the design and looks of the payment screenshots that are shared on WhatsApp etc. they look very basic and are no better than simple text message. The screenshots generated by the other\/old Kotak App were better and look more elegant. Please please please work on this.",
        "thumbs_up_count":12,
        "title":null,
        "id":69,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Design\/Aesthetics"
    },
    {
        "date":"2025-10-14 13:36:47",
        "rating":4,
        "review_text":"the colour was way great before it catching to eyes visible and was pleasant for the action button but blue is not applicable It looks a little less than before and provides colour it's great like app colour",
        "thumbs_up_count":11,
        "title":null,
        "id":70,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Design\/Aesthetics"
    },
    {
        "date":"2025-11-03 06:01:56",
        "rating":1,
        "review_text":"account profile differ and they blocked my account for that reason without giving me any notification or call or mail. they directly block, customer support is not helping how they can be so rude knowing that someone money is there, Please think 100 times before opening account there beacuse while opening they talk sweet afterwards they became evil",
        "thumbs_up_count":11,
        "title":null,
        "id":71,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Account Blocked\/Frozen"
    },
    {
        "date":"2025-11-13 15:52:50",
        "rating":1,
        "review_text":"absolute pathetic app. Everytime i enter my mpin there is always same issue of request expired. Iam highly frustrated that even after repeated feedback the issue is still not resolved. Atleast allow me to login to kotak old banking app.",
        "thumbs_up_count":11,
        "title":null,
        "id":72,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-26 01:15:34",
        "rating":1,
        "review_text":"I am very disappointed, the app is not even open, before some days I have to clear the storage of the app regularly to use it, but now I have to uninstall the app and then reinstall it to use it. Very bad experience. I am frustrated.",
        "thumbs_up_count":11,
        "title":null,
        "id":73,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"App Crash\/Freeze"
    },
    {
        "date":"2025-11-27 14:18:07",
        "rating":1,
        "review_text":"Worst experience, I tried to open an account in online, then agent called and came to home and opened the account. while opening he told 2000 rs will cut and then cash back will come for evermonth. later I realised that he fooled me by activating an accidental insurance without asking me. this the worst banking experience I felt in Kotak. I need my money return and cancel the insurance. I don't want to use this account.",
        "thumbs_up_count":11,
        "title":null,
        "id":74,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Misleading Policies\/Terms"
    },
    {
        "date":"2025-10-30 15:22:53",
        "rating":1,
        "review_text":"They limit on your spends, I can't spend anymore from my account because they have a daily limit spend for day 1. Pathetic unnecessary feature I had to get to an atm to pay the amount.",
        "thumbs_up_count":10,
        "title":null,
        "id":75,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Missing Features"
    },
    {
        "date":"2025-11-26 11:45:44",
        "rating":1,
        "review_text":"worst app,I have created account yesterday after depositing 10000 rupees my account is debited with 399 rupees for debit card charges,but I didn't applied for debit card, they are not responding for mails,if I request call from kotak 811 app it is saying that call request failed.",
        "thumbs_up_count":10,
        "title":null,
        "id":76,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-11-30 11:59:09",
        "rating":1,
        "review_text":"It has been almost a month. Still the KYC is not completed. I am unable to transfer the initial amount. My money is stuck. Very poor service by customer support online as well as branch. Even the person in the branch is telling that after the KYC your account will be blocked any time without any reason of you open 811. Do not open the account with Kotak. I want my money back.",
        "thumbs_up_count":10,
        "title":null,
        "id":77,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Service Failure"
    },
    {
        "date":"2025-10-13 00:34:01",
        "rating":1,
        "review_text":"Old is gold new app is very useless.Milestone is not showing in the new app. My last year's reward is pending. I spent Rs 100,000 on my credit card last year, where is my reward?",
        "thumbs_up_count":9,
        "title":null,
        "id":78,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-11-07 08:10:05",
        "rating":5,
        "review_text":"I really i liked the app and if filled the form and open the account by offline kyc i been using this account activily and i have no issue so far so yes you can go for it",
        "thumbs_up_count":9,
        "title":null,
        "id":79,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-09 11:24:58",
        "rating":1,
        "review_text":"connecting to customer care for bank and credit card is such a mountain in kotak. just unimaginable. other are so accessible but kotak its impossible challenge. in emergency its never there for customer",
        "thumbs_up_count":9,
        "title":null,
        "id":80,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Unreachable Support"
    },
    {
        "date":"2025-10-09 07:12:44",
        "rating":4,
        "review_text":"overall looks of the App need to be changed or modified.. visual should be changed and there should be quick access of balance view(with hidden option) without login into app. Rest of the app is good in working.",
        "thumbs_up_count":8,
        "title":null,
        "id":81,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Design\/Aesthetics"
    },
    {
        "date":"2025-11-07 10:52:30",
        "rating":4,
        "review_text":"Thank you for the resolution The application is now running smoothly, I was facing an issue opening the application showing an expired session, but Kotak reviewed my problem after a few days they fixed it Thank you very much and I appreciate it to look at my problem 🙂",
        "thumbs_up_count":8,
        "title":null,
        "id":82,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-11 05:31:51",
        "rating":2,
        "review_text":"The earlier Kotak app was much better and had a lot of features. this app has very less functions at the end you have go the older app only every time. like converting you cc transaction to Emi etc.",
        "thumbs_up_count":8,
        "title":null,
        "id":83,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-11-12 19:25:51",
        "rating":1,
        "review_text":"app is not opening says device is rooted.. whereas my phone is not rooted and in on company' original stock version.. I have tried uninstalling and reinstalling app still no luck.. can some one get in touch me and get this issue resolved",
        "thumbs_up_count":8,
        "title":null,
        "id":84,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-14 09:34:07",
        "rating":1,
        "review_text":"Can't Login in the app. It shows error that device is rooted and auto close app after 1sec. My device is not rooted and it is showing certified in google play store. I am using Motorola Edge 20 pro.",
        "thumbs_up_count":8,
        "title":null,
        "id":85,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-16 08:50:27",
        "rating":3,
        "review_text":"There is no option to create a custom UPI handle. The old app has the option and I used it to pay without exposing my phone number to others. I have uninstalled it and will install it again after custom UPI ID option is added.",
        "thumbs_up_count":8,
        "title":null,
        "id":86,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-11-16 11:10:57",
        "rating":1,
        "review_text":"I have a kotak super account since last 3 months and it was working fine till last month. this month I already deposited 40k but still it is asking me to add another 10k to activate cashback and for this months pos transactions, i didn't get cash points. is this your service? and also, suddenly you double the every month installment, previously it was 5k, not enough for you?",
        "thumbs_up_count":8,
        "title":null,
        "id":87,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Misleading Policies\/Terms"
    },
    {
        "date":"2025-11-19 11:50:51",
        "rating":2,
        "review_text":"The customer service experience was very bad because I blocked my account to prevent online money fraud after that I went to my bank branch but they said it will unblock via customer care on call and there is not any option regarding unblock.",
        "thumbs_up_count":8,
        "title":null,
        "id":88,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Unreachable Support"
    },
    {
        "date":"2025-10-08 20:34:42",
        "rating":2,
        "review_text":"unable to login new kotak bank 811 mobile app And often service crashed of this new 811 app please improve All over services and I am new holder of kotak Mahindra Bank today but first day I faced unable to login problem..can you please share kotak mahindra balance inquiry number . perhaps i check my balance.",
        "thumbs_up_count":7,
        "title":null,
        "id":89,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-23 16:20:11",
        "rating":4,
        "review_text":"This new 811 app is better than older one in most of the features. The only reason I'm I'm giving it 4 stars because Old 811 app provides CUSTOM UPI ID which the new one doesn't provide that's why I'm hesitant to shift to this new one.",
        "thumbs_up_count":7,
        "title":null,
        "id":90,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-11-26 13:58:29",
        "rating":5,
        "review_text":"Switching to Kotak 811 app was an excellent experience. 👌 The interface is smooth and intuitive, and banking is very easy now — from UPI payments to bill-payments and checking balances.",
        "thumbs_up_count":7,
        "title":null,
        "id":91,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-10-09 09:43:48",
        "rating":5,
        "review_text":"i am happy with the bank services.i was encountered with an unexpected error in my app.thanks to the support team . i came out with the help of their continuous effort. Thank you team",
        "thumbs_up_count":6,
        "title":null,
        "id":92,
        "theme":"Poor Customer Support",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-11 07:55:14",
        "rating":1,
        "review_text":"The app closes again and again, I am unable to login and starts working after a day. I have faced this many times.",
        "thumbs_up_count":6,
        "title":null,
        "id":93,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"App Crash\/Freeze"
    },
    {
        "date":"2025-10-23 09:06:42",
        "rating":3,
        "review_text":"Best Digital Banking App but I have some suggestions for this app to enhance Customer experience like other digital banking apps provided (Jupiter or Fi by Federal Bank) that provides us Digital Copy of Front Page of Passbook in pdf and Digital Copy of Cheque. It can be used in many places like proof of Account Holder.",
        "thumbs_up_count":6,
        "title":null,
        "id":94,
        "theme":"Missing Features & Design",
        "sentiment":"Positive",
        "tag":"Missing Features"
    },
    {
        "date":"2025-10-31 05:22:58",
        "rating":1,
        "review_text":"i recently installed from playstore. since installed it was not opening. very worst app not a user friendly. i request to you kindly develop the app and clear the issue.",
        "thumbs_up_count":6,
        "title":null,
        "id":95,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-04 10:10:29",
        "rating":1,
        "review_text":"this app is not opening or authenticating with a mobile network of medium strength.however, gpay and other apps are working fine. for this I need a wifi to use the UPI service from this app. Fix this issue.",
        "thumbs_up_count":6,
        "title":null,
        "id":96,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Slow Performance"
    },
    {
        "date":"2025-11-12 19:50:39",
        "rating":1,
        "review_text":"Extremely disappointed with Kotak Bank. During my video KYC, I clearly said I didn’t want a physical debit card, yet ₹399 was debited against my consent. The refund process is a nightmare — chatbot loops, language barriers, and unhelpful support. It’s been a week with no refund or update. As a student, losing ₹399 due to their mistake feels unfair and disheartening. Completely lost trust in Kotak Bank.",
        "thumbs_up_count":6,
        "title":null,
        "id":97,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-11-14 08:47:41",
        "rating":1,
        "review_text":"I'm unable to use the scanner...there's only a blank screen everytime I try to open it...(even tho other camera featured apps work fine) Totally disappointed",
        "thumbs_up_count":6,
        "title":null,
        "id":98,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Broken Feature"
    },
    {
        "date":"2025-11-14 12:05:31",
        "rating":5,
        "review_text":"very modern UI. Seamless transaction. lagfree experience. my question is why you assign a completely different vpa address for this particular app? I was using old Kotak app since 2017 with @kotak vpa address now suddenly after installing this app is saw here you set another vpa address for this particular app. now I have two vpa address one from old Kotak app and another from this app. Anyway love the app.",
        "thumbs_up_count":6,
        "title":null,
        "id":99,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-15 05:45:14",
        "rating":5,
        "review_text":"Great app! The Kotak 811 interface is clean, easy to use, and makes banking really convenient. Smooth experience overall.",
        "thumbs_up_count":6,
        "title":null,
        "id":100,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-26 02:48:12",
        "rating":5,
        "review_text":"Best bank for everyone. I really like Kotak Bank because every branch feels like my home branch 😊. I feel happy whenever I visit — the staff are always kind, helpful, and treat me like a friend ☺️. I also want to add that Kotak Bank is the best bank in India.",
        "thumbs_up_count":6,
        "title":null,
        "id":101,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-05 04:48:33",
        "rating":5,
        "review_text":"Kotak Bank Prviding Wonderful facility to customer for every thing like transaction n all, It seems a good bank to Initiating towards Growth of and a sign of Helping hands to each other... Thanku Kotak bank",
        "thumbs_up_count":5,
        "title":null,
        "id":102,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-10 14:31:26",
        "rating":1,
        "review_text":"they Block my bank account for 5 day. within that period my salary credited but I'm not got. Because my account credit and debit freeze. and I can't use my hard earned money. I'm helpless. don't open bank account",
        "thumbs_up_count":5,
        "title":null,
        "id":103,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Account Blocked\/Frozen"
    },
    {
        "date":"2025-11-14 08:46:55",
        "rating":1,
        "review_text":"The older version app was easy to use. Its interface and usage are very difficult. Please bring back the old app.",
        "thumbs_up_count":5,
        "title":null,
        "id":104,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Poor UX\/Navigation"
    },
    {
        "date":"2025-11-16 12:32:54",
        "rating":1,
        "review_text":"worst bank I have seen ever when I was completing KYC then assistant had told me you will have to pay 799 per anum and I said him is there any more options to less debit card charge there was a cheap charge debit card available but he didn't even told me and first day bank had been cut 799 actually bank is thief 😡😡😡",
        "thumbs_up_count":5,
        "title":null,
        "id":105,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Misleading Policies\/Terms"
    },
    {
        "date":"2025-11-19 13:05:08",
        "rating":5,
        "review_text":"Please add a contactless payment method!, Also there is no option to see the history of the transaction of the particular upi id or number.",
        "thumbs_up_count":5,
        "title":null,
        "id":106,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-11-25 16:56:39",
        "rating":1,
        "review_text":"worst. when u r need of making digital payment .The app..says something went wrong ..but the amount gets deducted. also..the app crashes frequently. Something went wrong ..should be your tagline...I wish I could take all screenshots n share with you ..sad ..no screenshots is possible",
        "thumbs_up_count":5,
        "title":null,
        "id":107,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"App Crash\/Freeze"
    },
    {
        "date":"2025-10-15 01:49:51",
        "rating":1,
        "review_text":"This is the worst online banking app i have used till date, this is not trust worthy. This bank has worst coustomer service as well... I get notified before getting fraud however i was not able to look into that email or receive call from kotak service at the moment but as kotak has already noticed the fraud then how can you let the fraud happen even if you were confused between real and fraud you should have stop that transaction at the moment because you were doubt full...",
        "thumbs_up_count":4,
        "title":null,
        "id":108,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Service Failure"
    },
    {
        "date":"2025-10-31 09:23:05",
        "rating":1,
        "review_text":"My account got blocked and I tried to connect the customer care but in ivrs asked for customer id or account number. when my account got blocked how can I share such numbers to to ivrs.",
        "thumbs_up_count":4,
        "title":null,
        "id":109,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Unreachable Support"
    },
    {
        "date":"2025-11-03 15:24:00",
        "rating":1,
        "review_text":"worst bank I have ever used. they deducted 588rs from my account and when I tried to raise a dispute they aren't showing the transaction at dispute section i was just exploring the app then I saw a pvr debit card i thought what it is and then they ask a confirmation i thought it is a free card after confirming that they have been deducted the 588 without even entering the upi pin or mpin this is an fraud bank don't open the account in this bank please you will regret",
        "thumbs_up_count":4,
        "title":null,
        "id":110,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-11-06 06:54:32",
        "rating":2,
        "review_text":"i apply to port my sim card after that the sim is renew , app data is logged out after that , i try most of the time.. the crn & no. of otp is not showing & i literally failed to opn my id on these app in full network.. i don't know what was the actually problem",
        "thumbs_up_count":4,
        "title":null,
        "id":111,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-10 07:34:34",
        "rating":1,
        "review_text":"unable to contact customer care for my issue. any poor chat support. transaction issue but no use of appliction and banking services.",
        "thumbs_up_count":4,
        "title":null,
        "id":112,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Unreachable Support"
    },
    {
        "date":"2025-11-18 11:08:38",
        "rating":4,
        "review_text":"I just now login Kotak 811 new app I am using to Kotak account 811 another one is Kotak spends account, if I login Kotak 811 new app it showing 2 CRn id after fill details and login showing Kotak 811 account details only I am enable to find Kotak spends account details please help me if Kotak Bank launching separate app Kotak spends account?",
        "thumbs_up_count":4,
        "title":null,
        "id":113,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-19 05:20:02",
        "rating":1,
        "review_text":"many options are missing in this app in comparison to opd one. The old one was tiff to use but with more options and this app only helps in payment but not in any other thing. I think you should work more on your app and help it improve more",
        "thumbs_up_count":4,
        "title":null,
        "id":114,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-11-19 10:50:35",
        "rating":1,
        "review_text":"Kotak Bank is not a customer friendly bank. please be aware when you engage with this bank. After engaging with this bank nobody will listen to your problems, specially when you are a loan or credit card holder. They are forced to do what they want only. Rubbish bank, I have never seen before. I will no more relation with this bank in future nor will I suggest to anyone to interact with this bank.",
        "thumbs_up_count":4,
        "title":null,
        "id":115,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-21 11:12:00",
        "rating":2,
        "review_text":"I reinstalled the app on my mobile phone and still the issue is the same. I was told so many times to customer care service and even the local branch but every time I got the same answer that your name is updated but in an app showing an old name. Now what next? 😔",
        "thumbs_up_count":4,
        "title":null,
        "id":116,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Poor Resolution"
    },
    {
        "date":"2025-11-30 04:15:38",
        "rating":1,
        "review_text":"I have paid Electricity bill pn 25 nov 25 with transaction id M3283440 but till date adani not received the payment what type of services kotak providing ? even customer care is not able to resolve the issue, now all the details I have provided then also I will get the response like please visit the branch or mail to our experts or contact to customer care , they thought customer don't have any work, it has been 5 days over but they are not able to resolve the issue , improve the service",
        "thumbs_up_count":4,
        "title":null,
        "id":117,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Poor Resolution"
    },
    {
        "date":"2025-11-30 07:30:53",
        "rating":1,
        "review_text":"This app doesn't have all the functionality the old app has. I can't view my other upi ID's nor I can deactivate them because now I can't login in old app. why force us to use this app when it's not Fully developed",
        "thumbs_up_count":4,
        "title":null,
        "id":118,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-12-01 17:22:07",
        "rating":1,
        "review_text":"Dear Kotak 811 Support Team, I hope you are doing well. I am writing to inform you that I mistakenly ordered a debit card through my Kotak 811 account. As a result, an amount of ₹799 has been deducted from my account for the card issuance. Since the request was made in error and I do not require the debit card, I kindly request you to please: 1. Refund the deducted amount of ₹799, and 2. Cancel\/close the debit card issued against my account.",
        "thumbs_up_count":4,
        "title":null,
        "id":119,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-10-14 02:07:33",
        "rating":2,
        "review_text":"Kotak 811 app does not show the option to change account for bill payment like it did in the old app - saving account\/credit card.",
        "thumbs_up_count":3,
        "title":null,
        "id":120,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-10-17 12:15:29",
        "rating":1,
        "review_text":"worst app ever it's KYC not happening, while going for KYC and PAN Details update, camera isn't operating. it's taking on Google Chrome where there While uploading PAN details camera isn't showing any option. worst app",
        "thumbs_up_count":3,
        "title":null,
        "id":121,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Broken Feature"
    },
    {
        "date":"2025-10-21 05:41:32",
        "rating":5,
        "review_text":"The Best As I Seem 👍 Request 🙏 Please , If We Have Emergency Pay To Someone And Developer Does Not Response Or Work At The Moment It's Bad For A User Or Customer So Request Please Provide The Best Service To Use On Time 🙏 And Also At Time. 🙏 Thanks 🙏",
        "thumbs_up_count":3,
        "title":null,
        "id":122,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-03 04:01:05",
        "rating":1,
        "review_text":"I have logged out from the website but still this app is opening and showing an error again and again. Remote desktop app detected by app.",
        "thumbs_up_count":3,
        "title":null,
        "id":123,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-16 02:42:11",
        "rating":4,
        "review_text":"Application is good but you need to update your rewards points section because I'm not able to find the latest recharge scheme in the section so I request you update it with latest plans",
        "thumbs_up_count":3,
        "title":null,
        "id":124,
        "theme":"Missing Features & Design",
        "sentiment":"Positive",
        "tag":"Missing Features"
    },
    {
        "date":"2025-11-16 03:41:43",
        "rating":1,
        "review_text":"worst app..I have current account trying to open new savings account ...it is asking me to enter credentials, post entering credentials app is navigating back to same page requesting me to enter credentials again...",
        "thumbs_up_count":3,
        "title":null,
        "id":125,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-29 14:30:02",
        "rating":1,
        "review_text":"could not complete secure sms check, tried several times and ways after removing sim card restarting phone but it didn't worked so I think the app is bad and last date for using app is 13 dec before that you should resolve all problems relating to app,and don't give me a reply on gstore,of write us on this mail and sorry for inconvenience caused by us.",
        "thumbs_up_count":3,
        "title":null,
        "id":126,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-10-09 14:35:13",
        "rating":1,
        "review_text":"why my 811 account don't run on new kotak 811 app. Always shows that \"the account is joint account in 811 banking please download Kotak bank app. \" That app also shows that please download kotak new 811 app. Why ? please solve my problem.",
        "thumbs_up_count":2,
        "title":null,
        "id":127,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Broken Feature"
    },
    {
        "date":"2025-10-13 10:27:46",
        "rating":1,
        "review_text":"Worst interface ever. It is so confusing. Multiple apps for same bank. All upi and everything has become invalid now.",
        "thumbs_up_count":2,
        "title":null,
        "id":128,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Poor UX\/Navigation"
    },
    {
        "date":"2025-10-24 13:31:33",
        "rating":1,
        "review_text":"glitches in the kyc process. one should know English or Hindi to complete kyc. else this is not for you. it says easy banking which is a lie. don't fall for this, go to any nearest bank which saves a lot of time.",
        "thumbs_up_count":2,
        "title":null,
        "id":129,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-06 13:47:21",
        "rating":1,
        "review_text":"worst bank I have come across. They debit your money trickly .Be careful .please open account in any top banks rather than in this bank and they do product delivery lately and does not care about customer services",
        "thumbs_up_count":2,
        "title":null,
        "id":130,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-10-09 05:23:05",
        "rating":1,
        "review_text":"the worst app I can't see my lien Balance and the kotak bank also worst they are cut charges I don't know for what just 1200 in this octor 2 to 8 in 6 days they cut my 1200 rupees the worst bank",
        "thumbs_up_count":1,
        "title":null,
        "id":131,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-10-22 04:35:36",
        "rating":1,
        "review_text":"it's new app biggest fraud with me . I paid my emi through the app Balance was debited from account but update in loan emi account... plz don't use this app",
        "thumbs_up_count":1,
        "title":null,
        "id":132,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-29 11:19:14",
        "rating":1,
        "review_text":"application get crash suddenly.. not working properly.. auto shutdown.. new version is not working.. old is best",
        "thumbs_up_count":1,
        "title":null,
        "id":133,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"App Crash\/Freeze"
    },
    {
        "date":"2025-11-04 04:58:10",
        "rating":5,
        "review_text":"very good experience. it only takes 30 min to open new a\/c. app is also good and bug free.",
        "thumbs_up_count":1,
        "title":null,
        "id":134,
        "theme":"Login Issues & App Stability",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-08 01:39:31",
        "rating":3,
        "review_text":"Money was debited from an account for ESC Bounce and cheque Bounce It took more than the amount was deducted from my account it is very worst thing",
        "thumbs_up_count":1,
        "title":null,
        "id":135,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-11-09 20:05:50",
        "rating":1,
        "review_text":"fake details.. too much calling once login to app \/ disturbance.. Fd booked but credit limit not provided. . really disappointed",
        "thumbs_up_count":1,
        "title":null,
        "id":136,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-21 08:48:00",
        "rating":5,
        "review_text":"I want everything to be included in this new kotak 811 app those are in kotak old app. It lacks net banking features. Looks like a kotak lite app.👎",
        "thumbs_up_count":1,
        "title":null,
        "id":137,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-11-21 11:09:48",
        "rating":1,
        "review_text":"After new update I can't view full transaction number and not any logout option and some other problems. Old app was good.....",
        "thumbs_up_count":1,
        "title":null,
        "id":138,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Missing Features"
    },
    {
        "date":"2025-11-23 07:27:47",
        "rating":2,
        "review_text":"The app is not working, getting some sort of errors so I'm not able to login to any of the kotak apps(new or old)",
        "thumbs_up_count":1,
        "title":null,
        "id":139,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-25 08:02:17",
        "rating":1,
        "review_text":"worst ever bank more thank 3k deducted from my account and every month few charges deducted from the account..there is no costumer care services available all the numbers from Google are non resible..SBI Bank is much better than this",
        "thumbs_up_count":1,
        "title":null,
        "id":140,
        "theme":"Unexpected Charges & Blocks",
        "sentiment":"Negative",
        "tag":"Unexpected Charges"
    },
    {
        "date":"2025-11-26 04:36:42",
        "rating":3,
        "review_text":"Many of the time apps don't respond. for the fastag section it always shows \"something went wrong\" error. faced issues while logging in many times.",
        "thumbs_up_count":1,
        "title":null,
        "id":141,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Slow Performance"
    },
    {
        "date":"2025-11-28 10:07:36",
        "rating":1,
        "review_text":"the worst experience I am having right now so immature app not even getting in me to login after several attempt of download and stress not even you can call the customer service they will ask for additional funds to call useless if you guys are giving me a reso so give or else I need to proceed with complain where ever I need to go",
        "thumbs_up_count":1,
        "title":null,
        "id":142,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-12-01 01:46:49",
        "rating":3,
        "review_text":"Customer support service of the bank is disastrous. All calls are always chargeable. No toll free number available to resolve the issues.",
        "thumbs_up_count":1,
        "title":null,
        "id":143,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Chargeable Calls"
    },
    {
        "date":"2025-11-20 03:42:32",
        "rating":1,
        "review_text":"Positive pay cheque issuance date not valid? That's what I see in the app. kindly fix it..",
        "thumbs_up_count":0,
        "title":null,
        "id":144,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Broken Feature"
    },
    {
        "date":"2025-11-26 07:08:01",
        "rating":1,
        "review_text":"Third class Customer support system. I am waiting for speak to with customer executive 10 minutes. After receiving the call , again hold my call 15 minutes & automatic call disconnect.",
        "thumbs_up_count":0,
        "title":null,
        "id":145,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Unreachable Support"
    },
    {
        "date":"2025-11-28 16:53:30",
        "rating":1,
        "review_text":"not able to login...updated the app also...sucked banking app ever i found..i dont know which wall they are talking about which not allowing me to enter",
        "thumbs_up_count":0,
        "title":null,
        "id":146,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-11-30 18:53:39",
        "rating":1,
        "review_text":"app vey worsted app i am facing so. much of issue any time i am facing remote desktop detect by app unable to open app",
        "thumbs_up_count":0,
        "title":null,
        "id":147,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Login Failure"
    },
    {
        "date":"2025-12-01 03:28:36",
        "rating":3,
        "review_text":"Why is there no option to add the India Post Payments Bank as a beneficiary? It is requested that it may please be added. Old kotak bank had the option for the same. Kindly make it available in the new app as well.",
        "thumbs_up_count":0,
        "title":null,
        "id":148,
        "theme":"Missing Features & Design",
        "sentiment":"Negative",
        "tag":"Feature Regression"
    },
    {
        "date":"2025-12-01 14:33:02",
        "rating":3,
        "review_text":"I opened a bank account today, but I can't see any information about my account. I even added 2000 rupees. Kindly help me",
        "thumbs_up_count":0,
        "title":null,
        "id":149,
        "theme":"Login Issues & App Stability",
        "sentiment":"Negative",
        "tag":"Broken Feature"
    }
]