[
    {
        "date":"2025-11-29 16:52:04",
        "rating":5,
        "review_text":"I mostly like to order food from Zomato, and overall my experience has been very good. The app is easy to use, and it shows clear restaurant ratings, menus, and offers. I really like the live tracking feature, which helps me know exactly when the food is being prepared and when the delivery agent is arriving. The delivery is usually on time, and the agents are polite and professional. The food packaging is clean and hygienic, and most of the time the food remains warm and fresh.",
        "thumbs_up_count":117,
        "title":null,
        "id":1,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-26 12:36:03",
        "rating":4,
        "review_text":"the actual one time I gave zomato a try, they are literally unresponsive in some cases. and to add, the restaurant had asked me to order something else and still hasn't fulfilled the same. Never using the pathetic app again update: after my review, realized that this is more of a feature that they disable for people who haven't used it for a long time. after trying a couple of times, i was able to get my refund.",
        "thumbs_up_count":114,
        "title":null,
        "id":2,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Agent Unavailability \/ Delay"
    },
    {
        "date":"2025-11-23 13:58:48",
        "rating":5,
        "review_text":"I recently ordered from Zomato, and my experience was mostly good. The app is easy to use, and finding food is simple. The delivery is usually on time, though sometimes they take a little longer during busy hours. The live tracking helps a lot, and the food arrives well-packed and warm. Prices can feel slightly high because of extra charges, but overall Zomato is convenient and reliable for quick meals.",
        "thumbs_up_count":94,
        "title":null,
        "id":3,
        "theme":"Pricing and Refunds",
        "sentiment":"Positive",
        "tag":"Hidden Fees \/ Charges"
    },
    {
        "date":"2025-11-30 06:56:18",
        "rating":4,
        "review_text":"This application generally provides a positive experience for food deliveries. The primary reason for not awarding a five-star rating is the occasional practice of combining nearby orders, even for gold members, which can lead to delays and, at times, spillage. I would be pleased to revise this rating in the future if improvements are made in this area. Nevertheless, I am currently quite satisfied with this application as a better alternative to Swiggy, and I find it to be truly impressive.",
        "thumbs_up_count":81,
        "title":null,
        "id":4,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Positive",
        "tag":"Multiple Orders"
    },
    {
        "date":"2025-11-25 10:16:59",
        "rating":1,
        "review_text":"No resolutions of issues in food quality, quantity. It just says to write a mail. So I guess that's what you charge platform fees for. Chat support is bad, and doesn't give you an option to write your issue many times. its just these are your options and go with these. Someone else has cancelled the order, and it shows you a false original price , you will reorder thinking I am saving this much, and will be fooled.",
        "thumbs_up_count":40,
        "title":null,
        "id":5,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Template Responses \/ Dismissal"
    },
    {
        "date":"2025-11-23 15:57:37",
        "rating":2,
        "review_text":"there's almost never a delivery partner nearby to the restaurants I want to order from. Almost as if zomato wants me to buy from other restaurants where offers happen to exist(promoted). Therefore, I end up not ordering at all. offers or not please let me order from the restaurant I want. if this continues I'll probably go back to ordering directly from the restaurant if it allows delivery or find alternatives. Also, bring back reviews with comments! it helps avoid unhygienic restaurants!",
        "thumbs_up_count":24,
        "title":null,
        "id":6,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-23 05:02:48",
        "rating":1,
        "review_text":"The recent experiences with this is app ia absolutely disappointing. Almost 4 times my order missed some items. No executive is available even for raising a concern or providing a feedback. Further, the compensations that are provided are not fair and everytime I have to some extra amount just to receive the item which is missing in the previous order. Now, today, after waiting for 45 mins, all of a sudden an executive with very rude approach called me to inform the order is cancelled.",
        "thumbs_up_count":18,
        "title":null,
        "id":7,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Agent Unavailability \/ Delay"
    },
    {
        "date":"2025-11-30 17:37:23",
        "rating":1,
        "review_text":"the customer support for this app is so poor. does not matter what was your issue the virtual assistant has only one response that is I am sorry I will try not to do this again and yet will end up doing the same thing again. any grievances that you have will definitely not get resolved by ZIA. the support cannot connect you to an actual assistant who will listen to your issue. there is just a virtual assistant who has the same response no matter how many time you try to explain the issue.",
        "thumbs_up_count":18,
        "title":null,
        "id":8,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Agent Unavailability \/ Delay"
    },
    {
        "date":"2025-11-23 15:51:57",
        "rating":1,
        "review_text":"Ordered food and the restaurant failed to meet the quantity as per the menu, when reported through chat to zomato, it was told to report through email. Got sorry reply only on sending email, no resolution. Customer's loss not a concern, it indicates zomato endorsing restaurants to act at their will, without having consideration for customers. Encouraged restaurants to show more quantity on the menu to attract customers but deliver less quantity. Can zomato justify this?",
        "thumbs_up_count":8,
        "title":null,
        "id":9,
        "theme":"Order Accuracy\/Quality",
        "sentiment":"Negative",
        "tag":"Order Inaccuracy"
    },
    {
        "date":"2025-11-21 22:49:26",
        "rating":1,
        "review_text":"I placed an order at 3:07 AM, with an estimated delivery time of 25 minutes. After this period, the delivery rider remained at the restaurant. Despite multiple attempts, I was unable to contact the rider via calls or messages. Subsequently, I contacted the restaurant, but the provided number was unresponsive. Upon reaching out to support, I was informed of an additional 40-minute delay due to the rider managing multiple orders. The support representative suggested consuming the dosa, which is",
        "thumbs_up_count":7,
        "title":null,
        "id":10,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Negative",
        "tag":"Multiple Orders"
    },
    {
        "date":"2025-11-22 05:12:51",
        "rating":1,
        "review_text":"I am extremely disappointed with the level of service I received. I placed an order for specific food items, yet an entirely different order was delivered to me. The hotel clearly confirmed that the incorrect order was not from them, which raises a serious concern about how your delivery personnel managed to hand over the wrong items in the first place. I submitted a complaint with all the necessary details and evidence, but Zomato’s customer support has been utterly unresponsive. Not a single",
        "thumbs_up_count":7,
        "title":null,
        "id":11,
        "theme":"Order Accuracy\/Quality",
        "sentiment":"Negative",
        "tag":"Order Inaccuracy"
    },
    {
        "date":"2025-11-25 10:00:48",
        "rating":1,
        "review_text":"Extremely disappointed with Zomato’s recent orders. Two items were missing, and even after sharing the photos they requested, they simply said they “couldn’t verify” the issue. I asked for proof of an RCA showing the items were actually packed, but received no response. Instead of resolving the issue or even bothering to check properly, they just closed the case without any justification Very poor customer support.",
        "thumbs_up_count":7,
        "title":null,
        "id":12,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Template Responses \/ Dismissal"
    },
    {
        "date":"2025-11-25 14:14:14",
        "rating":1,
        "review_text":"Very horrible app. My order was delayed by 1.5hrs and finally delivery partner had gone to wrong location and finally told that he can't come to my actual location. And this is not first time I'm experiencing previously many times my order has been delayed by 20-40mins. Uninstalling this app immediately now.",
        "thumbs_up_count":7,
        "title":null,
        "id":13,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Negative",
        "tag":"Delivery Error"
    },
    {
        "date":"2025-11-25 16:39:43",
        "rating":1,
        "review_text":"I placed an order while travelling in a special train, and Zomato did not provide proper delivery tracking because the location was not supported. I cancelled the order within 3 minutes because the assigned vendor (Hotel KFC) was not responding to any calls, and I had no way to confirm preparation or delivery. Despite cancelling immediately, Zomato did not process my refund. This is unfair as the service was not provided and the vendor was unreachable. Please issue a full refund at the earliest.",
        "thumbs_up_count":7,
        "title":null,
        "id":14,
        "theme":"Pricing and Refunds",
        "sentiment":"Negative",
        "tag":"Refund Denial"
    },
    {
        "date":"2025-12-01 03:28:16",
        "rating":3,
        "review_text":"It's OK. Poor service levels vs last time. Mainly from app perspective. They have become very sneaky - hidden charges, the platform fee keeps increasing by 50p every couple of weeks, they no longer call out delays - still says arriving on time when a 25 min order comes in 35 minutes. I miss the old Zomato. Now it's all faff and not enough good quality service.",
        "thumbs_up_count":7,
        "title":null,
        "id":15,
        "theme":"Pricing and Refunds",
        "sentiment":"Negative",
        "tag":"Hidden Fees \/ Charges"
    },
    {
        "date":"2025-11-22 09:54:14",
        "rating":2,
        "review_text":"I usually have a good experience with the app however I face this issue on and off that the delivery agent goes missing with my food. The only way Zomato has been able to help me at those times is by refunding my money. I guess that is the limit till where their accountability ends. The customer is however left with two options there - 1. order again and wait for another 30-40 mins while being absolutely irritated. 2. not order anything and just make the damn food by themselves.No accountability",
        "thumbs_up_count":6,
        "title":null,
        "id":16,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Negative",
        "tag":"Delivery Error"
    },
    {
        "date":"2025-11-22 18:00:38",
        "rating":1,
        "review_text":"WORST CUSTOMER SUPORT. WORST APP. doesn't deliver package on time and most of the time package is damaged and items gets spilled and destroyed, packages torn.DON'T ORDER FROM THIS APP. If you face a problem with order, without solving it right away they ask users to write email to customer support and it takes 3-4 days for them to reply. despite attaching HD video proof and HD images their retard team doesn't help the customer. worst customer support services ever experienced.",
        "thumbs_up_count":5,
        "title":null,
        "id":17,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Proof Ignored \/ Denied"
    },
    {
        "date":"2025-11-21 16:16:29",
        "rating":1,
        "review_text":"The partners now carry multiple orders. sometimes orders from other companies like swiggy. and nowadays they are always late. i always used to tip the riders and give them 5 star. now i stopped tipping and also give them 1 star. i have a gold i am paying extra money by tipping and taking subscription, i dont like my orders late everytym. also i am switching to other apps after my gold sub ends",
        "thumbs_up_count":4,
        "title":null,
        "id":18,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Negative",
        "tag":"Multiple Orders"
    },
    {
        "date":"2025-11-24 05:01:39",
        "rating":2,
        "review_text":"Zomato’s delivery service has become ridiculous. Orders are delayed again and again, and unless I waste my time following up, the food just shows up whenever — usually late. And when I finally ask to cancel after waiting an hour, they pressure me to accept cold, soggy food like it’s my problem. The service quality has dropped drastically, and customers are the ones paying for their incompetence.",
        "thumbs_up_count":4,
        "title":null,
        "id":19,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Negative",
        "tag":"Severe Delays"
    },
    {
        "date":"2025-11-25 08:46:30",
        "rating":3,
        "review_text":"Changing my review from 5 stars earlier to 3 becoz they've removed the individual food items rating system. Now it just says 'Highly Ordered' for me that doesn't mean necessarily that the food item from a new restaurant is good. I need to know the exact rating like it was earlier so I can confidently try new restaurants and new dishes based on that",
        "thumbs_up_count":4,
        "title":null,
        "id":20,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-23 22:45:16",
        "rating":1,
        "review_text":"I used to love the app because it was supportive. Now it just sucks. I get the wrong order, I try to chat with support and then they tell me there are a lot of queries so text back later n we'll get to u in 72 hrs. I would rather get my own food (Best option). Update:- They removed comments and now only show ratings. This app just got worse.",
        "thumbs_up_count":3,
        "title":null,
        "id":21,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Agent Unavailability \/ Delay"
    },
    {
        "date":"2025-11-23 16:20:57",
        "rating":1,
        "review_text":"Absolutely disappointed with Zomato. No one bothered to inform me that my order would be grouped with two or three other deliveries just so the company can cut costs. My order—a hot soup—was delivered last and arrived completely cold. Reheating ruined the texture and aroma, and I had to throw most of it away after a couple of spoons. To make it worse, the customer support agent (Sahil) basically implied on the recorded call that this may or may not be advised by bot ,hiding behind technicalitie",
        "thumbs_up_count":2,
        "title":null,
        "id":22,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Negative",
        "tag":"Multiple Orders"
    },
    {
        "date":"2025-11-26 00:16:33",
        "rating":1,
        "review_text":"These days Zomato has become a bit more expensive. There are no discounts like before nor any good quality of food, there is only loot going on. There was a time when Zomato used to serve such dishes that even poor people could afford, now it has become expensive. not so worth it. Complete waste of money. guys just don't order food from this app.",
        "thumbs_up_count":2,
        "title":null,
        "id":23,
        "theme":"Pricing and Refunds",
        "sentiment":"Negative",
        "tag":"Lack of Discounts"
    },
    {
        "date":"2025-12-01 17:32:53",
        "rating":1,
        "review_text":"Stupid app. Why list products on the app when they are unavailable? You cancel the order only after the delivery person has reached the restaurant, wasting an hour of time. Do not have the decency of cancelling it before and saving time and money. Happened more than once now. Unacceptable.",
        "thumbs_up_count":2,
        "title":null,
        "id":24,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Negative",
        "tag":"Order Cancellation Issue"
    },
    {
        "date":"2025-11-25 18:01:53",
        "rating":5,
        "review_text":"Excellent Experience of Service. Please develop some process or template if we want to cancel our refund request, if the request made mistakenly by overlook, like item are missing reporting due to overlook. This will save the Restaurant's prestige and refund for wrongly requested will not happen. I found no option in chat box for the same today.",
        "thumbs_up_count":1,
        "title":null,
        "id":25,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 03:03:45",
        "rating":2,
        "review_text":"The interface and serivces are very well but the partners or hotel mistake i don't know exactly,But some times they miss some of the order what i have ordered in my menu... after received the order, if the menu item 1 or 2 missed, immediately i call the partners mobile number but they won't respond property or don't picking up",
        "thumbs_up_count":1,
        "title":null,
        "id":26,
        "theme":"Order Accuracy\/Quality",
        "sentiment":"Negative",
        "tag":"Order Inaccuracy"
    },
    {
        "date":"2025-11-22 16:21:46",
        "rating":5,
        "review_text":"The delivery gets to me in time, and it's very easy to order whatever you like, things are just clicks away and in some time at your doorstep ! so don't crave hunger when you have apps like zomato your way !",
        "thumbs_up_count":0,
        "title":null,
        "id":27,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-24 13:46:37",
        "rating":2,
        "review_text":"Unreliable. Gets rejected at the last moment. Ordered to train seat around 90 mins before the station, Got rejected twice just 15mins before reaching station, when you cannot do anything. Prior and immediate communication and cancellation should be followed.",
        "thumbs_up_count":0,
        "title":null,
        "id":28,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Negative",
        "tag":"Order Cancellation Issue"
    },
    {
        "date":"2025-11-27 07:04:01",
        "rating":4,
        "review_text":"used one really. goodordered food from Dum AA Dum and was very happy with the entire experience. Their website is user friendly. The delivery was on time and the food taste was great. The price is also surprisingly very reasonable for the quality and quantity. I strongly recommend Dum AA Dum for good quality starters as well as main course. Their Chicken, mutton and fish kababs are excellent\".",
        "thumbs_up_count":0,
        "title":null,
        "id":29,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-27 10:19:58",
        "rating":1,
        "review_text":"Does what it is supposed to do; deliver food. But the chat support is dreadful. Despite sharing HD images of the food and bill receipts, they won't acknowledge the problem. Forces the user to switch to email, asks for proofs again. Then, simply refuse to do anything. Dismissal.",
        "thumbs_up_count":0,
        "title":null,
        "id":30,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Proof Ignored \/ Denied"
    },
    {
        "date":"2025-11-27 15:40:04",
        "rating":1,
        "review_text":"I order from Zomato 3-4 times a week, nothing wrong happened. But this time I got half eaten food , I have ordered garlic bread sticks the two center parts were missing but the packaging was interact how can this happen? After this when I tried contacting using chat, no human connected and told this type of spillage might happen. Great !! 😡",
        "thumbs_up_count":0,
        "title":null,
        "id":31,
        "theme":"Order Accuracy\/Quality",
        "sentiment":"Negative",
        "tag":"Food Quality Issue"
    },
    {
        "date":"2025-11-28 03:07:30",
        "rating":5,
        "review_text":"the app is great, however the discounts are very sparse. I do understand it's a business, but give us more discounts on frequently ordered restaurants like Meghana's Biriyani. oh and also the customer support is okay-ish since refund policy is bad. thanks for the great app! 😄",
        "thumbs_up_count":0,
        "title":null,
        "id":32,
        "theme":"Pricing and Refunds",
        "sentiment":"Negative",
        "tag":"Lack of Discounts"
    },
    {
        "date":"2025-11-28 11:17:40",
        "rating":3,
        "review_text":"it's good but there is one loop hole and that's really annoying, that we can't order from multiple places in one order like zomato does not have a cart like facility like other E shopping platform now if we have to order from multiple places we have to order as many places we are going for, not a single order is being executed",
        "thumbs_up_count":0,
        "title":null,
        "id":33,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 04:34:06",
        "rating":1,
        "review_text":"Hi Team, I have ordered wrong order yesterday then within 1 minute I realized and try to cancel order and didn't show any option and tried with restaurant person and cancelled order.but I didn't get any refund saying like late respond from my side even though I tried within a minute not get any option to cancel and I didn't get any single rupee as refund.This is worst experience with me zomato and I suggest no one to use zomato. it is like kind of Betting app legally... it's totally fake applica",
        "thumbs_up_count":0,
        "title":null,
        "id":34,
        "theme":"Pricing and Refunds",
        "sentiment":"Negative",
        "tag":"Refund Denial"
    },
    {
        "date":"2025-11-29 23:34:05",
        "rating":1,
        "review_text":"After 30 min of ordering, the order was cancelled by the restaurant stating some items were out of stock and the refund was also not on time If you're ordering i suggest you pay after delivery because if the order gets cancelled it takes 3+ days to reach your bank. When paying they take it on the spot but for refund why you take so long to give back our money.",
        "thumbs_up_count":0,
        "title":null,
        "id":35,
        "theme":"Pricing and Refunds",
        "sentiment":"Negative",
        "tag":"Slow Refund Process"
    },
    {
        "date":"2025-11-30 00:24:25",
        "rating":2,
        "review_text":"fix ur late night deliveries , I am sick of orders getting picked up by other delivery partners by mistake,i mean i understand anyone can make a mistake but at least cancel the order or something,why make me wait for more than an hour to just identify the problem when it's clear that delivery partners is not at the location he is supposed to be , just cancel as soon as possible so that the customer can find for other food options instead of sitting and waiting to know what's actually happening.",
        "thumbs_up_count":0,
        "title":null,
        "id":36,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Negative",
        "tag":"Delivery Error"
    },
    {
        "date":"2025-11-30 05:44:38",
        "rating":1,
        "review_text":"Highly disappointed that Zomato is giving offers unfairly. I order food almost daily via zomato. But, I noticed that I am not getting the much offer, while my room mate (who dont order often) getting many offers like 125 off etc almost daily, which shows there is no discount or offer for regular users. This demotivates me to use Zomato further. pls improve.",
        "thumbs_up_count":0,
        "title":null,
        "id":37,
        "theme":"Pricing and Refunds",
        "sentiment":"Negative",
        "tag":"Lack of Discounts"
    },
    {
        "date":"2025-11-30 09:08:21",
        "rating":1,
        "review_text":"My experience with Zomato has become disappointing I’ve been using the app for over a year but recently most of my orders were either delayed or never delivered at all. When I tried to cancel the customer care told me that if I cancel my COD option would be disabled for future orders. Because of that, I was forced to wait instead of getting help Customer support also didn’t solve any of my issues despite multiple attempts. Overall the service has become unreliable and frustrating. I am done now",
        "thumbs_up_count":0,
        "title":null,
        "id":38,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Negative",
        "tag":"Order Cancellation Issue"
    },
    {
        "date":"2025-11-30 10:06:28",
        "rating":1,
        "review_text":"I can't see reviews anymore, if you guys have removed it then it's really a downgrade. I used zomato because it have me options to check what others are reviewing which is gone now. Really really bad update 😕 Now there is other grouping, are you kidding me. Just where is this platform going. It USED to be fun and good experience. I am seriously thinking to stop using and end membership",
        "thumbs_up_count":0,
        "title":null,
        "id":39,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 17:41:46",
        "rating":1,
        "review_text":"The food I received was spoiled and had a strong, unpleasant odor, making it completely unsafe to eat. This is unacceptable and highly concerning. I have attempted to raise a complaint multiple times, yet it continues to be closed without any proper resolution. Expecting anyone to consume spoiled food is unreasonable, and being told that “nothing can be done” is an unacceptable response from support.",
        "thumbs_up_count":0,
        "title":null,
        "id":40,
        "theme":"Order Accuracy\/Quality",
        "sentiment":"Negative",
        "tag":"Food Quality Issue"
    },
    {
        "date":"2025-11-30 19:10:51",
        "rating":1,
        "review_text":"Zomato is now just trying to rob its customers with additional charges. Now, they want to us to add an additional charge of INR 50\/- for priority delivery. If not paid, the delivery agent will first deliver the order to someone else first before coming to you. This inturn spoils the food as it takes much more time to deliver and the food no longer remains hot. Hating this app now.",
        "thumbs_up_count":0,
        "title":null,
        "id":41,
        "theme":"Pricing and Refunds",
        "sentiment":"Negative",
        "tag":"Hidden Fees \/ Charges"
    },
    {
        "date":"2025-12-01 07:51:50",
        "rating":1,
        "review_text":"I placed an order to Guntur, along with complete address & pincode. While placing the order the location was set to Guntur as it shows at the top of the screen.But the order was delivered to my address in Hyderabad!!! This is a massive mistake on your side. The customer support is useless,non-existent.They only let me chat to an automated bot, which did not understand my concern at all & refused to connect to an agent via call.This is laughable & UNACCEPTABLE!!",
        "thumbs_up_count":0,
        "title":null,
        "id":42,
        "theme":"Delivery Delays & Errors",
        "sentiment":"Negative",
        "tag":"Delivery Error"
    },
    {
        "date":"2025-12-01 16:09:33",
        "rating":1,
        "review_text":"Zomato is the worst food app in the country when it comes to customer service. Mistakes are often made when items are incorrectly delivered or of horrendous quality. There is just no way to reach customer service. You have to mail them and will almost never hear back. Any responses if at all would be template type responses with zero attempts to resolve customer complaints. Zomato sucks - you are better off switching to another platform",
        "thumbs_up_count":0,
        "title":null,
        "id":43,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Template Responses \/ Dismissal"
    }
]