[
    {
        "date":"2025-12-11 03:28:43",
        "rating":2,
        "review_text":"Charging system was fixed. However now the lessons are getting stuck\/frozen at the end. Audio to text interpretation remains terrible. Audio quality in sentences remains spotty. Phrases are still repeated in the same lesson. I've learned enough of my language to realize some of their phrases and verb usage is wrong too. Google translate agrees.",
        "thumbs_up_count":2607,
        "title":null,
        "id":1,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Voice Recognition Issue"
    },
    {
        "date":"2025-12-12 16:24:20",
        "rating":1,
        "review_text":"19\/1\/2025: Although it seems to be falling on deaf ears, I will share my experience with this app. It has made learning stressful and demoralising. 12\/12\/2025: completed lesson twice, still says lesson is due..boo",
        "thumbs_up_count":73,
        "title":null,
        "id":2,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Content\/Lesson Error"
    },
    {
        "date":"2025-12-10 10:36:50",
        "rating":5,
        "review_text":"I really enjoy using Duolingo to learn languages, it's fun, interactive, and the lessons are easy to follow. I've made a lot of progress, and I love the daily streaks and reminders. I appreciate the effort and hope for more improvements soon!",
        "thumbs_up_count":60,
        "title":null,
        "id":3,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-12-12 04:45:01",
        "rating":3,
        "review_text":"Duo is \"ok\" to learn French, with good improvements on the latest change. The ads in the past few months are ridiculously frequent, especially for their paid for plans. One is nagged after almost every disk is completed. Because of the la k of explanations of mistakes, even on the lowest paid version, I'm not upgrading. It's hard to revise specific words or concepts. Offline mode seems to be gone now as well.",
        "thumbs_up_count":29,
        "title":null,
        "id":4,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Aggressive Ads"
    },
    {
        "date":"2025-12-11 00:35:15",
        "rating":1,
        "review_text":"Update: Voice recordings aren't working. As if the new system wasn't bad enough, the new leaderboard randomly has buggy exp where you don't get exp for your lessons. Today I got one even worse where I went down 5 exp for completing an old lesson. At the very least they should let us disable the leaderboard and just learn at our own pace without the horserace mechanics. Update: The newest voice recordings are even worse. 5 attempts at single words and it doesn't recognize correctly spoken words",
        "thumbs_up_count":29,
        "title":null,
        "id":5,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Voice Recognition Issue"
    },
    {
        "date":"2025-12-10 13:36:31",
        "rating":1,
        "review_text":"um, this app doesn't friendly to free user after their new feature. yeh, they change heart system to charge system, and this make me frustrated. I can't learn more than 2 lesson a day- they capitalism forced user to subscribe their app. this is not a free app.",
        "thumbs_up_count":29,
        "title":null,
        "id":6,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Paywall\/Monetization"
    },
    {
        "date":"2025-12-12 09:26:11",
        "rating":2,
        "review_text":"This app used to be great for learning. the new updates have more and more bugs and lagging in each update! can you just stop updating? 2\/5 I've finished the monthly challenge for 2 days but the badge just don't show up in my profile. sometimes I just feel like i should just stop using duo but the feeling of letting go of my 1000+ days strike is a bit unsettling. please just fix it!",
        "thumbs_up_count":27,
        "title":null,
        "id":7,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Content\/Lesson Error"
    },
    {
        "date":"2025-12-12 19:40:40",
        "rating":1,
        "review_text":"The energy points system that replaced hearts makes this app unusable. I can't do more than two rounds a day, plus 14 questions of a third round that will get cut off, even if I don't answer a single question incorrectly. The new system punishes you for every question. And as far as I know, the paid version doesn't offer the sorts of well-rounded practice lessons the free version used to have so I still won't pay for Super Duolingo. I won't pay for AI nonsense that I can get free elsewhere.",
        "thumbs_up_count":24,
        "title":null,
        "id":8,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-09 22:54:15",
        "rating":1,
        "review_text":"I use this app for 4 years now and never have I ever seen such a bad update! Borderline unusable without paying, energy runs out so fast even with no mistakes at all ! beside this horrible update the app is FULL of bugs, sometimes points don't get counted correctly, or time spent learning is all wrong or you can't even start a lesson due to bugs!! greedy company firing everyone replacing with ai and destroying everything.",
        "thumbs_up_count":22,
        "title":null,
        "id":9,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-11 22:45:49",
        "rating":2,
        "review_text":"I think Duolingo tried to improve things with the new energy instead of hearts, but it makes it really confusing to use. I don't know how much energy I need for a lesson, so many times I haven't been able to finish a lesson not because I got answers wrong but because I didn't have enough energy left for all the exercises.",
        "thumbs_up_count":21,
        "title":null,
        "id":10,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 04:41:04",
        "rating":3,
        "review_text":"be careful of \"losing your place\" in the league or it'll take away 2000 diamonds also if you accelerate graphic speed on your phone the animations get so much faster",
        "thumbs_up_count":18,
        "title":null,
        "id":11,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Streak\/Progress Loss"
    },
    {
        "date":"2025-12-11 13:50:55",
        "rating":3,
        "review_text":"The arabic course was really short, incomplete. Like other languages, you should add more sections and lessons....it was not enough at all.",
        "thumbs_up_count":14,
        "title":null,
        "id":12,
        "theme":"Content & Course Quality",
        "sentiment":"Negative",
        "tag":"Incomplete Content"
    },
    {
        "date":"2025-12-13 05:05:12",
        "rating":1,
        "review_text":"rewriting my review. I joined 12\/2019 free edition then about a year or so later I decided to do unlimited. Since then Duolingo has added new features for MORE MONEY. Duolingo removed the heart options for \"energies\" which limits how much you can learn in one sitting; even with ads and perfect score. harder to advance. punishes you if you dont have energy and forces you to quit. not worth it long term. especially the legendary status. sometimes you just can't do it even with 25 energies.",
        "thumbs_up_count":13,
        "title":null,
        "id":13,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 10:23:35",
        "rating":1,
        "review_text":"Your new energy system is not good. Only allows a few minutes of learning even if no mistakes. No chance of meeting the daily challenges as can only do two lessons max and only a couple of minutes. Will be heading from the top to the bottom league very rapidly. Fed up of constant badgering to join Super. This is not an improvement. Only having 5 hearts was bad enough but much better than this!",
        "thumbs_up_count":13,
        "title":null,
        "id":14,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 13:24:00",
        "rating":5,
        "review_text":"THIS WAS REALLY FUN u give me free Super Duolingo and I'm a 1st and I everyday work in Duolingo and then I become 1st and I want give u 1000T star!!",
        "thumbs_up_count":11,
        "title":null,
        "id":15,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-12-12 10:16:22",
        "rating":1,
        "review_text":"Show English. Not AMERICAN English. 'The Fall' is the AUTUMN! 'Pants' are TROUSERS!! A 'Movie Theatre' is a CINEMA..!! 'Football' is not soccer, it is FOOTBALL.. 'American Football' is NOT \"Football\" in England, where we speak ENGLISH, it is AMERICAN FOOTBALL..!!! Learn ENGLISH! At the very least, actual UK ENGLISH answers should not be incorrect in this App.. you could program it to accept both...? FFS. Also, please stop putting random people in my Feed - I don't care about them!!!!",
        "thumbs_up_count":11,
        "title":null,
        "id":16,
        "theme":"Content & Course Quality",
        "sentiment":"Negative",
        "tag":"Content Irrelevance"
    },
    {
        "date":"2025-12-12 06:31:19",
        "rating":1,
        "review_text":"I kept my promise of not renewing my paid sub. The app is unusable now. I will never again support this money grubbing company I used to love. Don't believe the \"free learning for all\" claim, they are doing everything they can to make learning impossible for free users. The energy system couldn't be more detrimental to learning if they tried. And \"Duolingo Max\" is just bad AI explanations that don't explain anything, and AI video calls. And they got rid of the forums that were actually helpful!",
        "thumbs_up_count":11,
        "title":null,
        "id":17,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Paywall\/Monetization"
    },
    {
        "date":"2025-12-12 03:39:44",
        "rating":1,
        "review_text":"If I could give this ZERO stars I would. Once you stop paying the subscription, all of the focus on 'learning' goes out the window. Far too many ads which pop up after every lesson and the need to have hearts to progress. What a joke, developers should be ashamed of themselves.",
        "thumbs_up_count":10,
        "title":null,
        "id":18,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Aggressive Ads"
    },
    {
        "date":"2025-12-10 14:59:24",
        "rating":1,
        "review_text":"The new horrible energy system means you can only reliably do two short lessons before you're out of energy, while before with the hearts system you could go on and on as long as you're careful and thought about your answer, which promoted better learning. If you're only starting now, don't bother. Find another app for your language learning needs. Update: Wow, now they added game ads that don't have an exit or skip button, forcing you to play or close the app. Getting from bad to worse.",
        "thumbs_up_count":10,
        "title":null,
        "id":19,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Aggressive Ads"
    },
    {
        "date":"2025-12-11 15:37:02",
        "rating":1,
        "review_text":"thanks for changing the 5 hearts to 25 battery, now it's super difficult for me to learn more than 2 lessons a day since it's 1 battery a question. now I have less motivation to learn on this stupid app 👍🏽",
        "thumbs_up_count":9,
        "title":null,
        "id":20,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-10 08:47:28",
        "rating":1,
        "review_text":"why am i forcefully needing to see random people in my feed?",
        "thumbs_up_count":9,
        "title":null,
        "id":21,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Confusing UI\/Features"
    },
    {
        "date":"2025-12-09 22:04:56",
        "rating":1,
        "review_text":"The energy system...just STOP! Stop it, stop it, stop! Things are simple: you either choose to keep the app usable for free users or you loose them! Everything else is just noise.",
        "thumbs_up_count":8,
        "title":null,
        "id":22,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-11 15:04:33",
        "rating":1,
        "review_text":"stillbad 5 Refresher course is a terrible idea. and a 1 minute ad after every single lesson is such a disappointment. This app is not free, it consumes your time with lengthy ads and unnecessary refresher course, and encourages you to pay a subscription through super duolingo. Sure, you'll learn a few things about the language you want, but they make it too long to actually \"learn\" more because of ads and unnecessary refresher courses again and again and again. Mizu to Gohan Kudasai is insane.",
        "thumbs_up_count":7,
        "title":null,
        "id":23,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Aggressive Ads"
    },
    {
        "date":"2025-12-10 04:52:24",
        "rating":2,
        "review_text":"The amount of LGB material has started to get excessive. Almost every lesson it's smeared in your face, sometimes several times in one lesson. Even the \"child character\" has a boyfriend now. I don't care if it's every once in a while, but now it seems like they're going out of their way to put it in there. Just because of this, I wouldn't recommend this app for children.",
        "thumbs_up_count":6,
        "title":null,
        "id":24,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-12-09 18:48:37",
        "rating":1,
        "review_text":"music lessons are completely broken",
        "thumbs_up_count":6,
        "title":null,
        "id":25,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Content\/Lesson Error"
    },
    {
        "date":"2025-12-11 18:05:14",
        "rating":1,
        "review_text":"duo now runs 2 ads at the exact same time and force installs aps when u hit X to end the ad. then i have to uninstall the ap and duo loses track of your points for the lesson u just finished. ...been on duolingo since april 2020. recent changes to the app make it difficult to get just a few lessons done and the constant ads to buy duolingo and attempts to foce people to buy. duolingo because u try to force people is WHY i havent subscribed in over 5 years ive been learning on your app.",
        "thumbs_up_count":5,
        "title":null,
        "id":26,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Aggressive Ads"
    },
    {
        "date":"2025-12-10 13:05:45",
        "rating":1,
        "review_text":"still have offline issues. if i complete a task and ive not connected before the days out i loose my streak...",
        "thumbs_up_count":5,
        "title":null,
        "id":27,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Streak\/Progress Loss"
    },
    {
        "date":"2025-12-10 00:41:03",
        "rating":1,
        "review_text":"Limits you to 2-3 lessons a day unless you pay, due to the \"Energy\" limit",
        "thumbs_up_count":5,
        "title":null,
        "id":28,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-09 21:21:34",
        "rating":1,
        "review_text":"Same boring content again and again. No learning at all, just Streak and leaderboard competitions. Super Duolingo is super useless. energy is the worst ever idea.",
        "thumbs_up_count":5,
        "title":null,
        "id":29,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-09 20:25:38",
        "rating":2,
        "review_text":"My Yiddish score is 45. I finished the course a while ago at the Legendary level and my score hasn't budged. The slow speech feature is not operational and the normal speech feature typically omits words. It's this lack of attention to detail that makes the app sloppy and less than rewarding.",
        "thumbs_up_count":5,
        "title":null,
        "id":30,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Feature Not Working"
    },
    {
        "date":"2025-12-09 17:11:41",
        "rating":1,
        "review_text":"okay Duo. 398 days in on a streak and you're trying to ruin my life! why? why? duo are you giving me rewards that don't have anything to do with you and my progress with learning!? this is illogical! you give me a reward for some random game that I've never heard of!? this is madness. your AI is ruining everything. this is it! the last straw. even though I've worked soooo hard. if you don't stop the madness in trying to get money out of poor people, ill have no choice but to break my streak",
        "thumbs_up_count":5,
        "title":null,
        "id":31,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"AI Implementation"
    },
    {
        "date":"2025-12-12 15:15:46",
        "rating":1,
        "review_text":"Cowardly Oscar and his stalemates, oh what a joke 🙄 when playing Oscars 20min chess, why can't we the players declare a draw like Oscar the coward does when he's loosing?",
        "thumbs_up_count":4,
        "title":null,
        "id":32,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-12-12 04:45:23",
        "rating":1,
        "review_text":"My prior review about a year ago complained about the forced adoption of avatars, but the app has become so difficult to use that I have to kill my 1300-day streak. The app is not useful when learning a language without a paid subscription. I was somewhat happy with the experience when I was part of a friend's Super Family plan, but now I can't study for more than 5 minutes with the new energy system. I am really proud of the streak I have built (3 and a half years), but I can't do this anymore.",
        "thumbs_up_count":4,
        "title":null,
        "id":33,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 02:53:22",
        "rating":1,
        "review_text":"I use the free version and it's a good refresher for the Spanish I already know but it's not great for actually learning how the language works. Its kinda stingy with earning gems and the energy metric is worse than heart refills were.",
        "thumbs_up_count":4,
        "title":null,
        "id":34,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-11 23:31:08",
        "rating":1,
        "review_text":"I changed my review from 5 stars to 1 star because after swapping having lives to using energy, you limit yourself to limited lessons per day, basically forcing you to subscribe if you want to learn more. Before the system was fairer and if you didn't do mistakes you could go on and learn. Pity it has fallen to this.",
        "thumbs_up_count":4,
        "title":null,
        "id":35,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-11 22:37:35",
        "rating":1,
        "review_text":"The new aggressive Ads are over the top irritating. I've played almost 500 days in a row. Deleted.",
        "thumbs_up_count":4,
        "title":null,
        "id":36,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Aggressive Ads"
    },
    {
        "date":"2025-12-11 16:55:11",
        "rating":3,
        "review_text":"I wrote myself into the 8th grade since there's was no international option, but I don't know anything about slope or how to find them in algebra! They just assumed I knew what a slope. it would have been better if there was a video before every, lesson in the math, English or whatever so we can understand before we do because some of us are learning new things, also my during french lessons voice record does not work at all very disappointed",
        "thumbs_up_count":4,
        "title":null,
        "id":37,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Voice Recognition Issue"
    },
    {
        "date":"2025-12-11 15:48:52",
        "rating":1,
        "review_text":"ยิ่งอัพเดต ยิ่งห่วยแตก เอาไป1ดาวพอแล้วกับระบบEnergyโง่ๆของมึงน่ะ",
        "thumbs_up_count":4,
        "title":null,
        "id":38,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-11 05:05:51",
        "rating":1,
        "review_text":"Was good at first, before all of the AI implementation. Then they switched to the energy system which made it more difficult to finish a lesson. Then they removed the ability to earn gems from completing lessons. Now there is no free way to earn gems and instead youre stucking having to pain. Was a great app but the company didn't like that and had to make it worse for profit.",
        "thumbs_up_count":4,
        "title":null,
        "id":39,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-10 13:21:16",
        "rating":2,
        "review_text":"I have been enjoying this app since 2015. Update 7\/11\/23 it's fine now. 12\/1025 update. I no longer use the duolingo apt since it went with the energy bar instead of hearts. I still use duolingo in it's website duolingo. com no ads and I don't loose hearts ♥️ when I get the right answer. yes the website still uses hearts system. by the way I am don't pay subscription .",
        "thumbs_up_count":4,
        "title":null,
        "id":40,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 23:29:23",
        "rating":1,
        "review_text":"It was good, but Duolingo has since changed its business model in a way that punishes people who study more, vs the old system which encouraged you to be accurate to study more. it's now not possible to do 3 lessons a day due to the amount of energy needed, so I have to either watch extra ads, OR pay for the app doulingi also irritates me in that you now have a lesson, then an ad, then several unstoppable cut scenes. I don't need you to show an animation of how many days it's been, and 3 more",
        "thumbs_up_count":3,
        "title":null,
        "id":41,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 18:20:50",
        "rating":1,
        "review_text":"Duolingo had an excellent feature that encouraged students to keep studying, which was to practice to earn hearts. That feature was removed, which makes this app unusable for beginners. It just becomes too frustrating. UPDATE I saw you had changed your heart thingy and decided to give it a try. It's even worse. Maybe the problem is me and you're just in a competition for the most unmotivating app. So.. I guess it's so long... and thank you for all the fish.",
        "thumbs_up_count":3,
        "title":null,
        "id":42,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 17:10:14",
        "rating":4,
        "review_text":"Thank you for continuous effort to improve the app. Even though curren version seems good but as i am using this app for a long time and have 3 year strike days, so I think there is still space for improvement. For me when I was trying to learn a new language at beginning I was at good pace of completing several course a day but then the level of course going high then it needs more time to complete one course. So it would be great to have option to complete current course in two or three parts.",
        "thumbs_up_count":3,
        "title":null,
        "id":43,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-12-12 16:12:07",
        "rating":1,
        "review_text":"Run away and dont look back.......",
        "thumbs_up_count":3,
        "title":null,
        "id":44,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-12-12 12:53:49",
        "rating":2,
        "review_text":"I don't like how the new energy system works.",
        "thumbs_up_count":3,
        "title":null,
        "id":45,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 04:53:36",
        "rating":1,
        "review_text":"Hearts Was better when doing a lesson, Energy is Wrost update. i can only do one lesson after that energy completely gone, Totally Wrost Apo Now. Please Being Heart System Back❤️❤️❤️❤️",
        "thumbs_up_count":3,
        "title":null,
        "id":46,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-11 23:54:02",
        "rating":1,
        "review_text":"Started using ai and now this app is useless. Its like trying to use google translate to learn. Horrible app run by someone who's too cheap to pay for professionals. I wish I could give this a 0",
        "thumbs_up_count":3,
        "title":null,
        "id":47,
        "theme":"Content & Course Quality",
        "sentiment":"Negative",
        "tag":"Poor Learning Method"
    },
    {
        "date":"2025-12-11 21:45:00",
        "rating":1,
        "review_text":"Advertising for \"partner offers\" and games such as \"genshin impact\" in super duolingo. Please explain what to me what does \"ad-free\" mean?",
        "thumbs_up_count":3,
        "title":null,
        "id":48,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Aggressive Ads"
    },
    {
        "date":"2025-12-11 21:18:10",
        "rating":1,
        "review_text":"i like the app before. there was no need to change the hearts into the battery. it decreases even if I don't make any mistakes. and I had to leave my lesson midway. because the battery is finished. it's a really sad thing. I can't finish my lesson and my battery is finished. change it please",
        "thumbs_up_count":3,
        "title":null,
        "id":49,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-11 12:52:08",
        "rating":1,
        "review_text":"The new layout has been even worse. lots of filler revision nodes injected between learning new words. They're dragging things out to make it seem like there's more content.",
        "thumbs_up_count":3,
        "title":null,
        "id":50,
        "theme":"Content & Course Quality",
        "sentiment":"Negative",
        "tag":"Content Padding"
    },
    {
        "date":"2025-12-09 21:37:35",
        "rating":1,
        "review_text":"I remember when it was about learning a language not getting ads or having to pay more money to learn (the energy trash). Now it keeps pestering me.",
        "thumbs_up_count":3,
        "title":null,
        "id":51,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Paywall\/Monetization"
    },
    {
        "date":"2025-12-13 02:50:01",
        "rating":1,
        "review_text":"they keep adding marketing things, but they're not improving the quality of learning. there's now multiple glitches that you cannot open when you've paid for something. I've sent things into customer service and all you get is a blanket statement and no one follows up with anything. I would not recommend this program for anybody.",
        "thumbs_up_count":2,
        "title":null,
        "id":52,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Feature Not Working"
    },
    {
        "date":"2025-12-13 02:14:31",
        "rating":5,
        "review_text":"edit: They corrected my issue it seems. Thank you. They forced me to use my trial of super duolingo when I'm not able to actually use it and benefit from it. When I'm focused on preparing for Christmas and not wasting time on this app. So I'll use my free trail than be done with this app.",
        "thumbs_up_count":2,
        "title":null,
        "id":53,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-12-13 00:40:18",
        "rating":3,
        "review_text":"I have reduced the rating because due to previous experience, duolingo has been extremely useful to me, however lately the app has given me more advertisements towards this so called super duolingo than I have ever received ads. After every course this super duolingo is being introduced to me and recently they have added a energy boost meaning I can run out of energy which from then on holds my learning back as I cannot recharge unless I pay diamonds or get super duolingo.",
        "thumbs_up_count":2,
        "title":null,
        "id":54,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 15:23:18",
        "rating":3,
        "review_text":"I've just upgraded to the Duo Max mainly for speaking exercises. Unfortunately that part of Duo Max is the weakest and the most buggy part of the app.",
        "thumbs_up_count":2,
        "title":null,
        "id":55,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Feature Not Working"
    },
    {
        "date":"2025-12-12 04:47:11",
        "rating":1,
        "review_text":"heart system was great. battery system is the greediest thing they ever came up with. i used to be paid member but i'd never want to encourage that level of greed. stay far away",
        "thumbs_up_count":2,
        "title":null,
        "id":56,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Paywall\/Monetization"
    },
    {
        "date":"2025-12-12 04:16:44",
        "rating":1,
        "review_text":"I have been an avid user of Duolingo for some time, so it really hurts to see them making such a horrible change to the app. I'm aware the intention was never to teach, just to make money, but at least try to hide it a little bit. The new 'energy' system is stupid and punishes you for not paying for the app. I had over 1100 days on this app and will not be reinstalling.",
        "thumbs_up_count":2,
        "title":null,
        "id":57,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 04:15:56",
        "rating":1,
        "review_text":"after the new update this turned so dog water, what the hell were you thinking before implementing the energy system",
        "thumbs_up_count":2,
        "title":null,
        "id":58,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 00:06:27",
        "rating":1,
        "review_text":"Awful now that they have switched to the stupid energy system that makes it basically impossible to go free and they're using AI in everything making the experience for some questions just awful",
        "thumbs_up_count":2,
        "title":null,
        "id":59,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-11 23:13:37",
        "rating":2,
        "review_text":"Usually far too many ads with there being ads for both super and for things like temu, at least the ads for games provide a small breather between exercises. Otherwise a fantastic app! Edit: This app is worse now (despite fewer annoying ads): The heart system was replaced with 'energy', making it impossible to complete the legendary sections without paying (this cut my motivation in half); sometimes when clicking 'can't listen' it counts as wrong answer; also, steak system doesn't always work.",
        "thumbs_up_count":2,
        "title":null,
        "id":60,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Aggressive Ads"
    },
    {
        "date":"2025-12-11 22:29:12",
        "rating":1,
        "review_text":"used to be great, would not count on it existing in a year with the current direction",
        "thumbs_up_count":2,
        "title":null,
        "id":61,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-12-11 22:28:28",
        "rating":1,
        "review_text":"I changed my review from 4 stars to 1 star and it will stay here until they either restore the social feed back to reverse chronological or give the option to change it to that. I hate the way it currently is.",
        "thumbs_up_count":2,
        "title":null,
        "id":62,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Confusing UI\/Features"
    },
    {
        "date":"2025-12-11 21:00:39",
        "rating":4,
        "review_text":"I wonder when they're going to fix the speaking part of the app. it hasn't been working for several days now.",
        "thumbs_up_count":2,
        "title":null,
        "id":63,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Feature Not Working"
    },
    {
        "date":"2025-12-11 06:48:09",
        "rating":1,
        "review_text":"Not only is the new energy system extremely confusing and unfriendly to people who didn't pay, making it impossible to advance to the next league or not drop out, it also have 2 ads after every single lesson. The worst experience for me is that after I updated the app, the whole course is different. I was already on chapter 3 and the app assumed that I completed all the lessons before that and now its giving me words that I've never seen before. This is impossible for me to learn the language.",
        "thumbs_up_count":2,
        "title":null,
        "id":64,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Aggressive Ads"
    },
    {
        "date":"2025-12-11 05:43:06",
        "rating":2,
        "review_text":"don't appreciate that they're replacing their workers with ai...and this app doesn't teach you actual real life conversations, and it mainly focuses on keeping a streak. which doesn't matter when it comes to having someone who fluently speaks that language, asking you a question. so ditch this, start using YouTube tutorials from people who actually know how to speak it. and speak it first. don't trust romanization.",
        "thumbs_up_count":2,
        "title":null,
        "id":65,
        "theme":"Content & Course Quality",
        "sentiment":"Negative",
        "tag":"AI Replacement"
    },
    {
        "date":"2025-12-11 04:52:10",
        "rating":1,
        "review_text":"I have had this app for years. over a 2000 day streak and the energy system ruined it. I cant do more than 3 lessons a day without watching ads even if I get every question perfect. This app doesn't prioritize learning languages anymore.",
        "thumbs_up_count":2,
        "title":null,
        "id":66,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-11 01:05:17",
        "rating":5,
        "review_text":"Can no longer practice for hearts, you just get to watch ads. Some of the rewerds don't apply when you complete the challenges.",
        "thumbs_up_count":2,
        "title":null,
        "id":67,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Aggressive Ads"
    },
    {
        "date":"2025-12-10 22:49:36",
        "rating":1,
        "review_text":"The new battery system in unfair and completely irrational. Fix it.",
        "thumbs_up_count":2,
        "title":null,
        "id":68,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-10 19:46:33",
        "rating":3,
        "review_text":"This app used to be good for learning until they changed the hearts system to an energy system. The hearts system motivated me to focus on accuracy and give my answers a full thought, but now, it's replaced by energy which is spent in every question attempted. You cannot possibly learn for a long amount of time at once if you're on a free plan, which is highly disappointing because we already endure a lot of advertisements in the free plan.",
        "thumbs_up_count":2,
        "title":null,
        "id":69,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-10 12:38:09",
        "rating":1,
        "review_text":"I didn't think the app could get any worse after the ceo went AI first but wow is it a useless app now with the constant pop ups and the energy system they added only let's you use the app for 5 min even with 100% correct answers basically encouraging you not to learn",
        "thumbs_up_count":2,
        "title":null,
        "id":70,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-10 10:19:28",
        "rating":2,
        "review_text":"Since the energy thing came in, duo just sucks, too many ads.",
        "thumbs_up_count":2,
        "title":null,
        "id":71,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-10 03:33:36",
        "rating":2,
        "review_text":"not the best app to learn. changed hearts to energy so you can't do all the lessons for missions without spending gems or money. mostly pay to play now. ads you can't close workout exiting app and restarting so they hope you buy the paid version.",
        "thumbs_up_count":2,
        "title":null,
        "id":72,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Paywall\/Monetization"
    },
    {
        "date":"2025-12-10 01:56:23",
        "rating":1,
        "review_text":"collabing with a major game to try and save your reputation, only to do nothing towards the collab yourselfs is kinda scummy..",
        "thumbs_up_count":2,
        "title":null,
        "id":73,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-12-10 00:51:27",
        "rating":2,
        "review_text":"I changed my rating from 5* to 2* because every update over the last year at least, has made the experience worse. Not considerate of our time at all. you get 1 lesson then have to wait half a day to let your energy refill. took away the comminity we used to ask questions?! i used to do a lot more. there was nothing wrong with it before it just didn't make you enough money?",
        "thumbs_up_count":2,
        "title":null,
        "id":74,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-09 23:39:10",
        "rating":1,
        "review_text":"The energy system is completely demotivating. It takes even when the class is done without any mistakes, and is usually disruptive",
        "thumbs_up_count":2,
        "title":null,
        "id":75,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-09 21:23:38",
        "rating":1,
        "review_text":"please Duolingo change the energy cos it simply makes no sense..",
        "thumbs_up_count":2,
        "title":null,
        "id":76,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-09 20:08:25",
        "rating":4,
        "review_text":"everything is good, until the new update arrived that charge energy option,i think that previous heart option tha gets less whenever we do mistake is much much better than this frustrated energy one.",
        "thumbs_up_count":2,
        "title":null,
        "id":77,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-09 18:41:10",
        "rating":1,
        "review_text":"GET THE RANDOM PEOPLE OUT OF MY FEED. WHY ARE YOU PROMOTING RANDOM ACCOUNTS TO ME THAT I HAVE NO DESIRE TO FOLLOW? DUOLINGO SHOULDN'T HAVE INFLUENCER UPDATES TO MIMIC SOCIAL MEDIA. LEAVE ME ALONE. WORST UPDATE",
        "thumbs_up_count":2,
        "title":null,
        "id":78,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Confusing UI\/Features"
    },
    {
        "date":"2025-12-13 07:40:47",
        "rating":2,
        "review_text":"The change from hearts to energy is a minus for me. Even when getting all lessons correct, I run out of energy after 10 minutes or so unless I pay or watch even more ads. Also, it's not very good for what I use in real life on my visits to Germany. I've never had to talk to anyone about witches or turtles.",
        "thumbs_up_count":1,
        "title":null,
        "id":79,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-13 07:22:00",
        "rating":3,
        "review_text":"Used to be much better but recently has been getting more and more glitchy and now has AI content of questionable accuracy",
        "thumbs_up_count":1,
        "title":null,
        "id":80,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"AI Accuracy"
    },
    {
        "date":"2025-12-13 07:21:47",
        "rating":1,
        "review_text":"I have used this app everyday for the last 4 years, but the new energy system has completely stolen my joy and motivation for using the app. If the change was intended to increase revenue, for me it's failed. I don't use the app as much now, so I don't watch as many ads!",
        "thumbs_up_count":1,
        "title":null,
        "id":81,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-13 04:51:21",
        "rating":4,
        "review_text":"EDIT: I pay for Pro, only now there is more Pro!! i'am already paying a pretty hefty price monthly, but the app won't explain my mistakes unless I pay more?! It's getting out of hand... Great so far!! The conatant push to go pro is a tad annoying, but also understandable. Otherwise, the lessons are fun and easy to work with. They teach new words while still bringing up what you've already learned.",
        "thumbs_up_count":1,
        "title":null,
        "id":82,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Paywall\/Monetization"
    },
    {
        "date":"2025-12-13 01:52:15",
        "rating":1,
        "review_text":"Unfortunately, I have to update my review as they recently changed the hearts to energy but the energy doesn't last nearly as long as the hearts. **I got every question correct yet I ran out of energy.** If I had hearts I would be able to continue learning as you only lost them when you made a mistake. This is crazy! Unfortunately they're now restricting time periods of 3x XP boosts without telling you. I earned a 3x boost that used to be valid anytime but it doesn't activate after 8pm or so.",
        "thumbs_up_count":1,
        "title":null,
        "id":83,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-13 01:26:51",
        "rating":1,
        "review_text":"Word Practice on the app has been broken for months. It works fine on the PC version, but the app doesn't populate the list and rehashes the same 2 dozen words forever, even with a word count in the hundreds. Feedback and Reporting of this issue is completely ignored.",
        "thumbs_up_count":1,
        "title":null,
        "id":84,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Feature Not Working"
    },
    {
        "date":"2025-12-12 22:10:19",
        "rating":1,
        "review_text":"using ai..",
        "thumbs_up_count":1,
        "title":null,
        "id":85,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-12-12 21:54:54",
        "rating":1,
        "review_text":"horrible not learning at all your just guessing",
        "thumbs_up_count":1,
        "title":null,
        "id":86,
        "theme":"Content & Course Quality",
        "sentiment":"Negative",
        "tag":"Poor Learning Method"
    },
    {
        "date":"2025-12-12 21:42:04",
        "rating":3,
        "review_text":"Great application that makes learning fun. Please could you pass on a couple of suggestions: 1. When listening and selecting a single word, show the translation with the result. 2. On multi-word answers, allow for drag & dropping of words within the answer so you don't have to redo the whole answer if you miss the first word. 3: Prioritise words that have real world applications. I've learned the word bee before the word name. I'm more likely to ask for a name than to ask about bees.",
        "thumbs_up_count":1,
        "title":null,
        "id":87,
        "theme":"Content & Course Quality",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-12-12 21:30:07",
        "rating":1,
        "review_text":"BUG. Words not loading. Returns back to the screen. BUG",
        "thumbs_up_count":1,
        "title":null,
        "id":88,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"App Crash\/Freeze"
    },
    {
        "date":"2025-12-12 18:05:47",
        "rating":1,
        "review_text":"Hate the new energy mechanic so uninstalled. Busuu is better if you want more grammar content.",
        "thumbs_up_count":1,
        "title":null,
        "id":89,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 17:41:33",
        "rating":2,
        "review_text":"It was a great game before, but it's only getting worst and worst. The introduction of the energy is clear pay to play approach. Also is random and annoying how it's choose to return you energy if you have 5, 10 & etc in a row. Quests are also non-sense now. You are only care about the premium user and you punish regular user with every update. Now I rate it with only 2 stars and next time when I'm on this page most probably will be to click on the Uninstall button.",
        "thumbs_up_count":1,
        "title":null,
        "id":90,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 17:33:07",
        "rating":1,
        "review_text":"Energy system is horrible. id rather brute force learning a language by only watching youtube videos about topics i know only in the language i want to learn than get almost through a regular lesson to run out of energy even though i get every answer correct. i used to be able to go theough 5 lessons a day and it helped but now the app is useless and more frustration than is worth especially somce they shove the fact you can pay for the ability to actually get through the lessons.",
        "thumbs_up_count":1,
        "title":null,
        "id":91,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 17:27:36",
        "rating":1,
        "review_text":"This is not a good app for learning a language. It's more of a game instead of an actual language learning app. If you run out if diamonds you have to either watch ads or just give up on the lesson until the next day. I stopped using this app for that reason but after they started using Ai instead of actual people to monitor the app, I deleted in completely and I will never be using it again. It's sad to see good companies change their whole persona just because of greed. Do better.",
        "thumbs_up_count":1,
        "title":null,
        "id":92,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-12-12 17:26:34",
        "rating":1,
        "review_text":"No longer free. Practice to earn hearts disabled.",
        "thumbs_up_count":1,
        "title":null,
        "id":93,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Paywall\/Monetization"
    },
    {
        "date":"2025-12-12 15:25:13",
        "rating":4,
        "review_text":"please bring back the old mistake system instead of this energy bs",
        "thumbs_up_count":1,
        "title":null,
        "id":94,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Energy System Limits"
    },
    {
        "date":"2025-12-12 12:47:15",
        "rating":5,
        "review_text":"it's really good. helpful for learning other languages and it feels like I'm playing a game. it makes hard languages feel like easy to learn. but there's some problems of sign in with e mail address. it's also fine. probably it happened with me twice. the XP issue is also a little bit of problem. although I'm satisfied!",
        "thumbs_up_count":1,
        "title":null,
        "id":95,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-12-12 10:19:02",
        "rating":1,
        "review_text":"After several years usage, I'm uninstalling today. The new content is poor, the bugs are getting more frequent and the user experience keeps deteriorating.",
        "thumbs_up_count":1,
        "title":null,
        "id":96,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Bugs\/Technical Issues"
    },
    {
        "date":"2025-12-12 10:07:18",
        "rating":1,
        "review_text":"Revised: After firing all the humans, their AI can't do simple math, continuously ruining the experience. A decent free supplemental language app. Certainly not something you should pay for. Continually gets worse with constantly more problems now that there's no way to report the constant errors. They should have paid humans to pretend to care, instead they have cheap broken computers that don't. Still, for free, an okay supplement so long as you use many other better tools also. Do not trust.",
        "thumbs_up_count":1,
        "title":null,
        "id":97,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"AI Accuracy"
    },
    {
        "date":"2025-12-12 07:36:04",
        "rating":5,
        "review_text":"Have been using Duolingo for years and they have improved a lot! the features, the way they teach language through conversation that provide us opportunities to practice and the syllabus is more comprehensive than it is. Can't wait to start my next lesson!",
        "thumbs_up_count":1,
        "title":null,
        "id":98,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-12-12 05:56:38",
        "rating":1,
        "review_text":"Too competitive. I ruined my sleep schedule trying to stay at the top of Gold League. The exp boosts should not apply immediately. I feel forced to continue using the app so I don't waste the xp boost or lose my place in league. Tried to emotionally manipulate users after AI backlash by making the Duo icon cry. Cry harder!",
        "thumbs_up_count":1,
        "title":null,
        "id":99,
        "theme":"User Experience Issues",
        "sentiment":"Negative",
        "tag":"Confusing UI\/Features"
    },
    {
        "date":"2025-12-12 04:59:12",
        "rating":1,
        "review_text":"The health bar on the idioms lesson will not turn all gold even after I do all 17 questions correctly also this app has been glitching the chess in particular",
        "thumbs_up_count":1,
        "title":null,
        "id":100,
        "theme":"App Bugs & Glitches",
        "sentiment":"Negative",
        "tag":"Content\/Lesson Error"
    }
]