[
    {
        "date":"2025-11-10 00:51:34",
        "rating":1,
        "review_text":"still terrible. They now spoil every race showing the podium as the title screen for the race. Imbeciles. Changing the view to a specific driver causes the stream to reset to zero, and my mostly fail to show the driver cam (like verstappen today - silverstone). so amateurish for the price, not worth it.",
        "thumbs_up_count":65,
        "title":null,
        "id":1,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Race Spoilers"
    },
    {
        "date":"2025-10-14 15:22:47",
        "rating":1,
        "review_text":"newest version is less intuitive. now when I navigate away from the app - for a call, message, photo, etc. I can't just reopen and continue where I was - it restarts the app and starts at the main screen and I have to find what I was watching and hope it restarts where I left off (it usually doesn't). even a \"recently watched\" tab would be helpful. still no PiP function for >$100\/year. this will be my last year paying",
        "thumbs_up_count":48,
        "title":null,
        "id":2,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Session Resume Failure"
    },
    {
        "date":"2025-09-22 13:31:30",
        "rating":4,
        "review_text":"Great app with one big wish. I love the F1TV app—great coverage, access to practice sessions, and all the behind-the-scenes content. My only wish is to have a “No Spoiler Mode” or an option to turn off auto-play. Sometimes I’m catching up on practice or qualifying and the app jumps straight into the race replay, which ruins the suspense. Other than that, the app is excellent and a must-have for F1 fans. Add a spoiler-free mode, and it’s an easy 5 stars!",
        "thumbs_up_count":34,
        "title":null,
        "id":3,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Positive",
        "tag":"Race Spoilers"
    },
    {
        "date":"2025-10-15 00:30:11",
        "rating":5,
        "review_text":"The app works great on my phone and on my Roku stick. With that out there, the layout and programming choices are not good at all. There is no guide with times to upcoming races,FP's or quali. Most of the bonus stuff like support races is only available live, it's not archived and the absolute worst is having to change streams from pre race, to race, to post race. Seriously? We know Liberty Media are greedy F'ers but that is just lazy. It's 2025, do better.",
        "thumbs_up_count":29,
        "title":null,
        "id":4,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Clunky Navigation\/UI"
    },
    {
        "date":"2025-09-20 12:37:00",
        "rating":1,
        "review_text":"no option to select video playback quality which was there previously. my wifi is capable of 4k playback but f1tv is not even able to do 1080p for baku qualifying. why do remove the useful things. with all the technology f1 has, it can't produce a decent app for it's fans. disappointing!",
        "thumbs_up_count":27,
        "title":null,
        "id":5,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Video Quality"
    },
    {
        "date":"2025-11-08 14:44:39",
        "rating":1,
        "review_text":"Great idea and app when it works. But super laggy and worst app to watch F1 on a smart TV. Only streaming app that constantly and consistently lags and buffers during live coverage. Almost useless like this. Cannot understand that they cannot fix this.",
        "thumbs_up_count":23,
        "title":null,
        "id":6,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Lag and Buffering"
    },
    {
        "date":"2025-10-11 22:33:14",
        "rating":5,
        "review_text":"Great app. easy to use and can watch any of the practice, qualifying, or race coverage when u want. It also has a substantial amount of the race footage from prior years so if you are new or want to see some of the great races from the past, they are there.",
        "thumbs_up_count":21,
        "title":null,
        "id":7,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-26 19:30:15",
        "rating":3,
        "review_text":"Consistently getting less while being charged more. Became a fan because of Netflix, paid for a premium experience at a premium price and it was AWESOME, then you charged me more and gave me less. now you're selling out to Apple TV. It's little exclusive deals like this that make it harder and harder for me to see what I want to see and is why I don't watch Indy anymore. If next year sucks with apple, I'm out. Greed ruins the customer experience.",
        "thumbs_up_count":18,
        "title":null,
        "id":8,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Increased Cost"
    },
    {
        "date":"2025-11-22 21:49:13",
        "rating":1,
        "review_text":"\"F1 TV PREMIUM is available for purchase on your android device, but F1 TV PREMIUM features are not yet available on Android or web browsers other than Chrome\". This is the only meaningfull part of the apps description if your going to do exactly what an app put on the Google play store should do, WORK ON ANDROID! What an absolute joke how long this has even been a thing , especially coming from F1 who puts so much into RND! They should be embarrassed. \"if it dont make dollars it dont make cents\"",
        "thumbs_up_count":16,
        "title":null,
        "id":9,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 19:21:45",
        "rating":1,
        "review_text":"Seeking is broken, watch from start will instead play live, bugs like this gave plagued this app for years. certainly not as high tech as you might expect for the cost of a subscription.",
        "thumbs_up_count":12,
        "title":null,
        "id":10,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Playback\/Seeking Errors"
    },
    {
        "date":"2025-09-21 13:54:10",
        "rating":1,
        "review_text":"this sucks! I have had F1tv on my Chromebook for awhile now. I don't always need it because we watch on our TV at home BUT sometimes when we travel or I am farm sitting I watch on my Chromebook while my husband watches at home. NOW it isn't available for Chromebook!!! PLEASE fix it! Chromebooks are tablets too. Not a happy day, no F1 race phone dates for us.",
        "thumbs_up_count":11,
        "title":null,
        "id":11,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-26 09:42:32",
        "rating":1,
        "review_text":"Keep getting kicked out of the stream. Multiple race weekends in a row I've tried to log out all devices. Does not help. On my phone it does not give any warnings, chromecast just stops as well, laptop says too many devices (even though only one is logged in). This app goed from one problem to the next. It's absolute garbage.",
        "thumbs_up_count":11,
        "title":null,
        "id":12,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Device Stream Limits"
    },
    {
        "date":"2025-10-18 05:40:56",
        "rating":1,
        "review_text":"Absolute nonsense to force paying customers to use another service in the future. I paid for F1 TV because I only want F1 coverage, not all of the trash that is AppleTV, no matter how much money Apple paid for it. Garbage move that will kill F1 for me.",
        "thumbs_up_count":3,
        "title":null,
        "id":13,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Forced Subscription"
    },
    {
        "date":"2025-11-08 15:27:33",
        "rating":1,
        "review_text":"4k playback option gone after update only hd available even though i have tcl miniled 4k tv and the premium subscription",
        "thumbs_up_count":3,
        "title":null,
        "id":14,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Video Quality"
    },
    {
        "date":"2025-11-23 03:13:00",
        "rating":1,
        "review_text":"UPDATE (2025)- The Roku app volume control absolutely sucks on this app throughout the 2025 F1 season, randomly spiking 50-70% higher at unexpected times and no quick resolution. You would think that for the amount that they charge to hundreds of thousands of subscribers, they would have hired based on competency.",
        "thumbs_up_count":3,
        "title":null,
        "id":15,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-04 07:31:01",
        "rating":1,
        "review_text":"Paying so much money per year and having such a bad app is a disgrace. Streaming has a delay and sometimes it doesn't even start playing. So when I'm out I can't watch the race. Happening on multiple androids so it's really time to fix this issue! Oh, and you should make an app for PlayStation to stream on there (just a thought).",
        "thumbs_up_count":2,
        "title":null,
        "id":16,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"App Crash \/ Failure"
    },
    {
        "date":"2025-10-18 08:27:19",
        "rating":1,
        "review_text":"Despite having a payed subscription, there is no schedule for upcoming F1 broadcasts!! Addition months later - still no schedule",
        "thumbs_up_count":2,
        "title":null,
        "id":17,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Clunky Navigation\/UI"
    },
    {
        "date":"2025-10-26 22:11:34",
        "rating":1,
        "review_text":"Very buggy, for being a sports app the last thing you need is constant crashes, links that don't work. Every time I use the app there's a new bug which means I go back and forth until it starts working. Honestly for the price only worth it because they have a monopoly, I hope Apple tv rights come to where I live and I can use their service instead, I've dealt with this terrible experience for too long.",
        "thumbs_up_count":2,
        "title":null,
        "id":18,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-08 18:02:05",
        "rating":1,
        "review_text":"It’s literally impossible for me to upgrade my account so I can watch previously recorded practice, qualifying, etc. I’m ready to cancel",
        "thumbs_up_count":2,
        "title":null,
        "id":19,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Subscription Upgrade Blocked"
    },
    {
        "date":"2025-09-21 14:47:35",
        "rating":3,
        "review_text":"I often run into these issues: 1) changing broadcast sources should not be tied directly to the first press of the google tv remote center button, as the same action is reserved for video stop\/start on other apps. 2) when selecting a live stream, but choosing to watch from the beginning, the video will freeze and\/or skip ahead to the live action.",
        "thumbs_up_count":1,
        "title":null,
        "id":20,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Playback\/Seeking Errors"
    },
    {
        "date":"2025-10-17 17:09:43",
        "rating":1,
        "review_text":"Says I have too many devices, wont let me login. You should be blocking the streaming instead of the logins.... But this app will become useless after December. F1 is going to be an AppleTV exclusive! i'm sure McLaren sponsor Google is thrilled!",
        "thumbs_up_count":1,
        "title":null,
        "id":21,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Service Useless"
    },
    {
        "date":"2025-10-18 21:57:19",
        "rating":1,
        "review_text":"PLEASE FIX THE CAST MODE. WHEN I PLAY \"WATCH FROM START\" IT MEANS I WANT TO WATCH FROM START NOT LIVE! HOW HARD IS THAT LITERALLY EVERY APP IS ABLE TO DO IT BUT YOU!",
        "thumbs_up_count":1,
        "title":null,
        "id":22,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Playback\/Seeking Errors"
    },
    {
        "date":"2025-10-19 19:51:46",
        "rating":1,
        "review_text":"Videos cast from the F1 app to my TV fine. After paying for the subscription, the live race video is stuck in the \"connecting to TV\" message loop. Nobody responds to chat support either.",
        "thumbs_up_count":1,
        "title":null,
        "id":23,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Casting Issues"
    },
    {
        "date":"2025-10-20 14:23:03",
        "rating":2,
        "review_text":"This app is frustrating. The TV app and the phone app don't work together. If you watch some of a race on your phone and get home and want to resume from where you were on your TV, you can't - start over. Often, from the TV app you click on the \"resume show,\" and it starts the show over, which is annoying. Locating the various shows like \"post race show\" sometimes is difficult. It makes you hunt for it. I do like how the races are later organized on the app, that is nice. No adds - great!",
        "thumbs_up_count":1,
        "title":null,
        "id":24,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Session Resume Failure"
    },
    {
        "date":"2025-10-26 00:49:58",
        "rating":1,
        "review_text":"Dog butt app. for how much money F1 rakes in every single year they should be able to afford a better app. you can't even cast the footage, live or playback, onto a smart TV. there isn't a button for casting. plain and simple.",
        "thumbs_up_count":1,
        "title":null,
        "id":25,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-26 13:36:49",
        "rating":5,
        "review_text":"love this app it is by far my favorite way to watch F1 with great shows and documentaries and all of the races from the past they have in the archives is just wonderful",
        "thumbs_up_count":1,
        "title":null,
        "id":26,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-26 22:05:14",
        "rating":2,
        "review_text":"I experience a lot of issues with casting (chromecast) while internet and wifi are no issues. It needs a lot of buffering. Forced to watch through my laptop these days.",
        "thumbs_up_count":1,
        "title":null,
        "id":27,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Casting Issues"
    },
    {
        "date":"2025-11-12 17:18:45",
        "rating":1,
        "review_text":"It's 2025 and this app is still garbage. Constant video playback errors and network errors. To fix you have to force close the app, turn airplane mode on and back off, re-open the app, find the race, and skip forward to where you were in the race as it doesn't remember where you left off.",
        "thumbs_up_count":1,
        "title":null,
        "id":28,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"App Crash \/ Failure"
    },
    {
        "date":"2025-11-20 23:56:03",
        "rating":1,
        "review_text":"App forced an update on me yesterday. Haven't been able to watch a single thing since. Tried across multiple devices, different times of day, wifi, data etc. Nothing works. Very annoying as we go into the start of a triple header and I'm stuck watching delayed, abbreviated content with ads on YouTube. Subscription will be canceled if it doesn't come right this weekend.",
        "thumbs_up_count":1,
        "title":null,
        "id":29,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"App Crash \/ Failure"
    },
    {
        "date":"2025-11-21 18:33:33",
        "rating":4,
        "review_text":"Was a fan until I found out I wont be able to use the app when the deal with Apple starts. Looks like I will be taking at least a 5 year break.",
        "thumbs_up_count":1,
        "title":null,
        "id":30,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Service Useless"
    },
    {
        "date":"2025-11-23 05:49:34",
        "rating":1,
        "review_text":"It was ok, but the last update has stuffed it. Constantly hangs and now has buffing issues. 23 Nov 2025: Still the same click rubbish asks \"Watch live\" or \"Watch from start\" so you click \"Watch from start\" and what does it do starts live every time and now I have seen the results ...",
        "thumbs_up_count":1,
        "title":null,
        "id":31,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Lag and Buffering"
    },
    {
        "date":"2025-11-23 12:09:36",
        "rating":3,
        "review_text":"Well, it's paid for, so the content that it provides is definitely premium. However, there are way too many areas for improvement. On mobile, switching between live and driver cams, starts you from the beginning of the video. You cannot listen to it in the background as there's no option to play in the background.",
        "thumbs_up_count":1,
        "title":null,
        "id":32,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Playback\/Seeking Errors"
    },
    {
        "date":"2025-11-24 11:57:08",
        "rating":1,
        "review_text":"fix your app. After the last update nothing runs smoothly. lagging, glitchy, kicked out mid race. love the sport and everything around it but not the tv app",
        "thumbs_up_count":1,
        "title":null,
        "id":33,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"App Crash \/ Failure"
    },
    {
        "date":"2025-11-24 12:14:04",
        "rating":2,
        "review_text":"if you want to watch drivers girlfriends live.. commentators are good app is good. issue is witg tv director missing all the action cutting to girlfriends and celebrities. no paying customers want that most recent race missed all the action including Lando slowing down and albon front wing in the pit. fire the tv race director or give a live channel without the BS",
        "thumbs_up_count":1,
        "title":null,
        "id":34,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-24 18:47:35",
        "rating":3,
        "review_text":"Don't fall for the 4K option they can only broadcast at 1080p. I should have known this beforehand because 4K broadcasting isnt widespread yet. Don't make the same mistake.",
        "thumbs_up_count":1,
        "title":null,
        "id":35,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Video Quality"
    },
    {
        "date":"2025-11-29 13:39:09",
        "rating":1,
        "review_text":"doesn't always stream. trying to watch the race in 30 or any other videos and it just doesn't load. can't watch pre or post race shows on mobile app",
        "thumbs_up_count":1,
        "title":null,
        "id":36,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"App Crash \/ Failure"
    },
    {
        "date":"2025-11-29 15:45:40",
        "rating":4,
        "review_text":"when doing casting, you cannot switch views until you stop it. Other than that, is okay",
        "thumbs_up_count":1,
        "title":null,
        "id":37,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Casting & Stream Switching"
    },
    {
        "date":"2025-09-19 14:06:50",
        "rating":1,
        "review_text":"I subscribe to the F1 TV and now that my payment method has changed and the subscription has been paid I can not access content on F1 TV, so I try and subscribe again and I can't because I have already subscribed. So tell me how on earth do I watch the F1? It has been over a week now trying to resolve this matter via email, but yet the problem persists. Case Reference: 02064058",
        "thumbs_up_count":0,
        "title":null,
        "id":38,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Payment Status Mismatch"
    },
    {
        "date":"2025-09-19 17:49:54",
        "rating":4,
        "review_text":"Very good application. Just two features I think are needed: 1. Skip button needs to be configurable, something like (10 sec, 30 sec, 1 min, 5 min, 15 min) 2. Capability to download races and watch them offline",
        "thumbs_up_count":0,
        "title":null,
        "id":39,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-09-20 11:51:06",
        "rating":2,
        "review_text":"Great app but this update buffers awfully no matter what I do. Very distracting, VERY disappointing. The app sign in constantly fails to let me back into my paid subscription. Clearing caches, background apps, etc etc doesn't help at all. Uninstalling and reinstalling is a large pain in the *** too and still didn't help. This is far too expensive to be this frustrating. And BTW, if I choose the video quality level that I want I probably want THAT (and not Auto), right? So just leave it then!",
        "thumbs_up_count":0,
        "title":null,
        "id":40,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Lag and Buffering"
    },
    {
        "date":"2025-09-20 19:14:30",
        "rating":1,
        "review_text":"Infuriatingly horrible user interface. I dare anyone who's familiar with Netflix, Hulu, Amazon prime or any other streaming video app to try pausing and then restartimg playback without screaming and wanting to tear their hair out. Any good features of this app are far and away outweighed by the horrible UI.",
        "thumbs_up_count":0,
        "title":null,
        "id":41,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Clunky Navigation\/UI"
    },
    {
        "date":"2025-09-21 00:47:41",
        "rating":5,
        "review_text":"The app is amazing on my phone and on my roku and smart tvs at home, but the interface on my Chromebook went to s#!£ a few months ago with the last \"update\". That not withstanding, I couldn't live without it! The love is real!",
        "thumbs_up_count":0,
        "title":null,
        "id":42,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Positive",
        "tag":"Clunky Navigation\/UI"
    },
    {
        "date":"2025-09-21 21:03:56",
        "rating":1,
        "review_text":"Completely rubbish, app advertises within itself if you pay for the subscription you get live timing, I paid for the subscription and no live timing at all, waste of time, waste of money, false advertising, what more can I say?",
        "thumbs_up_count":0,
        "title":null,
        "id":43,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Missing Expected Content"
    },
    {
        "date":"2025-09-22 08:02:01",
        "rating":4,
        "review_text":"A little hard to navigate as the layout does not seem intuitive to me. But I love having the races streamed and the alerts and other extras. I think it is a great value if you are a fan.",
        "thumbs_up_count":0,
        "title":null,
        "id":44,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Positive",
        "tag":"Clunky Navigation\/UI"
    },
    {
        "date":"2025-10-05 13:01:26",
        "rating":1,
        "review_text":"Only streaming app on my systems that keeps on lagging and buffering. When it works, it's brilliant. But its annoying that this app constantly lags. And no, its not my connection\/cache\/etc... edit: getting worse instead of better.",
        "thumbs_up_count":0,
        "title":null,
        "id":45,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Lag and Buffering"
    },
    {
        "date":"2025-10-05 14:01:08",
        "rating":4,
        "review_text":"overall fine but there are parts that can be inproved. not sure if there is a difference between the android app and the fire tv app, but the app for fire it's difficult to switch to intl broadcast. sometimes it works but always restarts the race or it's muted. takes multiple tries.",
        "thumbs_up_count":0,
        "title":null,
        "id":46,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Casting & Stream Switching"
    },
    {
        "date":"2025-10-05 15:41:38",
        "rating":1,
        "review_text":"Worst playback functionality for any streaming app I have ever used. When you want to start from the beginning of the race when it is live it will jump to the live point and spoil the start. Constant lag, no TV app availability. Fingers crossed Apple will secure rights and I can leave this app in the bin where it belongs.",
        "thumbs_up_count":0,
        "title":null,
        "id":47,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Playback\/Seeking Errors"
    },
    {
        "date":"2025-10-12 09:19:36",
        "rating":1,
        "review_text":"Terrible app. Always a hassle signing in. I have to input a wrong password first then the right one next for it to work. Then when you manage to sign in and want to use the app as expected, guess what? It asks you to sign in AGAIN. How am I on the app and still getting asked to do that?????????????",
        "thumbs_up_count":0,
        "title":null,
        "id":48,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Login\/Access Issues"
    },
    {
        "date":"2025-10-14 21:05:54",
        "rating":3,
        "review_text":"How does F1 not have the full races for all televised races? For example the early 2000s are missing most races, how does that make sense? It's your I.P., just upload it, its not that hard, surely.",
        "thumbs_up_count":0,
        "title":null,
        "id":49,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-16 20:47:21",
        "rating":3,
        "review_text":"Needs window in window viewing, stop autoplaying videos, will go from practice 3 to race in 30 (spoiler alert), stop putting revealing pictures as thumbnails to the videos showing results",
        "thumbs_up_count":0,
        "title":null,
        "id":50,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Race Spoilers"
    },
    {
        "date":"2025-10-17 17:06:42",
        "rating":1,
        "review_text":"they just announced that people can only watch F1 live in the US on appletv only, so this app.is useless now. and im not buying an entire streaming service for the last 5 races.",
        "thumbs_up_count":0,
        "title":null,
        "id":51,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Service Useless"
    },
    {
        "date":"2025-10-17 17:22:21",
        "rating":1,
        "review_text":"Requiring Apple TV in the future is ridiculous. The whole point of F1 streaming service is not having to be bundled with cable or any other subscription we are not interested in. This move is extremely disappointing.",
        "thumbs_up_count":0,
        "title":null,
        "id":52,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Forced Subscription"
    },
    {
        "date":"2025-10-17 17:40:07",
        "rating":1,
        "review_text":"F1TV was great, but be warned prices will go up as they have a contract for 2026-2031 with AppleTV for users in thr US. You will now need to subscribe to Appletv which is significantly more expensive and will probably feature ads.",
        "thumbs_up_count":0,
        "title":null,
        "id":53,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Increased Cost"
    },
    {
        "date":"2025-10-17 18:10:36",
        "rating":1,
        "review_text":"i am suscribed. i just payed i checked my bank acount and all and it still says i am not subscribed, i attempted all troubleshoots, sign in sign out, install uninstall and restoring purchase.",
        "thumbs_up_count":0,
        "title":null,
        "id":54,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Payment Status Mismatch"
    },
    {
        "date":"2025-10-17 20:20:02",
        "rating":1,
        "review_text":"Edit. F1 doesn't accept any form of payment from the Discover merchant network, this is what my bank account debit card is in, so it made it inconvenient to make payments - Strike 1, and now, starting with next year's season, you're only streaming through Apple TV in the US - hint: not everyone in the US uses Apple.... Strike 2. Not trying for Strike 3, you're done. I sincerely hope you keep growing, but you just alienated me.",
        "thumbs_up_count":0,
        "title":null,
        "id":55,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Platform Exclusion"
    },
    {
        "date":"2025-10-17 23:21:05",
        "rating":2,
        "review_text":"Making us buy a subscription to Apple TV to watch the racing next year is a joke. very bad decision.",
        "thumbs_up_count":0,
        "title":null,
        "id":56,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Forced Subscription"
    },
    {
        "date":"2025-10-18 00:36:53",
        "rating":1,
        "review_text":"Well, guess everyone on android is dropping F1 since they decided to go exclusive to Apple TV. Way to cut off half your user base.",
        "thumbs_up_count":0,
        "title":null,
        "id":57,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Platform Exclusion"
    },
    {
        "date":"2025-10-18 09:48:40",
        "rating":5,
        "review_text":"I love the highlights and Tech Talks, as they give me an insight as to what effort goes into designing these speed monsters. And being a scientist at heart, that is very satisfying. I only use the basic F1 subscription. Robert.",
        "thumbs_up_count":0,
        "title":null,
        "id":58,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-18 17:59:20",
        "rating":3,
        "review_text":"I really love the app but regardless of how good my network is, this app buffers just for the f**** sake of buffering. I can not watch anything in HD. Always 640p but still buffers. I will rather use these free apps that offer only 640p or 480p but run smoothly. No more subscription.",
        "thumbs_up_count":0,
        "title":null,
        "id":59,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Lag and Buffering"
    },
    {
        "date":"2025-10-19 07:26:26",
        "rating":3,
        "review_text":"it's good but it takes a LONGGG TIME to register your subscription even on the same device you bought your subscription on , personally it took me an hour to find my subscription and In that hour I had to open and close and log out and log back in twice just so that it could register my subscription on all my devices",
        "thumbs_up_count":0,
        "title":null,
        "id":60,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Payment Status Mismatch"
    },
    {
        "date":"2025-10-19 17:40:09",
        "rating":1,
        "review_text":"App is all but useless recently. Gets stuck on opening screen and cannot be fixed by wiping cache\/data or uninstall\/reinstall.",
        "thumbs_up_count":0,
        "title":null,
        "id":61,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-19 19:09:29",
        "rating":1,
        "review_text":"Horrible, won't even let me sign into my account through the app. Tried to use the web browser and was told it was not supported and that I had to use the app. I'm paying and can't even use it. Please fix so I can use my subscription.",
        "thumbs_up_count":0,
        "title":null,
        "id":62,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Login\/Access Issues"
    },
    {
        "date":"2025-10-19 20:10:43",
        "rating":1,
        "review_text":"very hard to get what you want , only gives me the lowest subscription option won't let me upgrade to pro TV, so basically useless, don't bother to download as you'll be disappointed.",
        "thumbs_up_count":0,
        "title":null,
        "id":63,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Subscription Upgrade Blocked"
    },
    {
        "date":"2025-10-19 20:41:19",
        "rating":1,
        "review_text":"Paid 2 years of f1tv. Some days it was so awful I couldn't watch anything, live or from the start. The app should not have all this problems when you pay so much",
        "thumbs_up_count":0,
        "title":null,
        "id":64,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"App Crash \/ Failure"
    },
    {
        "date":"2025-10-19 21:21:15",
        "rating":1,
        "review_text":"the worst app ever, very expensive and rarely works properly. it blocks streaming, does not cast on TV, when you click on watch from start it shows you the live feed which always spoils the result. I don't think I will resubscribe. very disappointed",
        "thumbs_up_count":0,
        "title":null,
        "id":65,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Casting & Stream Switching"
    },
    {
        "date":"2025-10-19 21:29:55",
        "rating":3,
        "review_text":"when it works its great problem is when it decides it doesn't want to there's all sort of glitches god forbid you're trying to cast it to your TV when that happens",
        "thumbs_up_count":0,
        "title":null,
        "id":66,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Casting Issues"
    },
    {
        "date":"2025-10-19 22:41:09",
        "rating":1,
        "review_text":"This app was disappointing five years ago and, unfortunately, it still hasn’t improved much. Still no 4K support, and I can’t use international commentary when casting or using AirPlay. The interface remains clunky and unintuitive. Really expected better from an app at this level.",
        "thumbs_up_count":0,
        "title":null,
        "id":67,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Casting & Stream Switching"
    },
    {
        "date":"2025-10-21 20:36:19",
        "rating":1,
        "review_text":"absolute horrible choice to go to apple. I dont use apple products. I logged into the apptv app with a friend's account and it doesn't even show f1 as a possibility. so you would have to buy new hardware. please prorate me back for 2026 as I will not be able to finish the season.",
        "thumbs_up_count":0,
        "title":null,
        "id":68,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Platform Exclusion"
    },
    {
        "date":"2025-10-22 17:29:46",
        "rating":1,
        "review_text":"I can't figure out how to watch past races, which should be one of the main features of the app. The amount of social media BS that is in the way is baffling.",
        "thumbs_up_count":0,
        "title":null,
        "id":69,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Clunky Navigation\/UI"
    },
    {
        "date":"2025-10-22 18:09:27",
        "rating":1,
        "review_text":"very glitchy for the 2025 season. hate the fact that f1 is trying to force me to get apple tv. Guess ill just have to pirate stream the races now. If they don't want my money I won't give it them.",
        "thumbs_up_count":0,
        "title":null,
        "id":70,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Forced Subscription"
    },
    {
        "date":"2025-10-24 18:53:40",
        "rating":1,
        "review_text":"its a great app, but I log in and it works, but after every time I exit the app and cone back, I have to do it all over again and it says I am locked out of my account please fix this or I'll stop paying 100 dollars each year for it thank you for understanding and fixing your app",
        "thumbs_up_count":0,
        "title":null,
        "id":71,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Login\/Access Issues"
    },
    {
        "date":"2025-10-24 20:00:44",
        "rating":1,
        "review_text":"wow the app is like starting up a old car 10 boots to get it going. then when it's up and running you have to listen to those idiots who actually have no idea. remove the commentary and drop the price you will get 5 stars",
        "thumbs_up_count":0,
        "title":null,
        "id":72,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-25 21:16:41",
        "rating":1,
        "review_text":"Doesn't crash as much as it used too and video stream is much more stable then years past. International feed and audio no longer work right on any devices othen then PC I can still get the international audio on PC but not feed. So it's one star for me.",
        "thumbs_up_count":0,
        "title":null,
        "id":73,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Casting & Stream Switching"
    },
    {
        "date":"2025-10-26 07:01:00",
        "rating":1,
        "review_text":"Keeps crashing when you try to fast forward, every time you open it, you are welcomed by a new surprise bug.",
        "thumbs_up_count":0,
        "title":null,
        "id":74,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-26 20:22:01",
        "rating":1,
        "review_text":"Worse app I ever tried to use. Got o watch the F1, it then only shows option to buy the timing screen subscription. Tried to upgrade to get the actual F1 live and would just freeze and do nothing. Doesn't even pop up on in app where I can watch the timing screen etc that I've paid for.",
        "thumbs_up_count":0,
        "title":null,
        "id":75,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Subscription Upgrade Blocked"
    },
    {
        "date":"2025-10-26 21:55:08",
        "rating":1,
        "review_text":"I can't watch full HD content without the video and audio glitching while I can do that without problems on other streaming apps",
        "thumbs_up_count":0,
        "title":null,
        "id":76,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Video Quality"
    },
    {
        "date":"2025-10-26 22:50:11",
        "rating":1,
        "review_text":"I don't like scripted sports. I will not be renewing my subscription because F1 lost all its credibility today in the Mexican grand prix with that no use VSC at the end which was designed to give Lando Norris the lead of the championship. This is not the WWE! I will not follow this scripted so-called sport anymore.",
        "thumbs_up_count":0,
        "title":null,
        "id":77,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-27 00:24:24",
        "rating":3,
        "review_text":"It's good to be able to watch old F1 footage after paying for F1 TV Access, but I think F1 underserve their customers with so much content on YouTube which isn't available to us. And after a GP the post race show isn't properly available.",
        "thumbs_up_count":0,
        "title":null,
        "id":78,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-31 08:09:51",
        "rating":1,
        "review_text":"Once again, you guys sell out all in the name of money to Apple tv, and now, because of that, when Apple TV takes over, I will be canceling my F1 subscription. it's greedy actions like this that eliminate the true fans of F1 like in my case since the mid-70s, so as soon as Apple TV takes over, you will be losing a lot of the true fan base money. SELL OUTS!",
        "thumbs_up_count":0,
        "title":null,
        "id":79,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Increased Cost"
    },
    {
        "date":"2025-11-08 14:41:14",
        "rating":2,
        "review_text":"The subscription plan is only for \"access\". If you want any actual event content - like the race itself - you have to pay more. They do not make this clear during the registration process.",
        "thumbs_up_count":0,
        "title":null,
        "id":80,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Missing Expected Content"
    },
    {
        "date":"2025-11-08 15:08:39",
        "rating":1,
        "review_text":"The F1 app is so bad it makes Ferrari's strategy look good. Straight up doesn't work sometimes, spoils race results almost every weekend in multiple ways, glitchy video controls. the menu and navigation are visually appalling and nonsenscial. It's shocking that a company with so much money can be so incompetent. Is Bernie still running the circus?",
        "thumbs_up_count":0,
        "title":null,
        "id":81,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Race Spoilers"
    },
    {
        "date":"2025-11-08 17:31:21",
        "rating":1,
        "review_text":"I paid money for this because I thought I would be able to watch something on there and so far I have not been able to watch anything except for recaps. Why would I pay money to watch recaps.",
        "thumbs_up_count":0,
        "title":null,
        "id":82,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Missing Expected Content"
    },
    {
        "date":"2025-11-08 21:47:09",
        "rating":3,
        "review_text":"I travel a lot on Sundays so I wish I could download the races after they are uploaded to watch on the plane. The app has gone better in years but I will still watch highlights on YouTube because of playback functionality. I often listen to races so being able to close my phone while it plays is very nice on YouTube. I have hope F1 app will keep getting better",
        "thumbs_up_count":0,
        "title":null,
        "id":83,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-09 17:41:15",
        "rating":1,
        "review_text":"When you attempt to login. it returns with your account does not exist. You then have to contact support who also can't find your account. It usually takes several days to get it fixed, while you're missing a race. Personally I don't see the sense of a subscription. You can't rely on it to work.",
        "thumbs_up_count":0,
        "title":null,
        "id":84,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Login\/Access Issues"
    },
    {
        "date":"2025-11-09 18:26:20",
        "rating":1,
        "review_text":"On Galaxy Folds, Multiview mode has a weird gap margin all around the screen. Have to switch Multiview mode off, in app settings, to get rid of those blank gaps. This sacrifices Multiview benefits. Please look into this issue.",
        "thumbs_up_count":0,
        "title":null,
        "id":85,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-09 21:39:23",
        "rating":1,
        "review_text":"For what am I playing for premium? Rubbish app in Galaxy Tab S11 Ultra tablet, each resize of the app errors the playback. I'm so annoyed. I don't even want to mention the missing 4k on Android apps and Chrome..",
        "thumbs_up_count":0,
        "title":null,
        "id":86,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Video Quality"
    },
    {
        "date":"2025-11-16 05:22:10",
        "rating":4,
        "review_text":"Decent app, decent viewing experience, can definitely be improved in ways to make it nicer to look at and use, but overall, it's not a bad experience.",
        "thumbs_up_count":0,
        "title":null,
        "id":87,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-17 14:51:16",
        "rating":1,
        "review_text":"Even on Premium subscription, 4K doesn't work on all models of Android\/Google TV or Chrome Browser on other devices, so be careful when you want to pay this type of subscription because you won't get the maximum resolution for your money.",
        "thumbs_up_count":0,
        "title":null,
        "id":88,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Video Quality"
    },
    {
        "date":"2025-11-21 01:37:53",
        "rating":4,
        "review_text":"great app , I would be great if the app is in sync on diverse devices. at times there is 30 to 80 seconds difference between android and roku .",
        "thumbs_up_count":0,
        "title":null,
        "id":89,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-21 04:40:42",
        "rating":1,
        "review_text":"I kept my app for long and now say thatvi have time many divece or that I need to upgrade 😠",
        "thumbs_up_count":0,
        "title":null,
        "id":90,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Device Stream Limits"
    },
    {
        "date":"2025-11-21 13:51:04",
        "rating":1,
        "review_text":"Greedy thieves. A while ago I got a baffling notification that after May 2026, I would need an Apple TV subscription to renew F1 TV (which would still require its own fee). I'm a long time F1 fan and I am appalled at what the sport has become, basically a way to squeeze every penny out of new fans brought by Drive to Survive. Getting tickets for races at face value has become nearly impossible. huhSo come next year, when my current subscription expires I'll say goodbye to this thing.",
        "thumbs_up_count":0,
        "title":null,
        "id":91,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Increased Cost"
    },
    {
        "date":"2025-11-21 18:12:06",
        "rating":1,
        "review_text":"Every few weeks, just before a race weekend, I get logged out of all devices and cannot access it, cannot reset password or anything, like my account just doesn't exist. support don't answer you until 3 days after the race weekend because they don't work on weekends.",
        "thumbs_up_count":0,
        "title":null,
        "id":92,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Login\/Access Issues"
    },
    {
        "date":"2025-11-22 00:26:14",
        "rating":1,
        "review_text":"Does not even allow me to watch practices. Then tells me that I need to upgrade my service. But then, will not allow me to upgrade my service. Absolutely the most useless app I have ever paid $ for... The only thing this allows me to do is watch replays of finished races.",
        "thumbs_up_count":0,
        "title":null,
        "id":93,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Subscription Upgrade Blocked"
    },
    {
        "date":"2025-11-22 00:58:56",
        "rating":1,
        "review_text":"The app tells me to go to the site to manage my subscription, the site tells me to go to the app. Frustrating.",
        "thumbs_up_count":0,
        "title":null,
        "id":94,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-22 04:43:59",
        "rating":1,
        "review_text":"I can't download the app to my tv. I can't stream from my phone to my tv. what is the point of streaming this service if I have to watch it on my tiny phone screen or on my pc. I like to watch the races with my family.",
        "thumbs_up_count":0,
        "title":null,
        "id":95,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-22 07:21:46",
        "rating":3,
        "review_text":"It spoils the results on the thumbnails every time before I can watch the race (I cannot watch it live). I want to watch without knowing the ending!!! And I want to see a simlple list of the videos, not that messy mashup of everything.",
        "thumbs_up_count":0,
        "title":null,
        "id":96,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Race Spoilers"
    },
    {
        "date":"2025-11-22 08:39:15",
        "rating":1,
        "review_text":"unable to use app without updating. requires updates very frequently. other than that, app itself is ok",
        "thumbs_up_count":0,
        "title":null,
        "id":97,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-22 14:04:04",
        "rating":3,
        "review_text":"The app works well in the Netherlands. I am now in Japan and can't see kwali\/race. back to go watch illegal. why illegal works works better and it is less expansive",
        "thumbs_up_count":0,
        "title":null,
        "id":98,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-23 00:54:26",
        "rating":1,
        "review_text":"paid for the highest monthly subscription 2 times and neither time did it work took the money both times tho not doing it a 3rd time",
        "thumbs_up_count":0,
        "title":null,
        "id":99,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Payment Status Mismatch"
    },
    {
        "date":"2025-11-23 03:54:14",
        "rating":1,
        "review_text":"Can't change to hear international broadcast, when I press for it nothing happens",
        "thumbs_up_count":0,
        "title":null,
        "id":100,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Casting & Stream Switching"
    },
    {
        "date":"2025-11-23 14:55:56",
        "rating":2,
        "review_text":"Downloaded this app and it's absolutely hopeless... The player doesn't remember where you were in the video, it constantly crashes or needs restarts, the only thing going for it is that it doesn't look horrendous. What a joke.",
        "thumbs_up_count":0,
        "title":null,
        "id":101,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Session Resume Failure"
    },
    {
        "date":"2025-11-24 07:28:46",
        "rating":1,
        "review_text":"logged in to watch the race this weekend and it kept bugging. asked me to login. when I logged in, it showed my profile. but when I clicked on any video to play, it just went back to the login page. still happening. unable to watch any video as it keeps redirecting to login page even after I login.",
        "thumbs_up_count":0,
        "title":null,
        "id":102,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Login\/Access Issues"
    },
    {
        "date":"2025-11-25 03:16:25",
        "rating":1,
        "review_text":"Can't cast onto chrome cast. Now, it is no longer just a subscription to F1 races. You need to sign up for apple tv if you don't have one of those. I do not have an apple tv subscription. In a world where everything is going subscription based these days I refuse to sign up for a new one for one i had already signed up for. Good luck formula one staff!",
        "thumbs_up_count":0,
        "title":null,
        "id":103,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Forced Subscription"
    },
    {
        "date":"2025-11-28 18:10:23",
        "rating":1,
        "review_text":"Horrible app. Always lags, so difficult to cast.",
        "thumbs_up_count":0,
        "title":null,
        "id":104,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Casting Issues"
    },
    {
        "date":"2025-11-28 19:24:02",
        "rating":5,
        "review_text":"Great way to keep up with the races on the move. Quality of the broadcast is excellent.",
        "thumbs_up_count":0,
        "title":null,
        "id":105,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 21:53:51",
        "rating":5,
        "review_text":"best app! now if it would only work on my samsung android tv, so I dont have to stream with cast to TV.",
        "thumbs_up_count":0,
        "title":null,
        "id":106,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 07:02:38",
        "rating":3,
        "review_text":"DRS indicator has not been working on Data page since forever and nobody cares from development team!",
        "thumbs_up_count":0,
        "title":null,
        "id":107,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 10:31:02",
        "rating":5,
        "review_text":"Superb App. The 4K broadcast is NOT compatible with Formuler Z11 Pro MAX.",
        "thumbs_up_count":0,
        "title":null,
        "id":108,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Positive",
        "tag":"Video Quality"
    },
    {
        "date":"2025-11-29 11:26:22",
        "rating":3,
        "review_text":"Hit a concurrent device limit. Not concurrent streams... concurrent installs on different devices.",
        "thumbs_up_count":0,
        "title":null,
        "id":109,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Device Stream Limits"
    },
    {
        "date":"2025-11-29 13:41:48",
        "rating":3,
        "review_text":"Too many small problems for an app that is as expensive as this. On certain devices it's not possible to change certain commentaries. Rarely remembers where i was exactly in a video, so i always have to guess where i was and causes sometimes for certain spoilers. Sometimes glitches when i press +\/- 10 sec to 30 minutes later or so, again, spoiling things. The quality is great though and enjoy all the details i get but these glitches have been here for years and should be fixed.",
        "thumbs_up_count":0,
        "title":null,
        "id":110,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Playback\/Seeking Errors"
    },
    {
        "date":"2025-11-29 13:46:39",
        "rating":3,
        "review_text":"It's ok. It works on my phone and tablet, but it DOES NOT WORK ON MY GOOGLE TV! it's a TV app that does not work on a TV... ridiculous!",
        "thumbs_up_count":0,
        "title":null,
        "id":111,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 14:20:50",
        "rating":1,
        "review_text":"Worst app update of the year. App sometimes get stuck on the ref F1 logo screen. and then on livestream it stops playing midway. at first I thought it was my internet but it wasn't. what's the point of paying for this service if I can't use it ON A FRIGGIN RACE DAY!!!!!",
        "thumbs_up_count":0,
        "title":null,
        "id":112,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"App Crash \/ Failure"
    },
    {
        "date":"2025-11-29 14:59:24",
        "rating":4,
        "review_text":"Great App Works Perfect but We Need Picture in Picture mode cause everytime you change to a message or something you have to start the stream over again which is annoying",
        "thumbs_up_count":0,
        "title":null,
        "id":113,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Session Resume Failure"
    },
    {
        "date":"2025-11-29 15:15:21",
        "rating":2,
        "review_text":"Driver On Boards are not working. Whenever I click on the driver's name, it just blinks and blinks and never switch to the on board camera.",
        "thumbs_up_count":0,
        "title":null,
        "id":114,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Casting & Stream Switching"
    },
    {
        "date":"2025-11-29 15:38:05",
        "rating":1,
        "review_text":"it's not working,it is loging all the time. I need to touch the phone screen every 30sec or it's glitching. and my internet speed is 800mbs",
        "thumbs_up_count":0,
        "title":null,
        "id":115,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Lag and Buffering"
    },
    {
        "date":"2025-11-29 15:47:27",
        "rating":3,
        "review_text":"The app is not that easy to navigate. I wanted chronological sorting of every video but I couldn't do it. The video also doesn't auto-orient when I rotate my phone when I need to charge it. We also need offline downloads to be available. Data is not cheap in this country. It still is more convenient to watch in YouTube.",
        "thumbs_up_count":0,
        "title":null,
        "id":116,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Clunky Navigation\/UI"
    },
    {
        "date":"2025-11-29 17:59:36",
        "rating":3,
        "review_text":"casting issues, buffering issues, random shut downs and they want double the money next year.",
        "thumbs_up_count":0,
        "title":null,
        "id":117,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Casting Issues"
    },
    {
        "date":"2025-11-29 18:29:34",
        "rating":1,
        "review_text":"A vibe coding 13 year old can pump out a better app in a few days. Every app can see a streaming device, f1 app only shows the device on random occasions. Press watch live, no option watch from start, BLAM podium ceremony in your face. no WebOS app, Android tv on mibox s is a lagfest and unwatchable. Closing app and restarting to see new content. casting sometimes give the option to set audio language but not always. The player interface is just zero effort, app looks like a PoC",
        "thumbs_up_count":0,
        "title":null,
        "id":118,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Playback\/Seeking Errors"
    },
    {
        "date":"2025-11-29 18:55:03",
        "rating":2,
        "review_text":"Does not work on amazon fire stick also cannot screen mirror to Amazon fire stick. And from what I'm being told, it's been since last year.\\n You have not been able to do this. Doesn't feel very premium when you can't watch the way you want to",
        "thumbs_up_count":0,
        "title":null,
        "id":119,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 19:16:49",
        "rating":2,
        "review_text":"Works well when you watch replays or watching live. The reason for 2 stars is the app will jump to LIVE when casting from tablet or phone, ruining the race\/qualifying when jumping in after the start of the session. This has been an ongoing issue and has not been fixed in the 4 years I have used the app.",
        "thumbs_up_count":0,
        "title":null,
        "id":120,
        "theme":"App Navigation & Spoilers",
        "sentiment":"Negative",
        "tag":"Casting & Stream Switching"
    },
    {
        "date":"2025-11-29 20:03:49",
        "rating":1,
        "review_text":"cant watch online race, can't see standing,its no point spent money from those, all the same you can see in YouTube!",
        "thumbs_up_count":0,
        "title":null,
        "id":121,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Missing Expected Content"
    },
    {
        "date":"2025-11-29 21:24:11",
        "rating":5,
        "review_text":"love it. so sad they are going to Apple TV. we need Sky in the US.",
        "thumbs_up_count":0,
        "title":null,
        "id":122,
        "theme":"Mandatory Apple TV Switch",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 00:00:57",
        "rating":2,
        "review_text":"App is Ok but not great. The streaming quality is very poor for a premium service. Constant buffering or quality degradation for both live and replay of sessions despite having a high speed internet connection. Can almost forgive this for live streaming but absolutely no reason this should occur for replay streams if designed well.",
        "thumbs_up_count":0,
        "title":null,
        "id":123,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Lag and Buffering"
    },
    {
        "date":"2025-11-30 13:42:38",
        "rating":1,
        "review_text":"it is so buggy. it looks and feels like an app developed in 2009 . crashes when I change screen orientation. crops hair the screen sometimes. has a mind of its own. with all the$$$ f1 is raking in one world think they'd put some thought into making an app that works",
        "thumbs_up_count":0,
        "title":null,
        "id":124,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 16:09:50",
        "rating":1,
        "review_text":"this app is garbage, especially when streaming to a chrome cast. you are lucky to watch 2 laps of live racing before the stream just freezing and doing nothing.",
        "thumbs_up_count":0,
        "title":null,
        "id":125,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Casting Issues"
    },
    {
        "date":"2025-11-30 16:46:46",
        "rating":1,
        "review_text":"Keep getting errors saying maximum number of streams used when I pay for the top package and I am the only one streaming on only one device. It only works for about 5 min at a time and then kicks me off. This has been happening all year and still isn't fixed. This app has never worked properly and has gotten way too expensive for the amount of errors it has.",
        "thumbs_up_count":0,
        "title":null,
        "id":126,
        "theme":"Login and Payment Problems",
        "sentiment":"Negative",
        "tag":"Device Stream Limits"
    },
    {
        "date":"2025-11-30 18:18:52",
        "rating":1,
        "review_text":"Extremely expensive and the app feels like it's in a beta stage. I guess that's one of the perks of a monopoly. Update: November 2025 - casting doesn't work for races but you can cast other content. I am ashamed of myself for paying for such an abhorrent service",
        "thumbs_up_count":0,
        "title":null,
        "id":127,
        "theme":"Streaming Lag & Buffering",
        "sentiment":"Negative",
        "tag":"Casting Issues"
    }
]