[
    {
        "date":"2025-09-23 13:52:47",
        "rating":5,
        "review_text":"I need to check the usefulness of this Aap but i appreciate this initiative from telecom department regarding digital security of citizens. I would like to suggest that more space is required for writing the text and provision to report more numbers together should be there. As these fraudsters always act in groups using multiple numbers to confuse and mislead a recipient, we need to enter more details. I was not able to explain the entire matter in one go.",
        "thumbs_up_count":1826,
        "title":null,
        "id":1,
        "theme":"App Bugs and Usability",
        "sentiment":"Positive",
        "tag":"Form\/Input Errors"
    },
    {
        "date":"2025-10-31 10:17:19",
        "rating":5,
        "review_text":"A great initiative by DoT to prevent online scam. Allows me to register complaints against suspected fraud calls\/text messages. It's also possible to know from the app how many numbers in my name are active, thereby enabling me to identify if someone has been using an illegal SIM in my name. The app also provide the facility of blocking the SIM of a lost phone. Just one suggestion, it will be better if the DoT mentions in the app, the status of any complaint registered against a suspected number",
        "thumbs_up_count":1025,
        "title":null,
        "id":2,
        "theme":"Lack of Complaint Status",
        "sentiment":"Positive",
        "tag":"Missing Status Updates"
    },
    {
        "date":"2025-09-22 14:14:39",
        "rating":4,
        "review_text":"nice app. but the blocking option of the lost device is not working properly. I lost my device so I registered my complaint here but when I found my device then I see that the person who stole my device used my phone after 15 days of the date whrn the device lost. and he used it something 5 month. I found my phone after 7 month and When I found It was locked. zo I confused if I locked it after 10 days when it lost then how can the person use my locked device. this app do not work properly.",
        "thumbs_up_count":869,
        "title":null,
        "id":3,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Negative",
        "tag":"Ineffective Blocking"
    },
    {
        "date":"2025-09-26 04:47:59",
        "rating":1,
        "review_text":"The app has a major design flaw. It still asks for verification using the same lost mobile number or asks to select it from the drop-down (mobile number 2), which is impractical and shows weak logic. A more user-friendly and reliable solution should be implemented. If the team ever wants to build a strong, well-designed app, feel free to contact me — I can deliver a far better product at much lower cost.",
        "thumbs_up_count":823,
        "title":null,
        "id":4,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Negative",
        "tag":"Stolen Number Requirement"
    },
    {
        "date":"2025-11-10 05:05:42",
        "rating":4,
        "review_text":"This is a great app, offering almost all the features of the CEIR web portal, plus many more. I lost my mobile phone a few days ago and registered it on Block Lost\/Stolen. I hope CEIR will help me find my phone.",
        "thumbs_up_count":513,
        "title":null,
        "id":5,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-09-21 09:56:25",
        "rating":5,
        "review_text":"Excellent initiative by the govt of India. Please allow to add minimum 25 numbers at one time. Secondly, this service only allows sms received but doesn't have option to notify where auto sms are gone from our number to unknown numbers. Also please allow to attach more images to notify few fraudulent activities in one complaint.",
        "thumbs_up_count":442,
        "title":null,
        "id":6,
        "theme":"App Bugs and Usability",
        "sentiment":"Positive",
        "tag":"Form\/Input Errors"
    },
    {
        "date":"2025-10-10 11:01:10",
        "rating":5,
        "review_text":"I have two contact numbers of my own, apart from that, five contact numbers were showing there.Even though I reacted by saying that God's timing was not my number,I still see in the app all the types of apps that are in my name.Even though I have taken the action, the number is still showing in my name. What should I do?",
        "thumbs_up_count":378,
        "title":null,
        "id":7,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Wrong Numbers Linked"
    },
    {
        "date":"2025-11-20 05:07:41",
        "rating":1,
        "review_text":"app not user friendly. While making complaint for lost\/stolen phone it is asking for the mobile number in the simwhich was used in the phone. How is possible? Person who has lost phone will definitely get a duplicate same number to avoid misuse by the other party. Another issue, if the original sim is of uae, there is no provision to mention the number. Thirdly, if any complained made with the nearby police station, the details are not accepted in the app, if it is more than 2 yrs....ganesh",
        "thumbs_up_count":356,
        "title":null,
        "id":8,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Negative",
        "tag":"Stolen Number Requirement"
    },
    {
        "date":"2025-11-18 06:22:05",
        "rating":1,
        "review_text":"I downloaded this after receiving the SMS \"Is someone misusing your name for a Mobile Connection? Check with this app\". This app registers the numbers used in my mobile and shows as registered number in my name. It should have adked Aadhaar number to do that check. The way in which this feature is implemented is really stupid. If you want to try this for this reason, I definitely don't recommend. I haven't used the complaint feature. My rating is based on above mentioned feature alone",
        "thumbs_up_count":236,
        "title":null,
        "id":9,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Flawed Feature Design"
    },
    {
        "date":"2025-09-16 07:15:01",
        "rating":5,
        "review_text":"The Sanchar Sathi app is very helpful in reducing anxiety from fraud and spam calls. It provides reliable caller identification and empowers users to report suspicious numbers. With its features, I feel more secure and protected, knowing I can avoid scams and safeguard my personal information with confidence. It is also easy to operate.",
        "thumbs_up_count":232,
        "title":null,
        "id":10,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-22 13:59:41",
        "rating":2,
        "review_text":"Through this app I have noticed that my original number was linked with other 4 numbers. So I raised a request in September 1st week to deactivate those numbers. Since it's been more than 45 days passed away still the numbers are under working condition and it's showing like status is pending. Please try to resolve my issue ASAP to protect my personal details from vulnerable data.",
        "thumbs_up_count":216,
        "title":null,
        "id":11,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Pending Deactivation Request"
    },
    {
        "date":"2025-09-14 07:50:26",
        "rating":5,
        "review_text":"A very helpful, user-friendly interface for reporting fraudulent calls and smses. Smooth to use and has always registered my complaints without any glitches.",
        "thumbs_up_count":193,
        "title":null,
        "id":12,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-09 18:31:44",
        "rating":4,
        "review_text":"This app help you for blocking stolen\/lost mobile.Recently I lost mobile but after registering complaint here,they tracked and helped me to get back my mobile. Finally I received my mobile from my nearest police station,where also I registered complaint.",
        "thumbs_up_count":191,
        "title":null,
        "id":13,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-09-14 02:14:54",
        "rating":1,
        "review_text":"As is the government, so is their app. I have a number which is not mine. I have registered it in \"not my number\" since 2 months. But no action has been taken in it till now. Every time it shows the same process \"work in progress\". It is promoted as if it would be a great app. But they have made a useless app.",
        "thumbs_up_count":172,
        "title":null,
        "id":14,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Pending Deactivation Request"
    },
    {
        "date":"2025-11-03 18:10:29",
        "rating":1,
        "review_text":"Worst App, No option to add or add second mobile. No option to search for another number which I may assume that it could be on my name. No use. if someone has Database access can create for better app than this. Even GUI is not up to the mark.",
        "thumbs_up_count":154,
        "title":null,
        "id":15,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"UI\/Usability"
    },
    {
        "date":"2025-09-17 18:35:58",
        "rating":1,
        "review_text":"Useless app It takes data from your phone as I don't connect with government portal, when I installed it, I was thinking that it will show all the SIM card Number which is active on my 🆔 id but it takes data from my phone and shows both the SIM card active in my phone. and there is no log out button in this application.",
        "thumbs_up_count":152,
        "title":null,
        "id":16,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Incomplete Data Display"
    },
    {
        "date":"2025-10-29 10:07:11",
        "rating":4,
        "review_text":"A nice app to see about what numbers are registered in my name. There was one number that I didn't even know about and I requested it to be removed from my name. Although it also listed my brother and mother's number on my name so that was a bit confusing.",
        "thumbs_up_count":133,
        "title":null,
        "id":17,
        "theme":"Wrong Number Linkage",
        "sentiment":"Positive",
        "tag":"Wrong Numbers Linked"
    },
    {
        "date":"2025-11-30 03:40:52",
        "rating":1,
        "review_text":"I have 2 sims in my name and both are active but when I checked using the feature \"know mobile connection on your name feature\" it showed me the single mob number which I used in the app. so this particular feature is actually useless",
        "thumbs_up_count":124,
        "title":null,
        "id":18,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Incomplete Data Display"
    },
    {
        "date":"2025-09-16 01:38:56",
        "rating":4,
        "review_text":"it's okay okay but need to test this application properly. there are some bugs like while reporting fraud or scam they are not accepting multiple files and photos. I hope they will fix this issue.",
        "thumbs_up_count":114,
        "title":null,
        "id":19,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"Form\/Input Errors"
    },
    {
        "date":"2025-11-10 11:07:39",
        "rating":2,
        "review_text":"App is not showing exactly registered numbers under the person's name even though, the data has already been given to SancharSathi. Is this app also suspicious or trustworthy? Already dropped feedback to the developer\/managing person about my concern. Earlier to the same app I had given 4 stars, but due to such issues giving them again not more than 2 stars. Work again to get back your reputation.",
        "thumbs_up_count":108,
        "title":null,
        "id":20,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Incomplete Data Display"
    },
    {
        "date":"2025-09-12 17:58:38",
        "rating":5,
        "review_text":"it is wonderful. I have submitted many many suspicious calls and messages received. I am satisfied that at least that few innocent people are saved from traps through this wonderful app.",
        "thumbs_up_count":106,
        "title":null,
        "id":21,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-26 02:22:28",
        "rating":3,
        "review_text":"The App should be able to receive and accept complaints any time. After 6 or 7 pm the app through error as invalid despite correct info provided. when I tried in the morning it works. scammers may invade any time, the app should take real-time complaints otherwise the very purpose is defeated.",
        "thumbs_up_count":102,
        "title":null,
        "id":22,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"App Bug\/Crash"
    },
    {
        "date":"2025-09-17 01:12:27",
        "rating":3,
        "review_text":"Doesn't do what it says it does. Got an SMS saying that this app tells you if there are other connections taken in your name. Installed, registered and then realised that it does so only if other people having taken such connections fraudulently in my name also register using this app with my name... basically this is that daroga that tells me only about the theives that walk into police station who confessed that they committed a crime. I don't know who thinks up of this beautiful use cases.",
        "thumbs_up_count":99,
        "title":null,
        "id":23,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Flawed Feature Design"
    },
    {
        "date":"2025-09-15 09:52:06",
        "rating":3,
        "review_text":"1) While filling in, the app crashes upon opening SMS window to view the details to be filled in this app, requiring to begin from the first input. Developers need to correct this crashing issue. Otherwise the app is a great utility. 2) If action taken on scamster can't be informed, the system must ensure, the same scamster gets blocked and not able to repeat the message.",
        "thumbs_up_count":96,
        "title":null,
        "id":24,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"App Bug\/Crash"
    },
    {
        "date":"2025-11-19 09:12:50",
        "rating":1,
        "review_text":"Intent is good, but usability is limited, and more complicated, should have been better if they had given option to deactivate those numbers and delete from list which are not in use or not needed anymore",
        "thumbs_up_count":96,
        "title":null,
        "id":25,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"UI\/Usability"
    },
    {
        "date":"2025-09-28 03:45:09",
        "rating":3,
        "review_text":"Please fix the validation issue in the complaint form. Many users like me may be unable to submit genuine complaints due to the name mismatch error. The app should allow users to input their names as per telecom records, or at least display clearer guidance on the correct format. Unless this is resolved, citizens cannot properly report fraudulent communications.",
        "thumbs_up_count":92,
        "title":null,
        "id":26,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"Form\/Input Errors"
    },
    {
        "date":"2025-10-01 15:53:35",
        "rating":1,
        "review_text":"It is not showing all my numbers. I have 2 sim from one operator and 1 sim from other operator in same circle AND I have one sim from other circle. Numbers are showing operator wise, not all together. Only numbers I can check which are I'm using and active, with an OTP. But still it is difficult to know whether some one is using sim cards under my name.",
        "thumbs_up_count":91,
        "title":null,
        "id":27,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Incomplete Data Display"
    },
    {
        "date":"2025-11-14 07:21:06",
        "rating":1,
        "review_text":"original review......worst experience 😪 since Sims are being sold through adhar based ekyc why can't this app have adhar based sim search option rather than mobile number search...waste...I have multiple sim on my name and it does not work... reply to reply received for original review....what's the big deal in adding an Aadhaar-based search to Sanchaar Saathi? All our IDs are linked to it anyway. This would solve the mobile number search problem instantly. Stop making a mockery of a crucial",
        "thumbs_up_count":84,
        "title":null,
        "id":28,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Flawed Feature Design"
    },
    {
        "date":"2025-09-17 03:28:15",
        "rating":2,
        "review_text":"this app is fake. i installed to check how many sims have been issued in my name. currently I am using 2 sims with my name. but it is showing only one sim. I tried to report the calls as suggested by the reviews. it's showing as call logs not found. both are the false informations only. the app itself is fake how do they recognize fake connections and fake calls?",
        "thumbs_up_count":52,
        "title":null,
        "id":29,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Incomplete Data Display"
    },
    {
        "date":"2025-11-11 06:57:16",
        "rating":4,
        "review_text":"good app does what is said and very simple to use . Should have feature like Truecaller to block unwanted calls too and cycle through all suspicious numbers then only people will use this product.This should be alternative to Truecaller.",
        "thumbs_up_count":52,
        "title":null,
        "id":30,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-09-15 13:43:55",
        "rating":1,
        "review_text":"if your mobile was stolen don't block your imei here it is useless you will never be able to get back your phone after blocking it. they usually sell your phone in other countries like nepal etc where they usually use it easily and are out from police jurisdiction. my phone was tracked in nepal and police is useless and not able to help. keep ur mobile active so that they will sell it in india and ph gets activated in india",
        "thumbs_up_count":51,
        "title":null,
        "id":31,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Negative",
        "tag":"Ineffective Blocking"
    },
    {
        "date":"2025-11-30 05:58:06",
        "rating":1,
        "review_text":"I lost my phone ON MY BIRTHDAY *(feb-05-2025)* u blocked it successful few days later traceability report of your moblie handset has been received we sent to station .why you are saying please contact above police station when phone not found when we visited station they told us why u are coming to station we'll inform when its found . traceability Access Time. on 06-10-25 last till today no update why ? WORST APP EVER !!!!!",
        "thumbs_up_count":49,
        "title":null,
        "id":32,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Negative",
        "tag":"Police Coordination\/Updates"
    },
    {
        "date":"2025-11-18 19:09:06",
        "rating":5,
        "review_text":"As far as I feel that its user interface is very old and its application design needs improvement, its font, and colors should be rich and font should be a little futuristic.Nowadays, there should be a little modern look, classy vibe and good looking design.",
        "thumbs_up_count":44,
        "title":null,
        "id":33,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"UI\/Usability"
    },
    {
        "date":"2025-09-20 10:59:30",
        "rating":5,
        "review_text":"Thank you for making such applications, it will be great if you can make in the 14 regional languages of such wonderful application to fight against digital fraud and scams . Your application advertisement should come to all television in prime times , 7 to 11 pm hours.",
        "thumbs_up_count":43,
        "title":null,
        "id":34,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-10-22 03:58:28",
        "rating":1,
        "review_text":"Fraud app, don't install. I wanted to check the number of connections in my name, it took my data and is displaying only the numbers inserted in my phone. This app just stole my numbers for selling them to marketing agents.",
        "thumbs_up_count":43,
        "title":null,
        "id":35,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Incomplete Data Display"
    },
    {
        "date":"2025-10-01 04:25:36",
        "rating":1,
        "review_text":"😂this app is a joke in itself, no feature is useful at all. For example if you want to block your stolen phone you have log into app with your mobile number and when your phone is stolen with your mobile number, you cannot login to app and you cannot block your phone....So basically government again proved that they are just full of shi*",
        "thumbs_up_count":38,
        "title":null,
        "id":36,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Negative",
        "tag":"Stolen Number Requirement"
    },
    {
        "date":"2025-09-16 07:39:22",
        "rating":1,
        "review_text":"these apps are good for nothing , simply useless. these apps don't detect spam calls and moreover they ask for mobile numbers.what rubbish, do they call from same number everyday? there should be apps which detect the suspected spammers and punish them. one star is because no other option.",
        "thumbs_up_count":37,
        "title":null,
        "id":37,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 17:41:46",
        "rating":1,
        "review_text":"in first appearance i thought this app is useful to find who is using simcard on your name, i have found 1 number which was never i have bought, I report that number couple of times but my application is still pending, may be this app is also run by some lazy government servent!!!!",
        "thumbs_up_count":35,
        "title":null,
        "id":38,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Pending Deactivation Request"
    },
    {
        "date":"2025-10-21 03:14:24",
        "rating":4,
        "review_text":"Add a simple option in the complaint menu to mention the phone no without country code. Sometimes, the country code is ambiguous since its merged with the phone no without any + sign",
        "thumbs_up_count":34,
        "title":null,
        "id":39,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"Form\/Input Errors"
    },
    {
        "date":"2025-10-27 06:47:18",
        "rating":5,
        "review_text":"kindly sir check ur app for errors it says always one or more valid values needed and then submit even after correct placement a good app for preventing scams and advertisers tortures at unwanted time with multiple different number even after blocking i have used once and after that I can't place any more",
        "thumbs_up_count":34,
        "title":null,
        "id":40,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"Form\/Input Errors"
    },
    {
        "date":"2025-09-24 04:58:22",
        "rating":1,
        "review_text":"If my mobile is stolen, how to I lodge a complain\/ block it in this app? when while doing so, it just gives the option of choosing the number which is being used in the device from which I'm blocking. It should give an option of blocking another mobile, as my mobile if already stolen wouldn't be in my hands to be blocked.",
        "thumbs_up_count":33,
        "title":null,
        "id":41,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Negative",
        "tag":"Stolen Number Requirement"
    },
    {
        "date":"2025-09-16 12:26:15",
        "rating":1,
        "review_text":"Just downloaded the app. While registering, got a SMS from Department of Communication number 14.....with a long code ....then the session timed out and still registration is unsuccessful. Kindly resolve this issue immediately",
        "thumbs_up_count":32,
        "title":null,
        "id":42,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"Registration Issues"
    },
    {
        "date":"2025-11-13 12:32:00",
        "rating":1,
        "review_text":"This is a useless app, it is of no use because I checked here with my Aadhaar card and found that another SIM has been taken in my name, which is a number that I do not use, I do not remember ever buying it, so I tried many times to block it but it could not be blocked in any way, I have requested it at least ten times, not my number, but I did not get any response. And it did not block.",
        "thumbs_up_count":30,
        "title":null,
        "id":43,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Pending Deactivation Request"
    },
    {
        "date":"2025-09-14 15:18:13",
        "rating":1,
        "review_text":"Another half cooked app by Government of India. can't even register on the app. the only option I can select is for language, after that app stops working.",
        "thumbs_up_count":29,
        "title":null,
        "id":44,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"Registration Issues"
    },
    {
        "date":"2025-11-18 11:25:03",
        "rating":1,
        "review_text":"I try to register a complaint regarding fraud call the message column needs 500.carecters. But I typed 289 words and I am unable to finish it and forward. Finally unable to register.",
        "thumbs_up_count":29,
        "title":null,
        "id":45,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"Form\/Input Errors"
    },
    {
        "date":"2025-09-23 06:39:33",
        "rating":1,
        "review_text":"Sir, I am getting a warning message for those who are transferring money to me through PhonePe showing some suspicious activities has been detected by department of telecommunication Please tell me why this warning is coming I have also complaint via mail and what's app but No reply from your end why this message showing this type of message affect my reputation so take a action quickly and resolve my problem as soon as possible",
        "thumbs_up_count":28,
        "title":null,
        "id":46,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-09-24 02:42:26",
        "rating":1,
        "review_text":"Dont use Required Option. I selected the required number option against my number. But they send me msg that I reported the number as not mine, and not required . So l have to reverify my kyc to retain my all numbers. its waste of my time So plz don't use this foolish app , you will be in trouble.",
        "thumbs_up_count":26,
        "title":null,
        "id":47,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Technical Failure\/Bug"
    },
    {
        "date":"2025-10-15 09:17:03",
        "rating":2,
        "review_text":"I would like to report lost mobile but it's not have option to report without blocking SIM cards, I have already taken new replacement SIMs, so now I can't able to use this app, as it's not having facility to report in such cases",
        "thumbs_up_count":26,
        "title":null,
        "id":48,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Negative",
        "tag":"Stolen Number Requirement"
    },
    {
        "date":"2025-11-20 04:17:17",
        "rating":1,
        "review_text":"worst app and very bad experience.i was receiving unknown calls and messages it's been 5 months and still I am getting that calls I have complaint about this in this group with number but still there no progress and no proper action has taken.",
        "thumbs_up_count":26,
        "title":null,
        "id":49,
        "theme":"Lack of Complaint Status",
        "sentiment":"Negative",
        "tag":"Ineffective Action"
    },
    {
        "date":"2025-10-13 09:18:44",
        "rating":1,
        "review_text":"I have two sims in my phone but still the registration failed since the app wasn't able to send sms\/receive otp. The app needs big update to work smoothly. Kindly look into the matter and do the needful immediately thanks",
        "thumbs_up_count":25,
        "title":null,
        "id":50,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"Registration Issues"
    },
    {
        "date":"2025-10-24 01:15:52",
        "rating":1,
        "review_text":"don't use this app totally waisted, useless app...yes it can give you the right information but this app cannot block losted and stolen mobile ...it required lost mobile number with handset which there is no typing option..only select option..so how can we select that number if that sim card we lost with handset...",
        "thumbs_up_count":24,
        "title":null,
        "id":51,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Negative",
        "tag":"Stolen Number Requirement"
    },
    {
        "date":"2025-11-24 04:17:47",
        "rating":1,
        "review_text":"This app does not allow us to report complaints of past date and years. kindly rectify this bug. or we will get the message that it is not wanting to collect all possible\/ past fraud attempts",
        "thumbs_up_count":24,
        "title":null,
        "id":52,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"App Bug\/Crash"
    },
    {
        "date":"2025-11-27 10:15:11",
        "rating":1,
        "review_text":"Rubbish app. forget the design, this app doesnt even register properly. Even after trying to register and send sms several times it just time-outs itself. Ye app useless hai!!!",
        "thumbs_up_count":24,
        "title":null,
        "id":53,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"Registration Issues"
    },
    {
        "date":"2025-09-19 16:32:42",
        "rating":1,
        "review_text":"App not capable to detect other active numbers of a person even though the number already linked with aadhaar.Developers may look into this. I could not yet register my first number which I am using for the last 23 years and is still active",
        "thumbs_up_count":23,
        "title":null,
        "id":54,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Technical Failure\/Bug"
    },
    {
        "date":"2025-11-24 05:17:43",
        "rating":1,
        "review_text":"only fetches the mobile number that sends the sms from the application.. not worth it... Don't download.. This is just to keep a track of your mobile number and the handset used.",
        "thumbs_up_count":23,
        "title":null,
        "id":55,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Incomplete Data Display"
    },
    {
        "date":"2025-11-18 07:07:07",
        "rating":2,
        "review_text":"doesn't work, inspite of updating the app. today a spam call came at 11:41A.M., complaining about it at 12:00P.M. but error message in the app displays telling future date and time cannot be entered, apart from this many more problems.",
        "thumbs_up_count":19,
        "title":null,
        "id":56,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"App Bug\/Crash"
    },
    {
        "date":"2025-10-03 04:30:49",
        "rating":1,
        "review_text":"This app is a joke. Promotional message I received states that the app will help me find unauthorized connection in my name. But it would do so only if the unauthorized person registers on this app to inform about that unauthorized sim",
        "thumbs_up_count":16,
        "title":null,
        "id":57,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Flawed Feature Design"
    },
    {
        "date":"2025-10-06 05:14:56",
        "rating":5,
        "review_text":"well they do work on the feedback the app is excellent and I am able to report even WhatsApp messages to meta. this app was not working for me earlier but now has started working. I think dot has done an excellent job on this thing",
        "thumbs_up_count":16,
        "title":null,
        "id":58,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-11 07:14:45",
        "rating":1,
        "review_text":"worst app not user friendly I wanted to check that whether there are any mobile phone connections in my name، but after too many attempts I was unable to fetch any details",
        "thumbs_up_count":16,
        "title":null,
        "id":59,
        "theme":"Wrong Number Linkage",
        "sentiment":"Negative",
        "tag":"Technical Failure\/Bug"
    },
    {
        "date":"2025-09-27 09:19:35",
        "rating":3,
        "review_text":"Though giving complaints using this app, there's no impact. We keep getting unsolicited commercial calls everyday. If some numbers are blocked, they use other numbers of the call centre.",
        "thumbs_up_count":14,
        "title":null,
        "id":60,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-18 06:58:43",
        "rating":3,
        "review_text":"after downloading I am trying to register my other numbers, but every time I am entering correct captcha, it is saying invalid. even a college kid write a better app. very untested code.",
        "thumbs_up_count":13,
        "title":null,
        "id":61,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"Registration Issues"
    },
    {
        "date":"2025-10-22 13:09:27",
        "rating":3,
        "review_text":"Complaint status not available which makes it difficult to understand if a complaint is accepted or rejected. i logged the complaint for the WhatsApp group which is still active after 6 days.",
        "thumbs_up_count":13,
        "title":null,
        "id":62,
        "theme":"Lack of Complaint Status",
        "sentiment":"Negative",
        "tag":"Missing Status Updates"
    },
    {
        "date":"2025-11-05 14:25:08",
        "rating":3,
        "review_text":"you have to have that sim card in your phone JUST TO CHECK anything. alright, at least let us check the process through otp and ref. id🤷🏻. I'm getting otp on my father's keypad with no internet phone after 5 minutes, had to insert it in this phone just to check. thanks for reply though, i complained a few months ago about my stolen phone to block imei but it's still not done,I hope something happens with this sim blocking.",
        "thumbs_up_count":11,
        "title":null,
        "id":63,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Negative",
        "tag":"Stolen Number Requirement"
    },
    {
        "date":"2025-11-10 05:12:29",
        "rating":5,
        "review_text":"A much needed app not only shows you number registered by you but it can even block stolen phone and report fraud calls and unknowns international calls and can verify if you handset is genuine it even tells you which country it is manufactured in.",
        "thumbs_up_count":11,
        "title":null,
        "id":64,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-09 07:51:21",
        "rating":5,
        "review_text":"It's a very good app and service from the government provided, we never believed lost mobile is recovered, but it happened after 1 year, we are very happy from this service, Thanks a lot 🙏",
        "thumbs_up_count":8,
        "title":null,
        "id":65,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-29 12:21:03",
        "rating":5,
        "review_text":"This app is useful if you want to quickly check how many numbers are present on your ID. The interface is simple and easy to understand, even for beginners. Results are shown clearly and the app works smoothly most of the time. It would be great if the developers add more features and improve speed a little, but overall it does what it promises. Recommended for basic use.",
        "thumbs_up_count":8,
        "title":null,
        "id":66,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-21 06:06:29",
        "rating":5,
        "review_text":"Sir, I do not know whether my mobile is misused and\/or abused. Of course there are calls from nowhere caller saying \" I am calling from TELECOM DEPT., that duplicate SIM card is used for my mobile and that I should immediately give a complaint in this regard to Colaba Police Station Bombay. otherwise my mobile connection would be cut off in two hours etc.\" I ask the caller to send sms to my mobile so that my lawyer can guide me whether I should respond to such CALLS or not. Can you help from me.",
        "thumbs_up_count":7,
        "title":null,
        "id":67,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-10-07 06:56:30",
        "rating":3,
        "review_text":"many functional issues, the call log is not getting populated. lot of information can be autofilled, it ask you to fill manually. especially when you report a spam call or SMS.",
        "thumbs_up_count":6,
        "title":null,
        "id":68,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"UI\/Usability"
    },
    {
        "date":"2025-11-05 07:06:41",
        "rating":5,
        "review_text":"This app is beneficial for finding the phone. My phone is with me because of this app only. Heartily, Thank you so much. You did a remarkable job.",
        "thumbs_up_count":6,
        "title":null,
        "id":69,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-11 09:30:08",
        "rating":2,
        "review_text":"they ask to always be able to charge your phone or never allow only two choices ,there should be allow this time only for our safety ,so I rejected the request to always allow my phone to be charged money !",
        "thumbs_up_count":6,
        "title":null,
        "id":70,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"App Bug\/Crash"
    },
    {
        "date":"2025-11-13 05:41:42",
        "rating":5,
        "review_text":"Sanchar Sathi is a very useful and reliable app developed by the Government of India to protect mobile users. The app helps you check how many SIM cards are issued in your name, report fraud numbers, block or trace lost mobiles, and stay safe from digital scams. Its interface is simple, fast, and easy to use even for beginners. For anyone who wants security, transparency, and control over their mobile identity, Sanchar Sathi is one of the best apps available today.",
        "thumbs_up_count":6,
        "title":null,
        "id":71,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-19 02:15:32",
        "rating":5,
        "review_text":"thish app is very good... in this app have many features.. such as .. you know you name how many phone number and also block your number.... 2. - you check your handset are verified or froud.. 3- you can report spam call national & international and have many features in this app... thank you telecommunication sector",
        "thumbs_up_count":6,
        "title":null,
        "id":72,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-10 08:33:44",
        "rating":5,
        "review_text":"Very helpful app by the Government of India! It’s great for checking mobile connections and reporting lost or misused SIMs. Simple to use and informative. Keep improving the interface and speed. 👍",
        "thumbs_up_count":5,
        "title":null,
        "id":73,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-11 08:08:56",
        "rating":5,
        "review_text":"It was a very good experience the police were able to track my phone and gave it back in 9 months. I was getting regular updates of my lost phone on my sms which was really helpful",
        "thumbs_up_count":5,
        "title":null,
        "id":74,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-13 15:26:15",
        "rating":5,
        "review_text":"I love 😘 it. It contains genuine information. I fill my IMEI number and it gave correct information about my phone. I am using two numbers and it showed me the same. It's very useful app. It's great.",
        "thumbs_up_count":5,
        "title":null,
        "id":75,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-11 04:34:03",
        "rating":5,
        "review_text":"I Highly recommend this app to eliminate spam and phishing attacks. Unless our joint effort, it will be difficult to handle fraudsters.",
        "thumbs_up_count":4,
        "title":null,
        "id":76,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-12 01:42:48",
        "rating":4,
        "review_text":"App is good, need to add old sim numbers which we are not using those we lost. since it shows the current number.",
        "thumbs_up_count":4,
        "title":null,
        "id":77,
        "theme":"Wrong Number Linkage",
        "sentiment":"Positive",
        "tag":"Incomplete Data Display"
    },
    {
        "date":"2025-11-18 09:43:27",
        "rating":5,
        "review_text":"application is best way to Raise complaint. i tried with web nad my experience is very worst. bu t when download application. after then the process very easy.And i raised complaint. supper application.",
        "thumbs_up_count":4,
        "title":null,
        "id":78,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-19 04:35:40",
        "rating":4,
        "review_text":"Reporting efficiency is good. But it would have been better had the complainant been informed of the action taken. Sevondly, there should also be a provision for- 1. attaching an audio file; and 2. making over of complaint to police for criminal action whenever required",
        "thumbs_up_count":4,
        "title":null,
        "id":79,
        "theme":"Lack of Complaint Status",
        "sentiment":"Positive",
        "tag":"Missing Status Updates"
    },
    {
        "date":"2025-11-10 07:36:45",
        "rating":4,
        "review_text":"Yes, it's nice, easy to use and you can choose ur own language.... This app can know about the froud calls and connections.....",
        "thumbs_up_count":3,
        "title":null,
        "id":80,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-21 06:25:48",
        "rating":4,
        "review_text":"Nice app,user friendly, needs to update one thing, give option to search and see the accounts and pages registered with individual mobile number....",
        "thumbs_up_count":2,
        "title":null,
        "id":81,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-27 06:13:13",
        "rating":5,
        "review_text":"This is my second innings with this app. The last time I was unable to get it to any thing. but now it seems to have streamlined the flow. I was successfully able to register and submit a complaint.",
        "thumbs_up_count":2,
        "title":null,
        "id":82,
        "theme":"App Bugs and Usability",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 07:00:35",
        "rating":5,
        "review_text":"It's a very good app by DoT. I can blocked by phone when I lost and same has been recovered by police and can also unblock my phone. it's complete digital process. Thank you so much. ##punepolice#cier#sancharsaathi",
        "thumbs_up_count":2,
        "title":null,
        "id":83,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-12 05:12:08",
        "rating":5,
        "review_text":"Sanchar Saathi App is really good! It helps us keep our mobile numbers and devices safe. A great step towards digital security. Well done! 👍",
        "thumbs_up_count":1,
        "title":null,
        "id":84,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-12 11:06:37",
        "rating":5,
        "review_text":"Good app. Good initiative need to make options and wording more clearer to avoid miscommunication. The best app for reporting fraud calls .",
        "thumbs_up_count":1,
        "title":null,
        "id":85,
        "theme":"App Bugs and Usability",
        "sentiment":"Positive",
        "tag":"UI\/Usability"
    },
    {
        "date":"2025-11-16 13:25:46",
        "rating":5,
        "review_text":"it's Really useful, one of the best things about this app is if someone steals your phone and u have an imei number you can block the mobile from here by sending the request.",
        "thumbs_up_count":1,
        "title":null,
        "id":86,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-19 06:17:35",
        "rating":4,
        "review_text":"I Re Rating 4 Star Because App Service Good But App UI Improved Need Because Website Is OK But Most Have User Likes Me Prefer App So Your Are A Government App So Need Improved Ok , Remember Your Costumer Service Is Not Good Trying To Improved For Better Because Not Many Options Here For Which Time I Went Help So Please Better Your Costumer Support Help Desk",
        "thumbs_up_count":1,
        "title":null,
        "id":87,
        "theme":"App Bugs and Usability",
        "sentiment":"Negative",
        "tag":"UI\/Usability"
    },
    {
        "date":"2025-11-26 01:32:22",
        "rating":5,
        "review_text":"Wider your coverage by incorporating telegram, messenger and other social media app from where calls can be reported not just calls \/ sms \/ whatsapp but more too.",
        "thumbs_up_count":1,
        "title":null,
        "id":88,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 13:50:28",
        "rating":4,
        "review_text":"Seriously fruitful. It will help me in many ways. It would be helpful if the apps could tell the mechanical error of the handset. Hope, this problem will be solved.",
        "thumbs_up_count":1,
        "title":null,
        "id":89,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-10 04:45:50",
        "rating":5,
        "review_text":"Finally you dont have to go police station simple do online fir of your stolen device then register on this app they can block you device if anyone will your device you received a notification then you go to police and aske them to find your device",
        "thumbs_up_count":0,
        "title":null,
        "id":90,
        "theme":"Lost Device Process Flaws",
        "sentiment":"Positive",
        "tag":"Positive Feedback"
    },
    {
        "date":"2025-11-17 15:38:02",
        "rating":5,
        "review_text":"I lodged a complaint against a fraud caller. I took hardly 2 minutes. So simple and so fast. Rarely saw such Govt App. Excellent",
        "thumbs_up_count":0,
        "title":null,
        "id":91,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-21 10:22:55",
        "rating":4,
        "review_text":"Good App. You can report the callers who impersonate as govt officials and threaten to block your phone no. and ask to give money if the no. was not to be blocked.",
        "thumbs_up_count":0,
        "title":null,
        "id":92,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-22 15:23:15",
        "rating":5,
        "review_text":"From a developer's perspective, the UI, performance, and speed are excellent. However, I cannot speak to how well it performs the task it was designed for.",
        "thumbs_up_count":0,
        "title":null,
        "id":93,
        "theme":"App Bugs and Usability",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 12:35:50",
        "rating":5,
        "review_text":"This app is very best for all peoples. because in the app providing four stolen phone also know your name now active SIM cards and old people use this app is very useful this app providing all people all mobile phones no is genuine or not genuine. I am suggest all people must be you this pic app for one time all time best app I am never see in my life this app. so useful world wide best app. I am suggest all people must be used one type in your life.",
        "thumbs_up_count":0,
        "title":null,
        "id":94,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 08:07:41",
        "rating":5,
        "review_text":"the best app to find out , how many sim issue by registered mobile no. if the number show registered on u r , but not using by u, there r 3 option available, I m not using, not needed, needed",
        "thumbs_up_count":0,
        "title":null,
        "id":95,
        "theme":"Wrong Number Linkage",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 09:06:10",
        "rating":4,
        "review_text":"This app usually provides the desired information relatively quickly and accurately. Sometimes there are snags but that are not serious.",
        "thumbs_up_count":0,
        "title":null,
        "id":96,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    }
]