[
    {
        "date":"2025-11-28 09:29:39",
        "rating":3,
        "review_text":"Two issues: 1. It constantly misunderstands prompts, jumping to assumptions about what the user says. 2. The \"Something went wrong (9)\" issue is getting extremely annoying. It sometimes shows after just two prompts and stays the entire day, or appears after a long chat. The second one is the more frustrating issue and needs to be looked into. I constantly end up using the webapp in Chrome incognito mode because that's the only place where this error never shows up.",
        "thumbs_up_count":266,
        "title":null,
        "id":1,
        "theme":"Technical Errors & Slowness",
        "sentiment":"Negative",
        "tag":"Persistent Errors"
    },
    {
        "date":"2025-11-26 16:03:48",
        "rating":2,
        "review_text":"It seems to be getting worse with every update. Basic stuff is now unusable. For example, sometimes saying \"flashlight on\" correctly turns on my phone's flashlight, but sometimes it tells me about flashlights, or just ignores me, or makes me unlock my phone. Navigationnow barely works and takes many tries to get started. \"Cancel navigation\" might confirm that navigation is canceled, but my navigation continues. I feel this could be great someday, but it is not there yet.",
        "thumbs_up_count":90,
        "title":null,
        "id":2,
        "theme":"AI Misunderstanding Prompts",
        "sentiment":"Negative",
        "tag":"Inconsistent Output"
    },
    {
        "date":"2025-11-20 18:39:20",
        "rating":5,
        "review_text":"It's a great tool. Is very helpful, and effective. It helps me every day with in my job. I use it for investigating, to programming and resolve some doubts. I like it so much. I would like the that it would allow to use folders, I mean folders to manage the different conexts and topics that one can use. This is for better organization and segment, this this would make it better.",
        "thumbs_up_count":78,
        "title":null,
        "id":3,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-20 13:51:02",
        "rating":5,
        "review_text":"​I used to use ChatGPT, but its subscription is too expensive, and prices aren't localized. ​I recently switched to Gemini (after trying it a year ago and being disappointed). I am thrilled! This week, Gemini wrote Python code far more accurately and thoughtfully than ChatGPT. The app is much better and more user-friendly. ​The new Version 3 (with code in separate files and file upload capability) is amazing. Plus, the Plus subscription is very affordable with localized pricing.",
        "thumbs_up_count":57,
        "title":null,
        "id":4,
        "theme":"Pricing & Subscription Fees",
        "sentiment":"Positive",
        "tag":"Localized Pricing"
    },
    {
        "date":"2025-11-29 04:14:20",
        "rating":1,
        "review_text":"Just a waste of time My request was straightforward: generate schedules from a list of accounts where the total denomination is \\le \\$20,000, and exclude any account with \"60 months paid up to.\" Despite providing the necessary names and denominations, the system repeatedly failed to proceed because I did not initially provide the exact \"Months Paid Up To\" value for every single entry. It became a frustrating, circular loop where the AI demanded the missing column data, even when I offered to ma",
        "thumbs_up_count":53,
        "title":null,
        "id":5,
        "theme":"AI Misunderstanding Prompts",
        "sentiment":"Negative",
        "tag":"Rigid Input Requirements"
    },
    {
        "date":"2025-11-24 00:13:15",
        "rating":1,
        "review_text":"Update 11\/23\/25. Still freezes when you use the talking feature. It also literally guessed information I asked it for based off of \"tropes\" that's literally the excuse the A.I. gave me. It did it several times and even when I added it to it's memory to always provide me with sources it went against it. I know this because I busted it and it apologized. It's not ready for prime time. Needs work. Freezes often and words get cut off so you can't hear the answer to the question you asked it.",
        "thumbs_up_count":44,
        "title":null,
        "id":6,
        "theme":"Technical Errors & Slowness",
        "sentiment":"Negative",
        "tag":"App Crash \/ Freeze"
    },
    {
        "date":"2025-11-25 06:28:41",
        "rating":1,
        "review_text":"Since the release of 3, I was initially quite impressed, but now it's crashing all over the place and can't manage to keep basic facts straight. Right now I'm trying to help me handle work I'm having another AI do, and not only is Gemini failing to analyze the work properly, it jumps in and tries to do the work itself after I've repeatedly told it not to and it apologizes and promises it won't happen again. And then it does it again. Badly. Also, switching between Fast and Thinking crashes it.",
        "thumbs_up_count":38,
        "title":null,
        "id":7,
        "theme":"Technical Errors & Slowness",
        "sentiment":"Negative",
        "tag":"App Crash \/ Freeze"
    },
    {
        "date":"2025-11-29 20:25:45",
        "rating":5,
        "review_text":"I just asked for stocking stuffer ideas and am seriously blown away by how great the suggestions are. and it did not try to push any specific product sales on me, just suggested small items at the price point I had requested. this was one of the best generative AI experiences I've had so far, so I will definitely be switching to Gemini!",
        "thumbs_up_count":26,
        "title":null,
        "id":8,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 17:45:36",
        "rating":3,
        "review_text":"I would have rated 5+ stars because its capacity to create images and podcast-like overviews are cool. However, subsequent update seem to make the app work more and more poorly. The Voice Match is unable to recognise and transcribe words as before. A lot of times, the responses to prompts are irrelevant —or nothing(I don't know if my prompts are too complex, or expectations for Google Gemini, too high.)",
        "thumbs_up_count":17,
        "title":null,
        "id":9,
        "theme":"Feature Quality Issues",
        "sentiment":"Negative",
        "tag":"Output Quality"
    },
    {
        "date":"2025-11-25 04:27:16",
        "rating":1,
        "review_text":"nobody said there was a limit of how many times you can use this app. once you reach the limit, they demand a high fee for you to use it. like $20 a month? that's more than 2-3 streaming services combined. Also, every time you add something to the image you were working on, the entire image gets blurrier, which includes all of the spots you didn't request a change in.",
        "thumbs_up_count":12,
        "title":null,
        "id":10,
        "theme":"Pricing & Subscription Fees",
        "sentiment":"Negative",
        "tag":"Hidden Charges"
    },
    {
        "date":"2025-11-28 02:13:54",
        "rating":3,
        "review_text":"it's honestly hit or miss, as a writer it's helped me out a lot but there are some moments when I'm generating images to put inside of character profiles and dossier when I run into error after error and recently it's been just straight up saying it's generating when it's not then I'm told that there was an error saying it'll be fix then trying again only to run into the same error before just straight up removing links. it's very beat around the bush and pry it'll work and if it doesn't wait.",
        "thumbs_up_count":9,
        "title":null,
        "id":11,
        "theme":"Technical Errors & Slowness",
        "sentiment":"Negative",
        "tag":"Persistent Errors"
    },
    {
        "date":"2025-11-28 18:44:43",
        "rating":1,
        "review_text":"Anytime I want change someone's image slightly (even just hair colour) I'm constantly being told \"There are a lot of people I can help with, but I can't edit some public figures. Do you have anyone else in mind?\" time after time after time. Even when telling the app its not a public figure i get the same response, whats looking at going premium, won't bother now as the app is clearly broken",
        "thumbs_up_count":8,
        "title":null,
        "id":12,
        "theme":"Feature Quality Issues",
        "sentiment":"Negative",
        "tag":"Content Policy Errors"
    },
    {
        "date":"2025-11-29 22:48:54",
        "rating":1,
        "review_text":"The Gemini App incapable of generating the image in other aspect ratio except for 1:1 aspect ratio only. The resolution also very low. This has been going on for too long. Fix it, Google Team! Fast model always repeating the same mistake even though I specifically pointed out the mistake. It keeps apologizing to the unbearable and annoying extent, like it intentionally doing so. Thinking 3 Pro is the worst. It did what I asked not to do and the opposite. Until then, I rate one star.",
        "thumbs_up_count":7,
        "title":null,
        "id":13,
        "theme":"Feature Quality Issues",
        "sentiment":"Negative",
        "tag":"Image Generation Limits"
    },
    {
        "date":"2025-11-28 13:01:23",
        "rating":2,
        "review_text":"Good models, more to the point than some others, but at times too brief. The app experience is quite poor: Formatting issues with mathematical expressions galore, some chats are simply not available on the mobile app (why?), inference times are astonishingly slow... Definitely not as enjoyable as the web version. Would only recommend for pretty light use.",
        "thumbs_up_count":6,
        "title":null,
        "id":14,
        "theme":"Technical Errors & Slowness",
        "sentiment":"Negative",
        "tag":"Slow Response Time"
    },
    {
        "date":"2025-11-27 17:09:24",
        "rating":2,
        "review_text":"Story time. So I'm in the shower, wanted some music. Tablet was on the vanity, was reading while doing some business. I say \"Hey Google play some music\". Prompt comes up for which app I'd like to use immediately followed by a review popup. So I'm in the shower with no music now and no voice control because of this stupid review I'm writing. Why can't we just have gemini ask if we'd like to rate it AFTER the darn interaction is finished. Please Google I just wanted to sing in the shower.",
        "thumbs_up_count":4,
        "title":null,
        "id":15,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 16:58:01",
        "rating":5,
        "review_text":"Add a cute Doraemon character in the frame, matching the walking style shown in the reference Doraemon image. The Doraemon character should be slightly bigger than before, but not too large. Place the character naturally in the scene, walking straight toward the viewer. Do not change the person, face, outfit, background, lighting, shadows, pose, composition or any part of the original photo. Only add the Doraemon character without altering anything else.”",
        "thumbs_up_count":4,
        "title":null,
        "id":16,
        "theme":"AI Misunderstanding Prompts",
        "sentiment":"Negative",
        "tag":"Complex Constraints"
    },
    {
        "date":"2025-11-26 22:48:53",
        "rating":1,
        "review_text":"it kept cutting in and out like it was going to say something and then stopped. like any little sound will make it stop. be warned he kept doing this every 5 to 8 attempts like for the attempts were good and then at the fifth one it just messed up, then tried three more and then on the 8th one it messed up again. needs a lot more tweaking if you ask me.",
        "thumbs_up_count":3,
        "title":null,
        "id":17,
        "theme":"Technical Errors & Slowness",
        "sentiment":"Negative",
        "tag":"Audio Issues"
    },
    {
        "date":"2025-11-26 22:46:36",
        "rating":2,
        "review_text":"The data analysis has been fantastic. But the video generation has been a nightmare. It us so unstable. When it works, it is pretty good. But 80% of the the time lately it says it is too busy to process my request. And when it does process, it has been returning a still image, not a video.",
        "thumbs_up_count":2,
        "title":null,
        "id":18,
        "theme":"Technical Errors & Slowness",
        "sentiment":"Negative",
        "tag":"Feature Failure"
    },
    {
        "date":"2025-11-27 14:24:08",
        "rating":3,
        "review_text":"It's good but there's one simple reason I won't pay for it and choose chatgpt instead. Voice typing (using the microphone icon) should be uninterrupted until I decide I'm done. The app should not decide at the slightest pause that my sentence\/text is done and send it to the AI. Think for a second while speaking? Too bad, the AI just got sent half your intended message. We already have Live as a conversation mode, please change this.",
        "thumbs_up_count":2,
        "title":null,
        "id":19,
        "theme":"Feature Quality Issues",
        "sentiment":"Negative",
        "tag":"Voice Input Issues"
    }
]