[
    {
        "date":"2025-11-27 16:14:27",
        "rating":5,
        "review_text":"I don't know if Netflix or the people behind it are hearing or reading this, but never become like Amazon primevideo. You guys are the BEST!!! when it comes to ads. they're hardly visible on the app and the content despite not much like prime is still the best. This is a humble request from a fellow subscriber that please never become like them! you're the best and please never introduce plans like Amazon where I have to pay extra just for the ads to be removed. Keep rocking!",
        "thumbs_up_count":89,
        "title":null,
        "id":1,
        "theme":"Ads & Playback Disruption",
        "sentiment":"Positive",
        "tag":"Ad Model \/ Pricing"
    },
    {
        "date":"2025-11-23 16:42:22",
        "rating":1,
        "review_text":"I don't mind that they added ads but the experience is terrible if you ever lose your spot in a show. I wanted to continue watching a series so I opened netflix, and they started me off with ads, which was fine but then it auto-started me on the wrong episode. I went to the correct one, only to get more ads again. Then when I tried to fast forward to the spot in the episode I was at, more ads, so I got 3 ad breaks before even being able to watch a second of the show.",
        "thumbs_up_count":21,
        "title":null,
        "id":2,
        "theme":"Ads & Playback Disruption",
        "sentiment":"Negative",
        "tag":"Excessive Ad Frequency"
    },
    {
        "date":"2025-11-23 22:59:44",
        "rating":1,
        "review_text":"I really hate the interface on most of these streaming apps. They never show their full library A-Z. I like to browse through everything offered instead of just getting a few choices they think I'll like in each category. It's really annoying missing out on a lot of stuff that's on here just because they don't have a spot that had their full library. Having to google what's streaming then search for it is crazy. Please for the love, make an A-Z library.",
        "thumbs_up_count":7,
        "title":null,
        "id":3,
        "theme":"Interface & Navigation",
        "sentiment":"Negative",
        "tag":"Library Navigation"
    },
    {
        "date":"2025-11-28 22:37:42",
        "rating":1,
        "review_text":"great shows and movies, app is pure garbage. start a show or movie, try to pause and get nothing. or it paused only to quickly unpause. after several attempts, it finally pauses, only to crash out. every instance of Netflix apps across all the different platforms are exactly the same in this respect. obviously a net code problem they could care less about because they are getting money anyway. after this last season of stranger things, cancelling for good.",
        "thumbs_up_count":5,
        "title":null,
        "id":4,
        "theme":"App Stability & Bugs",
        "sentiment":"Negative",
        "tag":"App Crash"
    },
    {
        "date":"2025-11-29 03:12:43",
        "rating":2,
        "review_text":"Do not trust this company. I would rate 4 stars for coming to watch movies and videos. New release fairly often, decent recommendations, and remembers where you left off. I would rate 0 stars for anything this company does as a long-term project, as they will give up on it and cancel it at a moments notice, such as their games. Don't invest your time here.",
        "thumbs_up_count":2,
        "title":null,
        "id":5,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-24 05:37:34",
        "rating":3,
        "review_text":"Can no longer do picture in picture on my android (running android 16). My phone settings show it's on and allowed and the app info through my phone says it's on but it doesn't work. When I click to go to a different app real quick the Netflix screen just vanished. I'm updated to the last one available, no update showing, I've cleared cache and uninstalled and reinstalled. Still doesn't work.",
        "thumbs_up_count":1,
        "title":null,
        "id":6,
        "theme":"App Stability & Bugs",
        "sentiment":"Negative",
        "tag":"Feature Issues"
    },
    {
        "date":"2025-11-26 11:12:12",
        "rating":1,
        "review_text":"I'm not happy about this app , they are very greedy , I had set Autopay to my paytm for monthly recharge, they cut money from my account and they are telling me that , my account has been put to hold for some reasons and even tough i updated my payment methods , it is still showing in my Netflix app , my payment is due , Worst app , some apps are much better than this waste Netflix",
        "thumbs_up_count":1,
        "title":null,
        "id":7,
        "theme":"Billing & Account Policy",
        "sentiment":"Negative",
        "tag":"Billing Errors"
    },
    {
        "date":"2025-12-01 14:01:03",
        "rating":1,
        "review_text":"Netflix is leading the charge backwards for streaming services. As if the device limit wasn't bad enough, they're now killing the ability to cast from phones. Pretty much useless while traveling now. Thankfully there are plenty of other streaming services that aren't as scummy. With Stranger Things coming to an end, it's time to completely abandon Netflix and never open the app again.",
        "thumbs_up_count":1,
        "title":null,
        "id":8,
        "theme":"Billing & Account Policy",
        "sentiment":"Negative",
        "tag":"Policy Changes"
    },
    {
        "date":"2025-11-29 01:33:11",
        "rating":3,
        "review_text":"doesn't have much to offer, most things I try to watch are exceedingly boring; I greatly dislike that on TV the remote control is not allowed to be used so I cannot control the volume or other settings. I get in trouble if it's too loud and my neighbour shuts off my TV from upstairs. No other TV streaming app blocks remote access, only Noseflix. Also it takes forever to turn on in the 1st place.",
        "thumbs_up_count":0,
        "title":null,
        "id":9,
        "theme":"Interface & Navigation",
        "sentiment":"Negative",
        "tag":"Restricted Controls"
    },
    {
        "date":"2025-11-30 21:05:14",
        "rating":1,
        "review_text":"I do enjoy Netflix, I really do. It works beautifully on my computer and living room TV, though it does have some issues when I'm trying to watch TV in my bedroom, it fixes itself and it hasn't happened in a long time. My big issue is the fact that the mobile app is tweaking out. it will go to the Netflix symbol but won't change. No matter how long I leave the screen on, I've left it on for about 7 minutes once it and it stayed the same. I even updated the app, and it has yet to change.",
        "thumbs_up_count":0,
        "title":null,
        "id":10,
        "theme":"App Stability & Bugs",
        "sentiment":"Negative",
        "tag":"Loading Issues"
    }
]