[
    {
        "date":"2025-11-23 07:39:03",
        "rating":1,
        "review_text":"I had a very bad experience with your app. I installed it from the Google Play Store and paid 2 for a subscription. Later, when I tried to cancel the auto-pay through PhonePe, noticed that your app had progressed ₹499 .How could you do this without informing me? I want a refund and want to stop the auto-pay immediately.This is an unbelievable experience. resolve this as soon as possible.",
        "thumbs_up_count":235,
        "title":null,
        "id":1,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-24 11:15:25",
        "rating":5,
        "review_text":"can you refund my payment.I had a very bad experience with your app. I installed it from the Google Play Store and paid 1 for a subscription. Later, when I tried to cancel the auto-pay through PhonePe, noticed that your app had progressed ₹499 from 24\/11\/25 without my knowledge.How could you do this without informing me? I want a refund and want to stop the auto-pay immediately. When I tried to cancel the auto-pay, it still showed the ₹499 payment. This is an unbelievable experience.",
        "thumbs_up_count":218,
        "title":null,
        "id":2,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 04:22:46",
        "rating":1,
        "review_text":"Can you refund my payment. I had a very bad experience with your app. I installed it from the Google Play Store and paid 1 for a subscription. Later, when I tried to cancel the auto-pay through PhonePe, noticed that your app had progressed ₹499 from 29\/11\/25 without my knowledge. How could you do this without informing me? I want a refund and want to stop the auto-pay immediately. When I tried to cancel the auto-pay, it still showed the ₹499 payment. This is an unbelievable experience",
        "thumbs_up_count":62,
        "title":null,
        "id":3,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-26 05:20:23",
        "rating":5,
        "review_text":"Vertical format dramas are so fun to watch. Very well made shows. Love the short, gripping episodes.",
        "thumbs_up_count":60,
        "title":null,
        "id":4,
        "theme":"Content Library Quality",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-24 04:40:03",
        "rating":1,
        "review_text":"the updated version is very bad, I'm unable to read the titles of each episodes. The older version was even more better, I was able to view the episode titles in the previous version, and also in this version, audios are getting paused in between. There are no updates for over a month for any stories, my subscription is a total waste",
        "thumbs_up_count":43,
        "title":null,
        "id":5,
        "theme":"App Interface & Bugs",
        "sentiment":"Negative",
        "tag":"Playback Issue"
    },
    {
        "date":"2025-11-27 01:11:53",
        "rating":1,
        "review_text":"I had a very bad experience with your app. I installed it from the Google Play Store and paid 2 rs for a trial via UPI app and Automaticly my Auto renewal was set without my permission and Later, when I tried to cancel the auto-pay through PhonePe, noticed that your app had progressed ₹499.How could you do this without informing me? I want a refund and want to stop the auto-pay immediately. This is an unbelievable experience. resolve this as soon as possible.",
        "thumbs_up_count":42,
        "title":null,
        "id":6,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-27 12:07:41",
        "rating":5,
        "review_text":"Kuku FM is an excellent platform for listening to audiobooks and learning new things, especially for business and self-development. The content quality is very good, voices are clear, and episodes are easy to understand. I really like that it has books in simple language and multiple Indian languages. This app is very helpful for improving knowledge while saving time. I request more business category books and more latest book availability. Overall, great experience. 👍",
        "thumbs_up_count":27,
        "title":null,
        "id":7,
        "theme":"Content Library Quality",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-21 05:34:12",
        "rating":5,
        "review_text":"simply great with great UI. Still need to improve the content library in both Tamil and English",
        "thumbs_up_count":26,
        "title":null,
        "id":8,
        "theme":"Content Library Quality",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-21 02:45:33",
        "rating":1,
        "review_text":"⚠️ SCAM ALERT: Kuku FM App – Unauthorized Deduction of ₹499 I want to warn others about my recent bad experience with the Kuku FM app. I tried to enter the app for a free trial, but without any clear consent or confirmation, the app automatically deducted ₹499 from my account. There was no proper notification, no warning, and no clear permission taken from me before charging the amount. This is extremely unethical, and many others seem to have faced similar issues according to online reviews.",
        "thumbs_up_count":23,
        "title":null,
        "id":9,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 15:27:12",
        "rating":1,
        "review_text":"I had a very bad experience with your app. I installed it from the Google Play Store and paid 2 for a subscription. Later, when I tried to cancel the auto-pay through Google pay, noticed that your app had progressed ₹499. How could you do this without informing me? I want a refund and want to stop the auto-pay immediately. This is an unbelievable experience. resolve this as soon as possible.",
        "thumbs_up_count":6,
        "title":null,
        "id":10,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-24 20:24:36",
        "rating":1,
        "review_text":"Uninteresting storiesapp is completely misleading. They promise a 7-day free trial, but the premium amount was auto-deducted just after 3 days! The cancel option appeared only after the payment was deducted",
        "thumbs_up_count":4,
        "title":null,
        "id":11,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-22 05:13:33",
        "rating":5,
        "review_text":"The quality of the content is outstanding. So many good dramas in one place. Streaming is always smooth.",
        "thumbs_up_count":2,
        "title":null,
        "id":12,
        "theme":"Content Library Quality",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 05:22:31",
        "rating":4,
        "review_text":"greetings, a month back I just wanted to know or rather see what your app is all about. so I downloaded the app and just accepted something in your app. I was not interested so I uninstalled your app but an amount of 499\/- has been deducted automatically from my account. kindly request your good self to pls refund me the amount. I had to reinstall your app to keep you posted. kindly do the needful and return my amount. regards",
        "thumbs_up_count":2,
        "title":null,
        "id":13,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-23 08:01:42",
        "rating":1,
        "review_text":"well I got scammed by this app . this app is complete fraud . I paid ₹2 to app and after some days ,on 20\/11\/2025 rupees 499 had been transferred from my account well i am very dissatisfied and disappointed with this app i want the refund of ₹499 back to me . orelse there will be a strict action towards this issue 😒",
        "thumbs_up_count":1,
        "title":null,
        "id":14,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-26 04:26:18",
        "rating":1,
        "review_text":"The worst and bad apps 🤮🤮 don't waste your time I try to listen some free book but no one fm is free after pay him 2 rupees and then you hearing only 7 days #kuku worst app ever I use 🤮",
        "thumbs_up_count":1,
        "title":null,
        "id":15,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 09:47:38",
        "rating":1,
        "review_text":"kuku FM became greedy. There isn't much improvement in Library but they increased price Rs.1499\/- per year & Rs.499 for three months which is costly and also there is no options for monthly subscription plan. I truly disappointed 😞",
        "thumbs_up_count":1,
        "title":null,
        "id":16,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 08:59:39",
        "rating":2,
        "review_text":"not permitting to hear the downloads off line. when the internet is out, like on a flight or in areas without network, it logs out and deleats all tge downloaded files. its so annoying to get this isaue even after paying a hand and a leg",
        "thumbs_up_count":1,
        "title":null,
        "id":17,
        "theme":"App Interface & Bugs",
        "sentiment":"Negative",
        "tag":"Offline Functionality"
    },
    {
        "date":"2025-11-19 16:34:31",
        "rating":1,
        "review_text":"🛑🛑🛑🛑I tried 7 days free subscription from kukufm. but it is completely fake. the payment was auto debited in quarterly. this a cheating of kukufm. don't subscribe this channel🛑🛑🛑🛑. their support system is also harmful and there, s no proper way to cancel the subscription or get money back. very disappointing experience- I had strongly advise others not to trust their so called\"free trial \".kuku fm is completely scam, don't trust this channel. don't trust don't trust,🛑🛑🛑🛑🛑🛑🛑🛑🛑🛑",
        "thumbs_up_count":0,
        "title":null,
        "id":18,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-20 03:26:09",
        "rating":3,
        "review_text":"As i was new i was unknown about this app featured. i request to pay my refund back, but no refund even after 5 days. please refund my money, i request for refund on the same day of deduction. no reply for mail also. please become active for customer and, get a human for quarry section not a bot.",
        "thumbs_up_count":0,
        "title":null,
        "id":19,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"No Communication"
    },
    {
        "date":"2025-11-20 05:11:47",
        "rating":5,
        "review_text":"All Audio voice is so cute...Very interesting Story...and addicting...in many times...",
        "thumbs_up_count":0,
        "title":null,
        "id":20,
        "theme":"Content Library Quality",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-22 03:53:12",
        "rating":1,
        "review_text":"Talking about this app, it is just garbage. You have to pay money to watch any video. Never install apps like this.",
        "thumbs_up_count":0,
        "title":null,
        "id":21,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-22 10:49:47",
        "rating":1,
        "review_text":"Iam really disapponpment this app.after 1 month automactly deducted ₹499 without any permission this app monthly ask for the ₹499 I cancel my membership but amount was deducted plese cancel my membership",
        "thumbs_up_count":0,
        "title":null,
        "id":22,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-24 06:11:44",
        "rating":1,
        "review_text":"This kukufm company is a fraud. They are not refunding my money. after giving all proofs of Autopay deduction by fault. I am not taking any kind of service from this kukufm but still they are deducted payment from my account 2 times. so I will suggest to everyone. please don't download this kukufm.",
        "thumbs_up_count":0,
        "title":null,
        "id":23,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-25 08:50:25",
        "rating":5,
        "review_text":"So many good dramas in one place. Love the short, gripping episodes. Very easy to use.",
        "thumbs_up_count":0,
        "title":null,
        "id":24,
        "theme":"Content Library Quality",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-27 06:20:22",
        "rating":5,
        "review_text":"Vertical format dramas are so fun to watch. Very well made shows. Perfect bite-sized entertainment.",
        "thumbs_up_count":0,
        "title":null,
        "id":25,
        "theme":"Content Library Quality",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 13:34:07",
        "rating":1,
        "review_text":"My money was deducted and I made so many requests that it be returned to me. Means I believed the swear really koko fm is disappoint me that is very bad!! 😤👎",
        "thumbs_up_count":0,
        "title":null,
        "id":26,
        "theme":"Hidden Auto-Pay Charges",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 18:46:11",
        "rating":1,
        "review_text":"this app is not maintain properly they let somany stories are incomplete and they did not complete the stories properly in tamil it's very very worst they didn't continue the stories like detective maarran season 6 it's incomplete, Dark knight it's incomplete and doctor X it's incomplete I hate this app",
        "thumbs_up_count":0,
        "title":null,
        "id":27,
        "theme":"Content Library Quality",
        "sentiment":"Negative",
        "tag":"Other"
    }
]