[
    {
        "date":"2025-12-02 14:46:08",
        "rating":1,
        "review_text":"2025-Reduced to 1 star. This app is going downhill. Contact Us-How Do You Want to Contact Us pop up contains only cancel icon.Lol.General queries do not contain prompt for refund related to wrongly delivered scenario. To connect with human agent is a dream (: 2024 (3*)-The flow was wonderful an year or so back. Had an issue with exchange\/ return. The Support feature is a task, hidden away in order of order. Even after that, using it is such a hassle.",
        "thumbs_up_count":7898,
        "title":null,
        "id":1,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-03 21:31:33",
        "rating":1,
        "review_text":"I really hate the new update . 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️😭the new update just made the app harder to use . like why do you need to complex thinhs ?",
        "thumbs_up_count":600,
        "title":null,
        "id":2,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 04:33:47",
        "rating":1,
        "review_text":"Terrible service. I placed an order from Myntra. The product was of worst quality, so I requested a return. The product was picked up from my location the next day, and the status showed 'return picked up failed. I contacted customer support through chat, and they informed me that my query would be resolved by Dec 2nd. However, the next day, I received a text message stating that the return was cancelled. Now, when I'm trying to connect with customer support i don't get option to connect.",
        "thumbs_up_count":250,
        "title":null,
        "id":3,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-26 18:41:48",
        "rating":1,
        "review_text":"I am extremely disappointed with my recent experience with Myntra. I placed an order using the 33-minute delivery option, but after waiting for 2 hours, I checked the status and saw that the order was cancelled from their side. I had already paid for the product. This happened on Saturday, and when I contacted customer support, they assured me that the refund would be initiated and I would receive it within 5 days. Today is the 5th day, and I still haven’t received my refund. When I reached out",
        "thumbs_up_count":188,
        "title":null,
        "id":4,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-02 07:19:37",
        "rating":5,
        "review_text":"I placed 3 orders worth ₹9000\/- change. It still shows 1113\/7000 in Myntra Insider status. I raised a complaint through mail. Still no use. Worst app in terms of updating purchases status. If it still continues no account is going to be Myntra insider.",
        "thumbs_up_count":109,
        "title":null,
        "id":5,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-04 10:20:14",
        "rating":5,
        "review_text":"I have been using the Myntra app for a long time and it has always been a great experience! The app is very easy to use, products are well categorized, and the search filters really help in finding exactly what I want. The pricing is competitive, and there are frequent offers which make shopping affordable. Delivery is usually quick, and the packaging is neat. I also appreciate the smooth return and refund process",
        "thumbs_up_count":50,
        "title":null,
        "id":6,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-02 19:07:17",
        "rating":1,
        "review_text":"I have ordered ethnic bandhgala and requestd Myntra to deliver it on 3rd Dec just a day early frm est. date of 4th or before. Product has reachd Mumbai on 2nd, but still showing delivery on 4th. I feel there is no value of loyal customer at Myntra who is associated with them for 10+yrs. I will start shopping offline bcz when a Cx requests offline shops for early delivery they understand Cx request and make it happen. No such thing at Mynta. Lets see what happens. Extremely unhappy with Myntra.",
        "thumbs_up_count":50,
        "title":null,
        "id":7,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-03 06:48:01",
        "rating":1,
        "review_text":"I am highly disappointed with myntra service lately.... If you are not providing the coustomer with the company's tag how can you expect the coustomer to provide with the tag while returning the item.... It has been almost a week I am trying to return an item but cannot thanks to your useless service... I want my refund back whether you pick up the item or not because it is useless for me ..... Really disappointed ... does not deserve even 1 star",
        "thumbs_up_count":24,
        "title":null,
        "id":8,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 17:29:23",
        "rating":5,
        "review_text":"I don't have to look at 10 showrooms to find a cotton kurta that suits me. always able to find the best options.",
        "thumbs_up_count":18,
        "title":null,
        "id":9,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 06:52:38",
        "rating":5,
        "review_text":"edit: okay, the issue is resolved, and I'm happy with it, to see that it has been resolved in less that 24 hours, thank you myntra, the experience so far has been really good, the price, the collection, delivery experience. but the only issue is that the app often faces bugs, and glitches here and there, apart from that, everything is good. Great job, Team Myntra.",
        "thumbs_up_count":16,
        "title":null,
        "id":10,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-02 08:09:43",
        "rating":5,
        "review_text":"Bad experience...variety of cloths but they are high priced ...quality is not up to the mark....you can buy some same product from flipkart or amazon at low price",
        "thumbs_up_count":9,
        "title":null,
        "id":11,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-06 10:14:37",
        "rating":1,
        "review_text":"The reason why I use to buy from myntra was because it had genuine reviews. Now they have removed all 1 star reviews and all other reviews that gave information. I had given a 5 star review for nike sports bra and they did not approve my review because I had mentioned its not full coverage. This app should be complained to customer department of India for fraud. If there is any competetion with myntra I will choose that app instead. This is a scaming company. With hiring non ethical celebrities",
        "thumbs_up_count":8,
        "title":null,
        "id":12,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 13:46:54",
        "rating":4,
        "review_text":"I thought this app was good but simply they didn't answer my queries regarding refund. They say they have initiated the refund but I didn't receive it. They are giving a reference number which is of no use. I still haven't received my refund for 3 products. And they didn't even bother to tell me about the refund.",
        "thumbs_up_count":8,
        "title":null,
        "id":13,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-01 06:45:18",
        "rating":1,
        "review_text":"We can’t edit the contact number during emergencies — that’s a major drawback. Customer care is also not as helpful compared to other platforms. I uninstalled the app today. Recently, Myntra has been losing our trust. I even received the wrong product in my last purchase. Yes, they refunded it, but they have still lost my confidence in them. Every other platform has improved their quality and service, but Myntra seems to be going backward",
        "thumbs_up_count":7,
        "title":null,
        "id":14,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-01 12:30:04",
        "rating":5,
        "review_text":"Myntra is a fashion paradise in your pocket! The app is super easy to use, and I love browsing through all the trendy clothes, shoes, and accessories. The filters are great for narrowing down your search, and the high-quality photos make it easy to see what you're buying. I really appreciate Myntra's fast and reliable delivery service. The app also offers a lot of cool features, like personalized recommendations and styling tips.",
        "thumbs_up_count":5,
        "title":null,
        "id":15,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-27 17:07:39",
        "rating":1,
        "review_text":"0(Zero) Star This is the worst and most useless app. Whenever you order any item from this app after seeing the discount, the order is placed but firstly the item is not delivered on the scheduled time and later the order is also cancelled by them and the customer is not even told the correct reason for it and not only this, along with this app, its customer care service is also useless where you never get a solution to your problems and the matter is diverted by saying some memorized lines.",
        "thumbs_up_count":4,
        "title":null,
        "id":16,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 19:12:38",
        "rating":5,
        "review_text":"Good ❤️",
        "thumbs_up_count":3,
        "title":null,
        "id":17,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-27 02:13:39",
        "rating":5,
        "review_text":"Earlier I used to shop mostly from myntra and it was a great experience but since few month back I got damage,fake brand and used product which was disappointing, I got refund for the same though. But since few weeks I again started shopping from myntra as it was ones of my favorite shopping app and I wanted to give it a try again. To my surprise I felt Myntra is back again and now Iam very happy with the good deals, good product quality and on time delivery. Thanku Myntra .",
        "thumbs_up_count":3,
        "title":null,
        "id":18,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-06 03:55:15",
        "rating":4,
        "review_text":"Original product always delivered but image of d product is highly colourful & very sharped but product is actual in very light colour.",
        "thumbs_up_count":2,
        "title":null,
        "id":19,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-04 16:25:51",
        "rating":1,
        "review_text":"Terrible customer service. not ready to provide a resolution. I had to follow up multiple time via call and messages for a fake product delivered to me (it was of cheap quality, had no brand tags). they didn't even exchange it - which tells that they deliberately sent the fake product. It was not a product which had any no-returns policy. Not going to use this app again. uninstalling it right away. Been on multiple calls for like 20-30 minutes but even then no resolution provided.",
        "thumbs_up_count":2,
        "title":null,
        "id":20,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 18:05:52",
        "rating":1,
        "review_text":"Extremely bad experience with replace request.Customer care refused to raise complaint\/service request for replacement saying we do not have the option though it was mentioned on their site ,Hassel free replacement. Also they refused to confirm the same over email\/in written. And then after 30 min of waiting time to talk to her supervisor, customer care person disconnected the call . Nov 2025 - another bad experience with their exchange policy.Better to move to other competitors.",
        "thumbs_up_count":2,
        "title":null,
        "id":21,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-06 14:07:51",
        "rating":5,
        "review_text":"very happy",
        "thumbs_up_count":1,
        "title":null,
        "id":22,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-05 16:21:35",
        "rating":1,
        "review_text":"for returning they create an issue I don't like that",
        "thumbs_up_count":1,
        "title":null,
        "id":23,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-05 12:51:39",
        "rating":4,
        "review_text":"a very good app to get you good clothes at decent prices as well. the makeup and skincare goodies are also amazing with their discounts.",
        "thumbs_up_count":1,
        "title":null,
        "id":24,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-05 11:48:20",
        "rating":1,
        "review_text":"All that Glitters is not Gold..Myntra is no more what they used to be .they are very Unprofessional..if you give the office address they come to deliver after office hours .if you try to contact Myntra Customer care they say they don't have the courier person contact no and can't do anything about it..The Courier person will not even answer the phone...Very Poor n unprofessional..high time we looked for options",
        "thumbs_up_count":1,
        "title":null,
        "id":25,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-04 19:11:49",
        "rating":5,
        "review_text":"Best place for clothing",
        "thumbs_up_count":1,
        "title":null,
        "id":26,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-04 19:10:31",
        "rating":5,
        "review_text":"SuperSeBhiUper!",
        "thumbs_up_count":1,
        "title":null,
        "id":27,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-04 10:06:32",
        "rating":1,
        "review_text":"my experience remains still same even after years of my review. Poor service, they don't have control over delivery its been a month i didn't get my item. Their recommendations is pathetic. They close complaint without a solution also the main no one calls during delivery have complained many times no one is bothered.",
        "thumbs_up_count":1,
        "title":null,
        "id":28,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-04 09:22:04",
        "rating":5,
        "review_text":"I am using Myntra for some time now, The app is honestly, I am really happy with it! easy to use, the collections are trendy, branded products and the delivery is usually on time. I love how they always have great deals and discounts it makes me shop even more fun! The product quality has also been good so far, and the packaging is neat and safe. Return, refund and replacement is very good 👍 Overall, Myntra has become one of my favorite online shopping apps.",
        "thumbs_up_count":1,
        "title":null,
        "id":29,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-04 06:58:48",
        "rating":4,
        "review_text":"Very very poor service. Guys don't buy anything from this website",
        "thumbs_up_count":1,
        "title":null,
        "id":30,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-03 20:28:36",
        "rating":3,
        "review_text":"lags a lot during sales, crashes as well sometimes product prices are inflated on purpose before sales",
        "thumbs_up_count":1,
        "title":null,
        "id":31,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-02 18:34:03",
        "rating":5,
        "review_text":"You can get your desired dress on Myntra. New design, stylish and branded clothes. Prices are a little bit higher than other apps but you can get a small discount also.",
        "thumbs_up_count":1,
        "title":null,
        "id":32,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-02 15:21:45",
        "rating":1,
        "review_text":"I have been a regular and long-standing customer of Myntra, placing orders almost every month. However, over the past month, all items in my cart are consistently showing as \"Not deliverable to selected pincode.\" This issue appears unusual, as other e-commerce platforms are not facing any logistical constraints in my area. Given Myntra's scale and reputation, I request clarification on whether this is a technical glitch or a service limitation, and would appreciate a resolution at the earliest.",
        "thumbs_up_count":1,
        "title":null,
        "id":33,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-02 10:03:52",
        "rating":1,
        "review_text":"Worst service.",
        "thumbs_up_count":1,
        "title":null,
        "id":34,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 19:13:04",
        "rating":5,
        "review_text":"One stop solutions for shopping...",
        "thumbs_up_count":1,
        "title":null,
        "id":35,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 02:49:03",
        "rating":1,
        "review_text":"it's worthless app. because it can't provide parcel at promise date. if I try to call customer but she\/he can't respond me. 😡😠",
        "thumbs_up_count":1,
        "title":null,
        "id":36,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 08:22:06",
        "rating":1,
        "review_text":"myntra rejects honest reviews. I wrote one review where the product material was deliberately misguided by the supplier, They said pure cotton but it was cheap polyster. myntra rejected my review saying its related to sales service. How can we trust a platform which hides authentic reviews and gives false reviews only to customers. If you want to check see 1 star reviews you will not find description. There is no real way to get human customer support. Pathetic Customer care. Amazon is better.",
        "thumbs_up_count":1,
        "title":null,
        "id":37,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-29 04:54:15",
        "rating":1,
        "review_text":"This app used to be good but my experience for past few orders is very much disappointing... I exchanged one order because of size issue... it didn't get it delivered the day that was mentioned... After raising issue for the same and connecting customer care, it was not helpful at all. After my every question about the status of my order, i get the same mugged up answer by customer service and it is going to be 1 week since the mentioned delivery date, i have not received my order at all.",
        "thumbs_up_count":1,
        "title":null,
        "id":38,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 21:17:34",
        "rating":1,
        "review_text":"Unnecessary hassle by making user add non shippable items to cart. When an item can't be shipped to a certain location why does the app make the user add it to cart???. While going to cart for checkout message shows item not shippable to location making a fool out of customers. complete waste of time",
        "thumbs_up_count":1,
        "title":null,
        "id":39,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 12:13:19",
        "rating":1,
        "review_text":"The offers shown, are not provided",
        "thumbs_up_count":1,
        "title":null,
        "id":40,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-28 10:40:27",
        "rating":1,
        "review_text":"3rd time I am having a really bad experience with myntra 1 st time they didn't delivered my order and said it was delivered I had to fight them for a month. 2 nd time delivery boy's behaviour was very bad and asked me to come to a far place to collect the order I had to cancel the order. And now they are sending an expir product and asking me to keep exchanging me and I have exchanged it a 3 time still getting expired product in a row still getting the same answer from them that keep exchanging.",
        "thumbs_up_count":1,
        "title":null,
        "id":41,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-11-27 14:54:47",
        "rating":1,
        "review_text":"if you don't want to deliver the order don't offer it in the first place.. Orders keep getting delayed for no reason when the order is in my city at least let me contact the delivery partner and the customer help is just an announcement.. it has happened for the second time . experience is getting worse day by day..",
        "thumbs_up_count":1,
        "title":null,
        "id":42,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-06 15:44:18",
        "rating":5,
        "review_text":"very nice app",
        "thumbs_up_count":0,
        "title":null,
        "id":43,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-06 15:43:53",
        "rating":5,
        "review_text":"really good app",
        "thumbs_up_count":0,
        "title":null,
        "id":44,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-06 15:40:38",
        "rating":1,
        "review_text":"horrible inse achcha to dusre app hain",
        "thumbs_up_count":0,
        "title":null,
        "id":45,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-06 15:39:57",
        "rating":1,
        "review_text":"Worst app and pathetic experience, especially when it is related to exchange or replacement.",
        "thumbs_up_count":0,
        "title":null,
        "id":46,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-06 15:31:22",
        "rating":5,
        "review_text":"it's a good shoping app",
        "thumbs_up_count":0,
        "title":null,
        "id":47,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-06 15:27:31",
        "rating":3,
        "review_text":"Nice app",
        "thumbs_up_count":0,
        "title":null,
        "id":48,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-06 15:26:20",
        "rating":1,
        "review_text":"very bad return and exchange and dilivery agent experience",
        "thumbs_up_count":0,
        "title":null,
        "id":49,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    },
    {
        "date":"2025-12-06 15:25:51",
        "rating":5,
        "review_text":"Great experience! Fast delivery, quality products. Myntra never disappoints.",
        "thumbs_up_count":0,
        "title":null,
        "id":50,
        "theme":"Uncategorized",
        "sentiment":"Neutral",
        "tag":"Other"
    }
]