[
    {
        "date":"2025-11-25 16:42:19",
        "rating":1,
        "review_text":"The worst app to order from. Happened with me 3 times now, always thought might be a mistake but this time it was worse. Ordered 2 items from a restaurant, and received none, an empty bag with the cheapest product of the restaurant available. Never happened with any other delivery apps. Also no instant customer support, where should I put up my issue",
        "thumbs_up_count":183,
        "title":null,
        "id":1,
        "theme":"Missing or Wrong Items",
        "sentiment":"Negative",
        "tag":"Wrong Item Received"
    },
    {
        "date":"2025-11-25 01:53:52",
        "rating":1,
        "review_text":"Used to love Swiggy but it's getting worse everyday. Got orders delayed by half an our, got cold food delivered, didn't get any compensation. All I got was false promises, twice. Was trying to add a mode of payment and mistakenly placed an order today. Immediately went to cancel the order only to be informed a cancellation fees of the full amount would be charged. it's not even been a minute yet. Frustrating would be understatement.",
        "thumbs_up_count":122,
        "title":null,
        "id":2,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"Immediate Cancellation Fee"
    },
    {
        "date":"2025-11-23 09:22:35",
        "rating":1,
        "review_text":"While ordering, they promise to deliver in 35mins but it is never within the promised time. I understand, delays might be due to traffic or any other reasons in real-time, but delay upto 30-40mins from the actual time is just ridiculous and unacceptable. Plus they want us to pay more for faster deliveries, yet on that too, they delay the orders. No point of paying extra. Better to prefer other food delivery apps when in cases of emergency.",
        "thumbs_up_count":96,
        "title":null,
        "id":3,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Paid Feature Failure"
    },
    {
        "date":"2025-11-21 10:26:58",
        "rating":1,
        "review_text":"I’ve faced delivery delays many times with Swiggy, and most of my orders end up getting canceled. My last order took 1.5 hours just to assign a delivery partner, even though the delivery itself needed only 45 minutes. When I asked to cancel, they said the money couldn’t be refunded. Only after I insisted on either delivering within 30 minutes or refunding did they finally cancel the order. Very disappointing service.",
        "thumbs_up_count":79,
        "title":null,
        "id":4,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Refund\/Compensation Issue"
    },
    {
        "date":"2025-11-30 16:02:53",
        "rating":1,
        "review_text":"I am having back to back bad experience with the app where I order some food and few items are missing after delivery. On requesting for help, bot asks few question and then when I choose the option for talk to agent, it will send an auto message which says we will get back to you in 4-6 days via mail since we need more time to investigate. This is so disgusting and frustrating. And when the agen finally comes back( if they comes back) on mail there is no resolution. Complete waste.",
        "thumbs_up_count":52,
        "title":null,
        "id":5,
        "theme":"Missing or Wrong Items",
        "sentiment":"Negative",
        "tag":"Support & Refund Failure"
    },
    {
        "date":"2025-11-30 15:05:10",
        "rating":1,
        "review_text":"Worst app, takes the order automatically in the name of user friendly interface and also doesn't give any option to cancel the order, with 100% cancellation fee applied to your next order, adding insult to the injury. Going to never place any order from it. Since so many people have given 4 or more stars, that's why they don't bother to resolve the issues of their customers. Bad experience from the customer support, too. They behave so weird",
        "thumbs_up_count":50,
        "title":null,
        "id":6,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"App\/Technical Error"
    },
    {
        "date":"2025-11-20 10:58:44",
        "rating":1,
        "review_text":"Pathetic customer support , completely Unprofessional. Delivery partner misbehaved and left without delivering the order , yet the app showed that order has been delivered. After so many mails & calls to the Support team to help me regarding the issue , they didn't even responded to the calls properly. Would recommend everyone to look for better customer friendly platforms.",
        "thumbs_up_count":48,
        "title":null,
        "id":7,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Delivery Staff Behavior"
    },
    {
        "date":"2025-11-25 17:33:45",
        "rating":1,
        "review_text":"If I had a minus option to give, I would gladly do so. It's very rare that I give 1 star to any food organisation but they deserve it. I ordered from Instamart n the food delivery both at different times on the same day. But they couldn't provide any delivery agent on time and it had been too long so I cancelled the order. But they charged the entire amount as cancellation fee. This isn't the first time that such a thing happened. They are a fraudulent organisation.",
        "thumbs_up_count":32,
        "title":null,
        "id":8,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"Delivery Failure Charge"
    },
    {
        "date":"2025-11-20 04:20:44",
        "rating":1,
        "review_text":"I paid extra for an express delievery, so that my order reaches on time. But got delayed a lot. There is no point in adding any extra membership to swiggy, as they do not serve well Late orders on express delievery and even customer care says we will refund the amount. Means no accountability on the paid features of app, but refunds only. Really frustrated here with swiggy now.",
        "thumbs_up_count":22,
        "title":null,
        "id":9,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Paid Feature Failure"
    },
    {
        "date":"2025-11-26 18:21:17",
        "rating":1,
        "review_text":"Extremely disappointed with Swiggy Instamart’s pathetic service. This is not the first time my orders were delayed or cancelled. Today, after spending over an hour selecting items, my order was cancelled just because the weight was more. Instead of assigning another delivery agent, you conveniently cancelled it. This unreliability and lack of accountability is unacceptable. Your service is becoming impossible to trust.",
        "thumbs_up_count":11,
        "title":null,
        "id":10,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Unexplained Cancellation"
    },
    {
        "date":"2025-11-29 16:35:13",
        "rating":1,
        "review_text":"Ordered food, it was getting delayed with no additional notice. Then it got cancelled because the \"restaurant was too stressed\" over an hour after originally placing the order. If you can't make it, you should cancel it early on instead of making us wait, no? And if the customer decides to cancel their order even a minute later they take the whole charge but if the restaurant is canceling randomly they face no extra repurcussions.",
        "thumbs_up_count":9,
        "title":null,
        "id":11,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Unexplained Cancellation"
    },
    {
        "date":"2025-11-30 10:20:19",
        "rating":1,
        "review_text":"I am giving 1 star to just highlight the issue. While ordering on zomato it has 2 coupon sections one from restaurant and other from different banks. While swiggy has only 1 section of coupon in which customer can either apply bank offers or restaurant coupon so i always order from zomato i request swiggy to implement the same feature that will be beneficial for customers. Thanks",
        "thumbs_up_count":8,
        "title":null,
        "id":12,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-23 09:22:59",
        "rating":1,
        "review_text":"Order was placed twice automatically and when I called to cancelled one of the order within a moment after order. they said we will charge the amount equal to order amount which is huge amount for me. There should be some system that should feel burden to make the such penalty. that too penalty for what there technical issue. I don't have such a huge amount to pay neither I call eat so much of food. I had the worst experience. I am deleting Swiggy forever and will never order again from this app",
        "thumbs_up_count":6,
        "title":null,
        "id":13,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"App\/Technical Error"
    },
    {
        "date":"2025-11-29 16:09:09",
        "rating":1,
        "review_text":"Honestly if I could give Swiggy zero stars I'd do that instead. I've had the most unsatisfactory experience with Swiggy tonight. This app has intentionally hidden the actual amount of time needed for a delivery and instead kept postponing the delivery time after ordering. I waited more than an hour for my order which didn't even have a delivery partner, which they didn't even let me cancel or get even a half refund. Seeing such scummy tactics employed by Swiggy is very disheartening.",
        "thumbs_up_count":5,
        "title":null,
        "id":14,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Inaccurate Tracking"
    },
    {
        "date":"2025-11-22 20:26:51",
        "rating":1,
        "review_text":"Again had the opportunity to get my order cancelled with a premature reason stating that there is a technical issue. The delivery partner was assigned and reached for pickup and finally a call landed you people should close the business if you can't fullfill the demand. Worst food delivery app. I wish there was a minus review option. worst service",
        "thumbs_up_count":4,
        "title":null,
        "id":15,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Unexplained Cancellation"
    },
    {
        "date":"2025-11-28 15:38:29",
        "rating":1,
        "review_text":"On it's way to a slow death. Charging customers for convenience but its turning into the most inconvenient service to use. No live chat support, asking customers to email concerns with 5-6 hours for resolution, high fees and charges, customer service executives who offer no resolution to anything. It's ironic an app aim for 10-minute doesn't have 10-minute customer solutions. I used to love swiggy but not I am sick of it. i will be uninstalling the app and cancelling my swiggy card.",
        "thumbs_up_count":3,
        "title":null,
        "id":16,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Slow\/No Response"
    },
    {
        "date":"2025-11-28 22:44:48",
        "rating":5,
        "review_text":"Comparing the two giants Swiggy and Zomato, I find Swiggy's user interface much cleaner and use friendly. The best part is it allows me to order food for my family and friends from Abroad and pay via local bank using upi. No other food delivery app has this functionality. Thank you Swiggy. Keep up the great service.",
        "thumbs_up_count":3,
        "title":null,
        "id":17,
        "theme":"Other",
        "sentiment":"Positive",
        "tag":"Other"
    },
    {
        "date":"2025-11-21 11:45:43",
        "rating":1,
        "review_text":"worst app, payment screen is automatically debited and it is not asking for confirmation. really worst app I have already emailed on this, asking for a payback of my last order.Even I have cancelled the order within 1 minute of time, but still you people are saying it's as per policy. so as per policy you are stealing money from people. which is really bad.",
        "thumbs_up_count":2,
        "title":null,
        "id":18,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"App\/Technical Error"
    },
    {
        "date":"2025-11-30 14:35:21",
        "rating":1,
        "review_text":"Fraud app money got deducted for my order but they are saying the transaction failed and no refund was obtained until now. Also in the app when you are searching food items are already priced above their original prices, same goes for Instamart items even if you have items worth more than 100rs you will still pay delivery+gst+handling charges unlike other apps where you only pay gst+handling. Also there are more than 70rs GST+handling, even if you order delivery more than 150rs for food delivery",
        "thumbs_up_count":2,
        "title":null,
        "id":19,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-19 17:54:26",
        "rating":1,
        "review_text":"I am extremely disappointed with the service. My order was not delivered to my home, and the delivery status shows ‘address not confirmed’ even though I clearly mentioned the correct address along with the pincode. This caused unnecessary inconvenience and delay. Kindly look into the matter and improve the delivery accuracy.",
        "thumbs_up_count":1,
        "title":null,
        "id":20,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Partner Issues"
    },
    {
        "date":"2025-11-20 09:38:26",
        "rating":1,
        "review_text":"APP IS HORRIBLE, CUSTOMER CARE SERVICE EVEN WORSE. the app is so misleading, it will keep showing 5minutes for your order to arrive for 40minutes. The restaurants have no quality checks whatsoever, food sent is filthy stale almost unsafe to be consumed and the customer care doesn't offer any resolution. The chatbox is a sheer time waste, they'll make you go around from one chat to another to a phone call to an email. I don't know how this company is even running till now.",
        "thumbs_up_count":1,
        "title":null,
        "id":21,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Support Ineffective"
    },
    {
        "date":"2025-11-20 12:54:00",
        "rating":1,
        "review_text":"1\/5 Stars: Absolute service and support failure. Shocking 1+ hour delivery delay for an 8 minute distance, timelines are totally misleading. Support is useless, providing generic, copy-pasted bot responses with zero attempt at resolution. Uninstalling immediately. If you value your time and expect basic human interaction from support, look elsewhere. Worst experience, worst customer service.",
        "thumbs_up_count":1,
        "title":null,
        "id":22,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Bot\/Chat Issues"
    },
    {
        "date":"2025-11-24 06:57:53",
        "rating":1,
        "review_text":"The experience has gone really bad after AI bots have been put up instead of human customer support. The most rudimentary chatbots have been implemented which do not solve any issue at all. Incorrect and misleading estimates being given. Edit 1: Zero improvement. Stopping usage of the app. Edit 2: Doesn't let me delete the account Edit 3: Dineout doesn't let you use your full cashback balance if you have a reasonably big outstanding amount; the balance expires quickly rendering it unusable",
        "thumbs_up_count":1,
        "title":null,
        "id":23,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Bot\/Chat Issues"
    },
    {
        "date":"2025-11-24 19:35:21",
        "rating":1,
        "review_text":"We are been facing delivery delay issues from long time don't won't when is this going to be solved getting hungry ordering food and waiting for 2 hours for our food what is non sense going on in swiggy I use the app almost daily(for both food and grocery) but this is fair to continue with these guys after waiting for this long time we only got the solution to just cancel the order this was my worst experience in this time at 1 pm in the midnight with swiggy it's really becoming worst.",
        "thumbs_up_count":1,
        "title":null,
        "id":24,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Delays"
    },
    {
        "date":"2025-11-25 09:49:18",
        "rating":1,
        "review_text":"Scammers looted my money, an item was missing in my order and i have given all the details for refund which was promised to me in 24 hours. after waiting 24 hours, no refund was received and when i raised another query, the customer care agent says the order is 24 hours older so support can't be given. they are clearly scamming customers. they are like scam centers. i would have posted their chat screenshots to expose these scammers but google playstore doesn't have the option.",
        "thumbs_up_count":1,
        "title":null,
        "id":25,
        "theme":"Missing or Wrong Items",
        "sentiment":"Negative",
        "tag":"Support & Refund Failure"
    },
    {
        "date":"2025-11-25 19:49:16",
        "rating":1,
        "review_text":"after being a regular customer of swiggy for years I just got an order cancel from my side by swiggy cause I didn't pay for my meal twice. I paid for my meal ate it and 30 minutes later swiggy operator calls me they didn't receive payment I offered them payment id but they said they want payment or they will cancel my order and they did which is costing me more in my next order in cart. I won't order anymore until this extra charge is removed and swiigy sends me an apology for wasting my time.",
        "thumbs_up_count":1,
        "title":null,
        "id":26,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 15:32:48",
        "rating":1,
        "review_text":"I'm quite disappointed with the high fees on Instamart. I especially don't understand the \"rain fee\"—I'm not using water from Swiggy's home to experience rain at mine! These extra charges feel unreasonable and make the overall cost hard to justify. please explain the rain fees, as I don't find it in similar apps.",
        "thumbs_up_count":1,
        "title":null,
        "id":27,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 16:03:28",
        "rating":1,
        "review_text":"Pathetic customer service. THEY SEND WRONG ITEMS. and have zero accountability for it. If the restaurant has delivered a wrong item how can one not be accountable. may be they want people who can eat anything without complaining and have blatant disregard for options. order food cash on delivery check the order and then pay\/reject because they do not have \"Customer Service\"",
        "thumbs_up_count":1,
        "title":null,
        "id":28,
        "theme":"Missing or Wrong Items",
        "sentiment":"Negative",
        "tag":"Wrong Item Received"
    },
    {
        "date":"2025-11-30 16:45:58",
        "rating":1,
        "review_text":"ordered Dominos on Swiggy app at 8.15 pm and even at 10.00 pm they haven't delivered and at the end they canceled the order.. worst app to order food.. they haven't updated on the delay or changing delivery guys.. 1st delivery guy showed up on tracking, but when called he said he is in home. 2nd guy came half way and he backed out of delivery and finally after 1.5 hrs they canceled the order without proper notification. worst performance on Dominos and Swiggy. shame on you guys..",
        "thumbs_up_count":1,
        "title":null,
        "id":29,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Partner Issues"
    },
    {
        "date":"2025-11-22 02:58:10",
        "rating":1,
        "review_text":"Pathetic event. I ordered a cake before confirmation the delivery time was 20-35 mins. and the after confirmation the time changes to 45 mins. then I cancelled the order within max for 60 to 90 secs for that the cancellation charges is the amount what I paid for the order. how get policy is that why do this platform gives 100 percent refund for late deliveries why it won't that way. it's not about cancellation charges it how much charging for cancellations. The customer service is another lzom",
        "thumbs_up_count":0,
        "title":null,
        "id":30,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"Immediate Cancellation Fee"
    },
    {
        "date":"2025-11-22 05:05:02",
        "rating":1,
        "review_text":"today I ordered food by applying voucher,stupid app didn't show any messages that the mode of payment applied will not validate the voucher.directly it has gone to upi app.There I noticed it and cancelled the payment.Here is the trick by Swiggy,in Swiggy app it has shown message to continue or cancel,here it has not shown the total amount. when continue clicked,accepted the order without payment, again tricked with full amount. mailed to support team also.",
        "thumbs_up_count":0,
        "title":null,
        "id":31,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-22 12:19:12",
        "rating":3,
        "review_text":"The food prices displayed on Swiggy are excessively high. For example, Let’s Eat in Edapally, Kochi sells a chicken shawarma for ₹120 in-store. However, on 22-11-2025, the same item was listed on Swiggy for ₹168. After including Swiggy’s additional charges, the total came to ₹254 — an increase of over 111%. Such an exorbitant price difference is unreasonable and unacceptable.",
        "thumbs_up_count":0,
        "title":null,
        "id":32,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-22 16:56:44",
        "rating":1,
        "review_text":"very bad experience. i placed an order and after waiting for 2 hours, when i called the rider to check the status of the food delivery, he told me the order got cancelled. I was neither informed nor the money got refunded. i contacted the customer care again and a representative took the call and arranged another rider. After waiting for 20 mins, the order got cancelled!",
        "thumbs_up_count":0,
        "title":null,
        "id":33,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Unexplained Cancellation"
    },
    {
        "date":"2025-11-22 16:57:11",
        "rating":1,
        "review_text":"Worst delivery with Swiggy always. They intentionally do a double order and make the delivery very delayed. It takes hours to get the order delivered to the customer. I have placed my order at fasos wrap which is around 3km distance from my place around 9:30 pm now it is 10:24 yet they are saying it will take 20min to deliver the food. This is the 4th time I've faced this issue. I have decided not to order again. Thank you Swiggy for a super faster delivery service.",
        "thumbs_up_count":0,
        "title":null,
        "id":34,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Partner Issues"
    },
    {
        "date":"2025-11-22 19:09:07",
        "rating":1,
        "review_text":"I don’t understand how some people get their food on time. This has been the worst service I’ve experienced. If anyone from Swiggy is reading this, please set realistic delivery times. Add 10–15 extra minutes if needed, but don’t let it exceed more than 30 minutes. It’s frustrating when we try contacting the store, delivery partner, and support while waiting endlessly. We keep hoping it’ll arrive any moment, but even after an hour and nearly 2 hour, there’s nothing. Completely unacceptable.",
        "thumbs_up_count":0,
        "title":null,
        "id":35,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Delays"
    },
    {
        "date":"2025-11-22 19:23:42",
        "rating":1,
        "review_text":"not a good app. no value for customers & waste of time and money.. it's better if you reach restaurant and enjoy the fresh instead of paying more and have a late dinner\/lunch.. the swiggy have no value for time and money and not even realise their mistakes, they will become boss after placing a order just because they got our money, then can do anything in the name of policy.. they will make you waited for 40 minutes, for order which you should deliver in 15 minutes.. don't use this app..",
        "thumbs_up_count":0,
        "title":null,
        "id":36,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Delays"
    },
    {
        "date":"2025-11-23 03:38:21",
        "rating":1,
        "review_text":"Worst app ever. I wasn’t able to place even a single order on the train, but the money still got debited and is not refundable for up to a week. I have to send constant emails and make calls, yet there is no response. After sending multiple emails repeatedly, they responded only after three days.",
        "thumbs_up_count":0,
        "title":null,
        "id":37,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Refund Failure"
    },
    {
        "date":"2025-11-23 05:44:12",
        "rating":1,
        "review_text":"whenever we want food on time it is getting delayed, it shows 30 mins and later the time increases and get item delivered in 50 mins, delivery partner do double delivery. all false promises. instamart often shows service temporarily unavailable. other apps are much better than swiggy. not recommended",
        "thumbs_up_count":0,
        "title":null,
        "id":38,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Partner Issues"
    },
    {
        "date":"2025-11-23 06:49:29",
        "rating":1,
        "review_text":"Swiggy has become the worst. The food got delivered after 80 minutes of ordering. It showed 20 mins on the app while ordering it. There is no proper service also for cancelling the order. What is the use of ordering food when you are hungry if it arrives after 80 mins.",
        "thumbs_up_count":0,
        "title":null,
        "id":39,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Delays"
    },
    {
        "date":"2025-11-23 09:29:21",
        "rating":1,
        "review_text":"Extremely bad experience. Today I order food my dad who is far from me. Actual estimated time of delivery is 40 minutes. I have waited for 40 minutes still delivery partner not assigned. Then I called customer care spend with them more than 35 minutes in call they assigned a delivery partner. Then also he doesn't pickup my order. Then I called the restaurant, by that time only they are seeing there is an order was there. For everything I have call and arranging. Worst customer care.",
        "thumbs_up_count":0,
        "title":null,
        "id":40,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Slow\/No Response"
    },
    {
        "date":"2025-11-23 09:40:00",
        "rating":1,
        "review_text":"Guys please beware that Swiggy Instamart delivers expired products and cheats in the weight of the fruits and vegetables. I think that it's their business model to silently cheat customers like this ,as people generally do not check for the weights of the products they receive. It's my personal experience. You check the expiry dates of all products and also weigh the groceries delivered by Instamart .",
        "thumbs_up_count":0,
        "title":null,
        "id":41,
        "theme":"Missing or Wrong Items",
        "sentiment":"Negative",
        "tag":"Poor Product Quality"
    },
    {
        "date":"2025-11-23 12:49:19",
        "rating":1,
        "review_text":"I recently had a disappointing experience with Swiggy. Their customer service seems to have declined significantly. I received a completely different dish from what I had ordered, and despite sharing photos and all required details, Swiggy simply responded by saying that give poor rating to restaurant, they couldn’t offer any refund or even request the restaurant to send the correct item. While Swiggy charges a platform fee and encourages customers to tip delivery partners",
        "thumbs_up_count":0,
        "title":null,
        "id":42,
        "theme":"Missing or Wrong Items",
        "sentiment":"Negative",
        "tag":"Wrong Item Received"
    },
    {
        "date":"2025-11-23 18:04:15",
        "rating":1,
        "review_text":"Swiggy's former reliable and efficient customer service has gone down the tubes. Got sent the wrong order, and when I tried getting help, I found out that Swiggy has ended live chat help. After asking me to upload pictures of the incorrect items, I'm then instructed to email swiggy directly, and I will get a response in 6-8 hours! No other option to further connect with customer support is available. Have just received a RESPONSE TO EMAIL - now they will get back to me in 72 HRS!! Shocking!",
        "thumbs_up_count":0,
        "title":null,
        "id":43,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Slow\/No Response"
    },
    {
        "date":"2025-11-24 04:11:49",
        "rating":1,
        "review_text":"I had a bad experience with Swiggy. I cancelled an order within 30 sec and they did not refund anything. this is a big fraud Swiggy is doing. I suggest customers to avoid using Swiggy or instead of cancel order better to get it delivered. The choice is yours, better to avoid such online services.",
        "thumbs_up_count":0,
        "title":null,
        "id":44,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"Immediate Cancellation Fee"
    },
    {
        "date":"2025-11-24 08:16:37",
        "rating":1,
        "review_text":"worst costomer support team as if you raise concern related to package or spillover of the package, they'll send email that you will not get refund to the order but they will do investigation. here am not asking refund. multiple times I had bad experience with Swiggy, as I have raised but the team not ensured to resolve the same. Finally I decided to uninstall the app and lookout other players in the market who gives the best service and gives more attention for best customer experience.",
        "thumbs_up_count":0,
        "title":null,
        "id":45,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Support Ineffective"
    },
    {
        "date":"2025-11-24 09:48:35",
        "rating":1,
        "review_text":"I just edited my review for Swiggy from 5 star to 1. They really were my go to app till date, but not anymore. The delivery agent assigned couldn't deliver my order and in spite of an hour of waiting the customer support couldn't assign a new delivery agent. By then Swiggy auto cancelled the order.",
        "thumbs_up_count":0,
        "title":null,
        "id":46,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Unexplained Cancellation"
    },
    {
        "date":"2025-11-24 09:55:01",
        "rating":1,
        "review_text":"I recently placed an order on 24 Nov, and it has been my worst experience so far. The delivery person, Diwakar Kandasamy, was extremely rude, did not give proper responses, and refused to deliver the order to the location I had specified. He also scanned the order incorrectly and marked wrong information. I am very disappointed with this experience and request that appropriate action be taken regarding this issue.",
        "thumbs_up_count":0,
        "title":null,
        "id":47,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Delivery Staff Behavior"
    },
    {
        "date":"2025-11-24 15:40:30",
        "rating":1,
        "review_text":"Multiple wrong deliveries, abusive delivery partners, missing of orders, giving calling from other customers phones, no response from the support team. Cheating on the quantity and size of material recieved from Instamart.... issues are plenty. list is unlimited. please improve your quality. Don't cheat customers.",
        "thumbs_up_count":0,
        "title":null,
        "id":48,
        "theme":"Missing or Wrong Items",
        "sentiment":"Negative",
        "tag":"Support & Refund Failure"
    },
    {
        "date":"2025-11-24 16:51:51",
        "rating":1,
        "review_text":"I’m really disappointed with Swiggy. I ordered twice, and both times an item was missing. On top of that, there is no instant help—the app says the issue will be resolved in 8–10 hours. What am I supposed to do for 8–10 hours because of Swiggy’s mistake? I’m left eating less due to their repeated errors. This level of service is extremely disappointing.",
        "thumbs_up_count":0,
        "title":null,
        "id":49,
        "theme":"Missing or Wrong Items",
        "sentiment":"Negative",
        "tag":"Missing Items"
    },
    {
        "date":"2025-11-24 17:49:50",
        "rating":1,
        "review_text":"Worst App! Literally poorest service ever seen anywhere like I waited for more than 1.5 hrs for my order and then also the executive told me that my order is given to someone else and also no replacement order was provided and in the middle of the night I was left without a resolution. So won't recommend this app to anyone, don't rely on it at all it will definitely betray you and you will just be left with sorry and no food. Never Ever! Don't Rely on it!",
        "thumbs_up_count":0,
        "title":null,
        "id":50,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Partner Issues"
    },
    {
        "date":"2025-11-24 19:43:32",
        "rating":1,
        "review_text":"Becoming worst app everyday. Often they fail to deliver food on time. Often I faced the inconvenience. After showing a time suppose 30 mins, they can't even deliver it after more than 2 hours. And nobody informs. When you complain they can't take any logical actions. Fake promises, and no compensation. This app is becoming third class everyday. Often I had to sleep without food at midnight (even now when I'm writing this feedback), because they failed to deliver food even after 2 hours.",
        "thumbs_up_count":0,
        "title":null,
        "id":51,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Delays"
    },
    {
        "date":"2025-11-25 10:22:01",
        "rating":1,
        "review_text":"!!!!!!AVOID SWIGGY!!!!!!!! Worst app ever!!!! customer service sucks. Ordered twice from different places and never got my food even after paying for it. when i asked for my money back, they never refunded my money. My advise is to not pre pay for food otherwise you will never get your money back if there is a problem with the order or the delivery guy decides to eat it. i wish i could give less than 1 star but dont have the option. !!!!!!AVOID SWIGGY!!!!!!!!",
        "thumbs_up_count":0,
        "title":null,
        "id":52,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Refund Failure"
    },
    {
        "date":"2025-11-25 15:43:16",
        "rating":1,
        "review_text":"had a very bad experience with my recent Swiggy order. The order was canceled automatically without my request, causing inconvenience and delay. I did not receive any proper explanation for the cancellation, and this has been very disappointing & not a good response Swiggy service not good",
        "thumbs_up_count":0,
        "title":null,
        "id":53,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Unexplained Cancellation"
    },
    {
        "date":"2025-11-25 21:51:16",
        "rating":1,
        "review_text":"Horrible delivery experience. Order was delayed by more than 25 minutes. Worst thing was talking to Swiggy customer care. Not taking any responsibility and saying they can't do anything and I should try and speak with delivery partner even though they were not able to connect with him. Please avoid using their service. I've never experienced such bad service",
        "thumbs_up_count":0,
        "title":null,
        "id":54,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Support Ineffective"
    },
    {
        "date":"2025-11-26 06:56:42",
        "rating":1,
        "review_text":"I have order Burger from Burger king. My assign time was 10.15 but the order was very delayed. I have to wait for 2 hours for my order and still they was telling me to wait for more 10mins. I didn't got my order on time. Very bad service. The estimated time was 25-30 mins and all 5 agents told me to wait for 10mins and it went to 2 hours. I have to cancel my order at last and after all of this mess they were compensating me 39 rs. Please do try different app this app is not promising.",
        "thumbs_up_count":0,
        "title":null,
        "id":55,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Refund\/Compensation Issue"
    },
    {
        "date":"2025-11-26 07:39:36",
        "rating":1,
        "review_text":"Swiggy's app mechanism relevant to tips is awful and needs work. A single tip from one choice is automatically added to future orders and this is an opt-out feature, not an opt-in feature and the customer doesn't get to choose whether the future tips are added as they wish. It really makes a tip from gratitude and one's own free will seem like an obligation and makes users spend more money without their own awareness. Sad and possibly indicative that they don't pay their executives enough.",
        "thumbs_up_count":0,
        "title":null,
        "id":56,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-26 12:29:24",
        "rating":3,
        "review_text":"there is new scam running by swiggy. after you order your food and waited for 30-40 mins, their employee will call you and tell you that your order is cancelled due to unavailability. surprisingly, I called the restaurant and they told that it is available. anyway, I am okay to switch to other platform to order and it may not be your concern to loose the customer. i have proof of it.",
        "thumbs_up_count":0,
        "title":null,
        "id":57,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Unexplained Cancellation"
    },
    {
        "date":"2025-11-26 18:34:28",
        "rating":1,
        "review_text":"not a good experience. I wanted to order food. the delivery partner couldn't find address. despite i send it again privately to his WhatsApp number also.location is same. earlier also delivery has been done here but I don't know what was wrong with the delivery guy and when I talked to customer care they told that on cancelling amount won't be returned . penalty will be taken.so it was highly disgusting and pathetic experience. don't order from Swiggy.don't even return the amount on cancelling.",
        "thumbs_up_count":0,
        "title":null,
        "id":58,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"Delivery Failure Charge"
    },
    {
        "date":"2025-11-27 09:24:06",
        "rating":1,
        "review_text":"i have had the worst experience ever. I have had to wait for 50 minutes yet the delivery app is showing \"will arrive in 17 minutes\". The estimated time should at least be accurate. I could not connect with the restaurant or delivery partner after one and a half hour or waiting and cancellation would be charged too.",
        "thumbs_up_count":0,
        "title":null,
        "id":59,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Inaccurate Tracking"
    },
    {
        "date":"2025-11-27 11:50:24",
        "rating":1,
        "review_text":"This app has become worse to use. I paid the delivery partner and it was successful but after 15 mins the delivery partner came back that they hadn't received the money. I asked the customer care what to do as the payment was successful from my side. He told me to pay the delivery partner and I will get the refund but still I haven't got any refund. I emailed them but there is no response. I wasted more than 3 hours on this and still nothing has been done. Prefer Zomato really they are better.",
        "thumbs_up_count":0,
        "title":null,
        "id":60,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Refund Failure"
    },
    {
        "date":"2025-11-27 17:28:13",
        "rating":1,
        "review_text":"Time to leave swiggy. The main problem is a repeated glitch where the app shows “delivery partner is at the restaurant,” but when I call, there is no one there. Then a new delivery guy is assigned on contacting support & when they reach, the restaurant says no order exists. After wasting around 1.5 hours, support asks me to cancel. This same loop happened 4 times in a month. Other issues: assigning a delivery guy takes far too long unless I contact support & orders get cancelled without reason.",
        "thumbs_up_count":0,
        "title":null,
        "id":61,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Inaccurate Tracking"
    },
    {
        "date":"2025-11-28 09:48:48",
        "rating":1,
        "review_text":"Swiggy was one of the best when it started now they have started the loot .... I placed a order yesterday and by mistake I have selected wrong address and cancelled the order but althey charges the full amount of fees to cancel it hardly it would be 1 minute in which I have cancelled the order and the restaurant would not have started the process also but yet they charged so much",
        "thumbs_up_count":0,
        "title":null,
        "id":62,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"Immediate Cancellation Fee"
    },
    {
        "date":"2025-11-28 14:44:10",
        "rating":1,
        "review_text":"I am extremely disappointed with the service. I lost ₹8,000 because the product delivered was completely defective, and there is absolutely no return option. The issue was identified during installation, and I reported it within just a few hours. Yet, Swingy is refusing to take responsibility and is hiding behind a ‘no return policy.’ This is unacceptable and clearly shows their lack of accountability. I strongly advise others not to trust Swingy, as they do not stand behind their products.",
        "thumbs_up_count":0,
        "title":null,
        "id":63,
        "theme":"Missing or Wrong Items",
        "sentiment":"Negative",
        "tag":"Support & Refund Failure"
    },
    {
        "date":"2025-11-28 15:53:37",
        "rating":1,
        "review_text":"Ruins your experience of online food delivery. Delivers almost all orders long after the estimated time, so much so that delivery partners are at times several miles away from the pick up location. They deliberately stops the Estimated timer and upon requesting cancelation they outrageously demands to accept food prepared long back which which you probably don't need by that time or charge you cancelation fee. BTW NOTHING AGAINST THE DELIVERY PARTNERS, IT IS THE COMPANY. UNINSTALLING THE APP.",
        "thumbs_up_count":0,
        "title":null,
        "id":64,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Inaccurate Tracking"
    },
    {
        "date":"2025-11-28 16:29:19",
        "rating":1,
        "review_text":"Swiggy Support Team, I am writing to express my disappointment with my recent order. The food I received was of very poor quality, and I had expected either a refund or a replacement with proper food from your side. Unfortunately, neither of these was provided. I have always ordered more food and been a regular customer, but this experience and your response have been very disappointing. Because of this, I no longer feel confident using Swiggy. I request you to kindly look into this i",
        "thumbs_up_count":0,
        "title":null,
        "id":65,
        "theme":"Missing or Wrong Items",
        "sentiment":"Negative",
        "tag":"Poor Product Quality"
    },
    {
        "date":"2025-11-28 17:47:08",
        "rating":1,
        "review_text":"I would like to report a serious issue with my recent order. The assigned delivery partner did not call me even once, did not attempt delivery, and then canceled the order on his own. This appears to be intentional, possibly done with the intention of consuming the food, as he seemed aware of a loophole that lets delivery partners cancel without verification.",
        "thumbs_up_count":0,
        "title":null,
        "id":66,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Partner Issues"
    },
    {
        "date":"2025-11-28 19:00:17",
        "rating":1,
        "review_text":"They take order and then once payment is done and even after waiting for 40 mins, they won't assign any delivery partner. When asked them, they say no delivery partner available at that location and if I ask them to cancel they say 100% cancelation fees applicable. How unfair? Can't they know before that delivery partner is not there so can't take the order at first place. It's your mistake to not deliver order on time then why do you charge customer for 100% fees?",
        "thumbs_up_count":0,
        "title":null,
        "id":67,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"Delivery Failure Charge"
    },
    {
        "date":"2025-11-29 02:40:23",
        "rating":1,
        "review_text":"do Cash on Delivery (COD). Swiggy always add extra charges than the restaurant amount. A 7 km food delivery can take 1hr30min, and they often do multiple deliveries on the way. Choose oly cash on delivery, and if they delay the time, do not accept the food,cancel it. For no reason, my 45min order took around 1.5 hours, and since I had already paid, I could not cancel. When I complained that my order was delayed, my delivery partner slowed down even more, and marked the delivery before I got",
        "thumbs_up_count":0,
        "title":null,
        "id":68,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Partner Issues"
    },
    {
        "date":"2025-11-29 04:50:00",
        "rating":1,
        "review_text":"I’ve been a regular Swiggy user but this experience has been very disappointing. The app auto-picked the wrong address due to a glitch and after cancelling the order, Swiggy added a cancellation fee equivalent to my entire order amount to every new order I try to place. Support keeps replying with the same copy-paste “policy” message and refuses to acknowledge that the mistake happened because of the app, not me. I’m not even asking for a refund — just to remove a fee that I shouldn’t be charged",
        "thumbs_up_count":0,
        "title":null,
        "id":69,
        "theme":"Unfair Cancellation Fees",
        "sentiment":"Negative",
        "tag":"App\/Technical Error"
    },
    {
        "date":"2025-11-29 09:38:56",
        "rating":2,
        "review_text":"Used to be good but for the past 2 orders for Dominos, absolute time waste...they book the order and then leave you to the dominos delivery guys, and for both the orders, received after more than one hour and tracking just to misguide. Even Dominos don't care about their so called \"30-minutes delivery guarantee\". So, be careful!!!",
        "thumbs_up_count":0,
        "title":null,
        "id":70,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Delays"
    },
    {
        "date":"2025-11-29 18:18:05",
        "rating":1,
        "review_text":"Honestly, worst food delivery app. Better to go and get the food ourself. Food is delivery late and extra amount is charged for delivery in metro city, which i have never seen on any platform. Please don't install, there are many alternatives if you search.",
        "thumbs_up_count":0,
        "title":null,
        "id":71,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Delays"
    },
    {
        "date":"2025-11-29 18:37:06",
        "rating":1,
        "review_text":"5th time disappointed -shows delivery in 2 mins and makes wait for 2 hours, nobody picks calls, finally no food delivered.later delivery agent calls and says he didn't pick the order itself but the app shows so. Life's biggest biggest biggest mistake ever made is placing order on swiggy. Why people still order even after passing such bad reviews and experience. better to stay starving than ordering on swiggy. Worst service without any customer number and even on chat they don't provide solution.",
        "thumbs_up_count":0,
        "title":null,
        "id":72,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Inaccurate Tracking"
    },
    {
        "date":"2025-11-30 08:17:26",
        "rating":2,
        "review_text":"I used to order alot from Swiggy but this app has gotten disgustingly frustrating, first the deliveries got very much delayed then now because the Swiggy team wasn't able to contact the restaurant I ordered from, my order kept showing \"2 mins\" even after 2 hrs and I cancelled it but even now after ages I discover my order hasn't been cancelled yet and in bonus I'm not able to order cash on delivery, are you serious dude? what the hell",
        "thumbs_up_count":0,
        "title":null,
        "id":73,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Inaccurate Tracking"
    },
    {
        "date":"2025-11-30 08:30:00",
        "rating":1,
        "review_text":"Using swiggy for many years now.. It was good at first but now zero customer service and there is no way to reach them..In my account cod option is disabled and mailed them about the issue so many times as there is no way to reach them..they just replied there was canceled cod order in your account so it is deactivated order few times and pay online to unlock it..but I mailed them again attaching the screenshot of my orders in account that there is no canceled order but no response.",
        "thumbs_up_count":0,
        "title":null,
        "id":74,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Slow\/No Response"
    },
    {
        "date":"2025-11-30 09:03:41",
        "rating":1,
        "review_text":"I used to trust swiggy much more than any other app but these days i lost my hope on it. Every single time something happens. Either very late or wrong order and when the order didn't got delivered, they don't even give any reimbursement. Lost a lot of money.",
        "thumbs_up_count":0,
        "title":null,
        "id":75,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Refund\/Compensation Issue"
    },
    {
        "date":"2025-11-30 15:03:35",
        "rating":1,
        "review_text":"it's too much late time delivery by Swiggy Agent , I notice so many times that whenever I ordered food and my Swigg delivery agent arrive after 1 hour of food ordered , also their Swiggy delivery partner didn't arrive at our specific address ( location) as mentioned in Swiggy Application, I went 2 Kilometres away from my address as mentioned in Swiggy app to recieve my food !!! so Swiggy department should be improve their customer care service and delivery services!!",
        "thumbs_up_count":0,
        "title":null,
        "id":76,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Partner Issues"
    },
    {
        "date":"2025-11-30 15:03:55",
        "rating":1,
        "review_text":"Few restaurants listed in Swiggy never deliver right order but the main problem is customer service, whenever I encounter any issues with any orders from Zomato, their customer service is quick to resolve my issue. But Swiggy customer service is the worst, they never resolve any issue. I just had a problem with my recent order and these mfs denied to help me. Worst food ordering company. ZOMATO IS MUCH MUCH BETTER!!!",
        "thumbs_up_count":0,
        "title":null,
        "id":77,
        "theme":"Poor Customer Support",
        "sentiment":"Negative",
        "tag":"Support Ineffective"
    },
    {
        "date":"2025-11-30 15:39:47",
        "rating":1,
        "review_text":"They charged extra money for faster delivery and after 30 mins of estimated time still at the same place where it was 10 mins ago. I called the customer service and after a couple of dialogue exchanges, I asked for a refund. He canceled this order on my request and I got a refund. but what about the food? and my hunger? what about the time I had been waiting for the food? disgusting policy of the company!!!! uninstall it permanently for sure. Never use anything related to Swiggy.",
        "thumbs_up_count":0,
        "title":null,
        "id":78,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Paid Feature Failure"
    },
    {
        "date":"2025-11-30 16:45:19",
        "rating":1,
        "review_text":"I am experiencing a recurring issue with Swiggy Instamart—before payment, the app displays a lower amount, but when I proceed to the payment page, the total amount increases. This is causing inconvenience and affects the overall customer experience. Kindly look into this matter and resolve the discrepancy at the earliest.",
        "thumbs_up_count":0,
        "title":null,
        "id":79,
        "theme":"Other",
        "sentiment":"Negative",
        "tag":"Other"
    },
    {
        "date":"2025-11-30 18:20:05",
        "rating":1,
        "review_text":"when you got high discount offer on app, delivery partner can't deliver it he picked the order and move away from the location with no hesitation how customer waiting for that , today i wait at least 2 hour he can't picked up my call can't response me , help and support guys were cancel my order.",
        "thumbs_up_count":0,
        "title":null,
        "id":80,
        "theme":"Late or Canceled Delivery",
        "sentiment":"Negative",
        "tag":"Delivery Partner Issues"
    }
]